{
    "filename": "mbcet.ac.in_faculty_ms-lekshmy-o_.html",
    "content": "Ms. LEKSHMY O – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAbout Us\n>\nMs. LEKSHMY O\nEmployee Code / ID No.\n20723006\nQualifications\nM.Sc, M.Phil, B.Ed, (Doing PhD in Chemistry)\nOrcid ID\n—-\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n8606808986\nAreas of Interest / Current Research\nElectrochemical Sensors using Metal Organic Frameworks.\nResearch,  Consultancy, Publication\nMs. Lekshmy O, Chemistry Lab Tutor published a paper entitled, “Iron removal from drinking water system using eco-friendly synthesized MOFs”, in Oriental Journal of Chemistry on April -2024 with ISSN:0970-020.(Scopus database, Q4, ESCI indexed)\nMs. Lekshmy O, Chemistry Lab Tutor published a paper entitled, “Chitosan-based Coating for Corrosion Protection of Copper”, in Futuristic Trends in Chemical, Material Science and NanoTechnology, Vol. 3, Book:1 (pp.251-256), Chapter-16 , 2024, ISBN : 978-93-5747-867-0, IIP series.\nPublished a paper on “ Development of hetero metal-organic frameworks of transition metal ions”, in Bulletin of Pure & Applied Sciences- Chemistry, 2018 Year : 2018, Volume : 37c, Issue : 1,  148 – 153, Article DOI : 10.5958/2320-320X.2018.00021.3\nPublished a paper on “ Effect of Method of Synthesis on the Development of MOFs of Transition Metal ions”, in Journal of  the Academy of Chemistry Teachers, Vol: 3(2), 2017, ISSN-2395-6801.\nPublished  a paper on “ Development of MOF based Corrosion Inhibitors”, on International Journal of Innovative Science and Research Technology, 2021          ISSN No:-2456-2165\nPublished a paper on “ Eco-friendly synthesis of Magnesium based MOF “, in Journal of Surface Science and Technology, 2021, volume 37, issue:3-4, Online ISSN: 0976-9420, Article DOI: https://doi.org/10.18311/jsst/2021/28590\nInternational Conference on Recent Advances in Materials Science, Proceedings, Year: 2020, Electrochemical Synthesis of Bimetallic MOFs, University of Kerala, Trivandrum.\nNeoteric Advances in Chemical Sciences(NACS 2021), Proceedings, ISBN : 978-93-5607-240-4, A Novel synthesis and corrosion study of Mg-MOF, University of Kerala, Trivandrum.\nInternational Seminar on Luminescence Materials, 2022, Proceedings, Synthesis and Photoluminescent studies of Eco-friendly modified Mg-MOF, University of Kerala, Trivandrum.\nNational Conference on Advanced Functional Materials (NCAFM-2023), Green Approach of Synthesizing Mg-MOF using flower extract of Clitoria Ternatea and its Corrosion Application, University of Kerala, Trivandrum.\nInternational Conference on Advance Materials and Technology (ICAMT-2024), Development of an electrochemical sensor based on Metal-Organic Framewok synthesized using green technology at NSS College, University of Kerala, Neeramankara.\nInternational Conference on Recent Advances in Material Science (ICRAMS-2024), Comparitive Study of Magnesium based Metal-Organic Framework Synthesized by Green Method for Electrochemical Detection of TNT at MG College, University of Kerala, Trivandrum.\nPublished a paper on “Iron Removal from Drinking Water System using Eco-friendly Synthesized MOFs” in Oriental Journal of Chemistry, Vol: 40, issue 2, April-2024.\nPublished a paper on “ Chitosan-Based Coating for Corrosion Protection of Copper”, in Futuristic Trends in Chemical, Material Science and Nano Technology, vol:3, book:1, chapter-16,2024,  ISBN : 978-93-5747-867-0, IIP series.\nNational Conference on Renewable Energy : Innovations, Challenges and Oppurtunities; NCREICO-2024, “Electrochemical Detection of Ascorbic Acid using Green Technology”, Mar Ivanios College, Trivandrum on November 15 -2024.\nNational Seminar on Neoteric Advances in Chemical Sciences (NACS) -2024, Proceedings,“Comparative Analysis of Mg-MOFs and Dexamethasone on Osteoblast Viability: A Promising Approach for Osteoporosis Prevention”, at the Department of Chemistry, University of Kerala, Karyavattom, Trivandrum on November 7 and 8, ISBN: 978-93-341-6346-9.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}