{
    "filename": "mbcet.ac.in_2019_03_29_all-kerala-college-alumni-forum-akcafin-uae_.html",
    "content": "MBCETAA Knights FC First Runner-up @ Kerala Campus League – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nMBCETAA Middle East had joined a new association named All Kerala College Alumni Forum (AKCAF)in UAE,last year, to improve our networking opportunities. It consists of alumni from around 75 colleges and is the only approved expats volunteer group in UAE. A college should have atleast 100 alumni in UAE to register in AKCAF. They conduct major events every year.\nOne such event was conducted on 29 March 2019 called Kerala Campus League, A football tournament of 24 colleges. MBCETAA had registered as one of the teams with the name MBCETAA Knights FC. With Jackson Nelson (Joint Secretary of MBCETAA ME) as the Team Manager, and Ranjeep as the Captain, a team was formed a 13 members squad of our alumni and a few guest players also, as permitted by the rules and regulation. It had a special format of 7 players playing matches of 10 to 15 mins.\nHowever, our team fought well and surprised everyone, when we won matches after matches, clearing the league rounds, Pre-Quarters, Quarters,Semi Finals and finally got into the finals..\nWe fought against a strong a team from Brennen College,Thalacherry. Although during the match our key striker, who had scored gold earlier, got injured ,we managed to finish the game at 0-0. Sadly,we lost to them in the penalty kickouts, but won the respect and admiration of AKCAF and its members. Being the first runners up of such an event is no ordinary feat. Not enough can be said about Jackson’s contribution as team manager, to this victory.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}