{
    "filename": "mbcet.ac.in_faculty_ms-ann-mary-alex_.html",
    "content": "Ms. Ann Mary Alex – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nMs. Ann Mary Alex\nEmployee Code / ID No.\n10411020\nQualifications\nM.Tech, PHd (pursuing)\nOrcid ID\n0000-0002-6640-9883\nIndustry / R & D Experience\nNil\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9446187216/135\nAreas of Interest / Current Research\nSemiconductor Device Modeling, VLSI and Embedded Systems\nResearch, Consultancy, Publication\nAnn Mary Alex\n, Jobymol Jacob, “Hot Carrier Effects on High Frequency Characteristics of SiGe HBTs”, International Journal of Electronics Letters, pp. 1-11. (Scopus indexed)\nAnn Mary Alex and Jobymol Jacob, “Interfacial Trap Effect on the DC and RF Characteristics of SiGe Heterojunction Bipolar Transistor,” 2021 International Conference on Communication, Control and Information Sciences (ICCISc), June 2021.\nHarikrishnan, Nandagopal and Ann Soni, Sneha and Mary Alex, Ann and Menon, Vishnupriya and C Nair, Vishnu, Virtual Interactive Reality Telepresence Robot (December 24, 2020). Proceedings of the International Conference on Systems, Energy & Environment (ICSEE) 2021\nDrishya Innocent, Jisha P. S. Kumar, Mahima Janardhanan, Shikha Rachel Mathew and Ann Mary Alex, “Automated Automobile Headlighting System” International Research Journal of Engineering and Technology (IRJET), Volume 6, Issue 5, May 2019.\nSuhail Yoosuf, Ann Mary Alex, “Audio Watermarking Using Colour Image Based On EMD and DCT”, International Journal of Advanced Research in Computer and Communication Engineering (IJARCCE), ISSN (Online): 2278-1021, ISSN (Print): 2319-5940, Vol. 4, Issue 6, June 2015.\nSuhail Yoosuf, Ann Mary Alex, ” Colour Image Watermarking for Audio signals based on DCT and DWT”, International Journal of Electronics and Communication Engineering Volume 2 issue 7- 2015.\nVimal, Jithu, and Ann Mary Alex. “Audio steganography using dual randomness LSB method.” 2014 International Conference on Control, Instrumentation, Communication and Computational Technologies (ICCICCT). IEEE, 2014.\nJithu Vimal, Ann Mary Alex, “Audio Steganography Using Modified LSB Method”, International Journal of Research in Advent Technology (IJRAT), Vol.2, No.5, May 2014\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNA\nAcademic / Professional Outreach Activities\nExternal Academic Auditor – KTU,NPTEL Reviewer\nMembership in Professional bodies/ organizations\nIEEE, IEEE SIGHT, ISTE Life Member\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nElite Gold certificate for the NPTEL course “Introduction to Research”\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}