{
    "filename": "mbcet.ac.in_alumni_get-involved_.html",
    "content": "Get Involved – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAlumni\n>\nGet Involved\nGet Involved\nRENDEZVOUS 2023\nRENDEZVOUS 2023 – MBCET Alumni Meet was held at Poojapura Ground, Thiruvananthapuram on 14th May 2023 at 5 pm. Around 100 members attended the Alumni Meet. The alumni meet was for all batches passed out from MBCET. It was a get together for them where they could meet their seniors and juniors. The event will also witnessed the honouring of 2008-2012 & 2009-2013 batches of MBCET. The Chief Guest was Ms. Simla Balasubramaniyan, 2009-13 EE.\nRENDEZVOUS 2019\nRendezvous 2019 – Alumni Meet was inaugurated by Moran Mor Baselios Cardinal Cleemis Major Archbishop-Catholicos on the evening of 18th December 2019. The meeting started with a prayer song. The occasion was graced by more than 18 Alumni and their family members in the batch 2005-2009 batch.\nSpeaking on the occasion, Moran Mor Baselios Cardinal Cleemis Major Archbishop-Catholicos underlined and praised the achievements of Alumni of MBCET in all walks of life. He felt that it was a matter of great pride for MBCET that its Alumni are holding positions of responsibility in various governmental organizations, PSUs, private sectors, academic and research institutions and various other esteemed organizations. Many of them are successful entrepreneurs providing jobs to others as well. He also emphasized the need for further strengthening the linkage between the alumni and the present students.The inaugural session was also attended by our  Bursar Rev. Fr. John Vilayail, Assistant Bursar Rev. Fr. Raju Parukoor, Principal Dr. T. M. George, Deans, HODs, faculties and staff members of MBCET.\nRENDEZVOUS 2017 – MBCET MEGA ALUMNI MEET on December 22\nnd\n, 2017\nThe MBCET Mega Alumni Meet was inaugurated by our former Bursar Rev. Fr. Wilson Thattaruthundill on the evening of 22\nnd\nDecember 2017. The meet started with a prayer song. The occasion was graced by more than 100 Alumni and their family members ranging across various batches from various parts of the world. The inaugural session was also attended by our new Bursar Rev. Fr. John Vilayail, Assistant Bursar Rev. Fr. Raju Parukoor, Principal Dr. T. M. George, Deans, HODs, faculties and staff members of MBCET.\nSpeaking on the occasion, Wilson achan underlined and praised the achievements of Alumni of MBCET in all walks of life. He felt that it was a matter of great pride for MBCET that its Alumni are holding positions of responsibility in various governmental organizations, PSUs, private sectors, academic and research institutions and various other esteemed organizations. Many of them are successful entrepreneurs providing jobs to others as well. He also emphasized the need for further strengthening the linkage between the alumni and the present students. The inaugural session was also attended by our new Bursar Fr. John Vilyail, Assistant Bursar Fr. Raju Parukoor, Principal Dr. T. M. George, Deans, HODs, faculties and staff members of MBCET.\nShibu Shajahan of 2003 – 2007 EC batch, the man behind the setting up of Middle East Chapter was also present. He explained the journey of the chapter over this one year with a short presentation. Scenes from the grand inauguration of the Middle East Chapter by Wilson achan and Dr. T. M. George at Dubai Marina on January 27\nth\n, 2017 in a luxury cruise ship, Alexandra Dhow Cruise. ‘MBCETAA Rocks On!!!’, an online event for our alumni which included a talent hunt and group selfie contest was a great hit and the winners were declared during Crossroads 2017. A potluck Iftar party was held in UAE on 16\nth\nJune, 2017 across 6 Middle East countries. After that the Oman chapter, Qatar chapter, Bahrain chapter and Saudi Arabia chapter was also established. The first Onam celebration of the Middle East Chapter was held on September 30\nth\n, 2017 at Nellara restaurant, Qusais, Dubai. He also put a video of Sajna Samad of the first batch of MBCET (2002 – 2006) EC batch and she wished all alumni a merry Christmas and prosperous new year ahead.\nEach alumnus of the second batch of MBCET (2003 – 2007) was presented with a memento on this occasion. Our Vice Principal, Prof. S. Viswanatha Rao delivered the vote of thanks to the alumni and their family members in the campus and appreciated their zeal to assemble here despite their busy life.\nAfter that the College Senate members presented a painting of Wilson achan to him. Then a memento was presented to him by the alumni who had gathered there. The highlight of the event was that the College Senate paid a tribute to our Wilson achan through a video made by them.\nThe video ‘A Salute to the Spirit of Baselios’ is available at the following link:\nhttps://www.youtube.com/watch?v=_yg9xQRNjGI&feature=youtu.be\nThe program also went live on Facebook and is available at the following link:\nhttps://www.facebook.com/sherry.george.796/videos/10214990919387337/\nCultural programmes by our students under Music Club, College Senate, faculty members and alumni of MBCET enhanced the serene atmosphere with pleasant music. Great bonhomie was observed everywhere with alumni reliving their old memories with their batch mates, seniors and juniors. Many of the current students were also seen interacting with their passed out seniors, imbibing values.\nThis was followed by a dinner arranged by the MBCET Alumni Association to all those who were assembled there. The get-together ended with the promise to meet again and everyone bid an emotional farewell to each other and their beloved alma-mater MBCET.\nAlumni Meet – Rendezvous 2016\nThe Mega alumni Meet, was inaugurated by our Bursar, Fr. Wilson Thattaruthundill on the evening of 23rd December 2016. The meet started traditionally by a prayer song by Ms. Suparna of EC department.\nThe occasion was graced by more than 80 Alumni and their family members ranging across various batches from various parts of the country and outside the country as well. Speaking on the occasion, our Principal Dr. T. M. George underlined and praised the achievements of Alumni of MBCET in all walks/spheres of life. He felt that it was a matter of great pride for MBCET that its Alumni are holding positions of responsibility in various Government organizations, PSUs, Private sector, Academic Institutions. Many of them are successful entrepreneurs providing jobs to others as well. He also emphasized the need for further strengthening the linkage between the Alumni and current students. The inaugural session was also attended by various Deans, Registrar, HODs, faculties and staff members of MBCET.\nThe Vice Principal, Prof. S. Viswanatha Rao welcomed the alumni and their family members in the campus and appreciated their zeal to assemble here despite their busy life.\nThe Inaugural session was followed by cultural programmes by our students under Music club, faculties and alumni of MBCET who mixed the serene atmosphere with a pleasant music. Great bonhomie was observed everywhere with old students reliving their old memories with their batch mates, seniors and juniors. Many of the current students were also seen interacting with their passed out seniors and learning from their experiences. In all, the ambience was electric with people seen chatting and dancing in groups. For the first time, a video conference was arranged where by alumni in the Middle East were able to attend the event online.\nThe key highlight was the song from Poomaram-“Njanum Njanum ente aalum” sung together by our beloved Principal, Bursar and current faculty team of MBCET. The first batch of MBCET was presented with a memento on this occasion.\nThis was followed by a dinner arranged by the management to all those who assembled there. The Meet ended with promise to meet again and everyone bid emotional farewell to each other and their beloved MBCET.\nAbout us\nMBCETAA Contributions\nExecutive Committee\nMBCETAA-Middle East Chapter\nMBCETAA - North America Chapter\nDistinguished Alumni\nGet Involved\nMBCETAA Awards\nYouth Excellence Award\nStay in Touch\nContact Us\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}