{
    "filename": "mbcet.ac.in_faculty_ms-luxy-mathews_.html",
    "content": "Dr. Luxy Mathews – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nDr. Luxy Mathews\nEmployee Code / ID No.\n10403004\nQualifications\nMTech.,Ph.D\nOrcid ID\nhttps://orcid.org/0000-0003-2437-3509\nIndustry / R & D Experience\nNil\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n04712545868 – 111\nAreas of Interest / Current Research\nWireless communication/4 G\nResearch, Consultancy, Publication\n• Luxy Mathews, Sakuntala S.Pillai,N Vijayakumar, Performance Of Mimo-fbmc System With Adaptive Filter,International Journal of Advanced Research in Engineering and Technology (IJARET),Volume 11, Issue 7, July 2020.(Scopus Indexed)\n• Luxy Mathews, Sakuntala S.Pillai, ”Performance of turbo coded FBMC based MIMO systems”, IEEE International Conference on Computational Intelligence and Computing Research(ICCIC), December 15 -17,2016,Chennai\n• Luxy Mathews, Sakuntala S. Pillai, N. Vijayakumar, “Performance of MIMO-FBMC System with Adaptive Filter”, International Journal of Recent Technology and Engineering (IJRTE), ISSN: 2277-3878 (Online), Volume-8, Issue-5, pp. 3238-3243, January 2020.\n• Kalyani J., Luxy Mathews, “Survey on channel estimation techniques for mm wave massive MIMO with hybrid precoding” in IOSR Journal of Engineering (IOSRJEN), 2019.\n• Luxy Mathews,SakuntalaS.Pillai,”Performance of turbo coded FBMC based MIMO systems”,IEEE International Conference on Computational Intelligence and Computing Research(ICCIC), December 15 -17,2016,Chennai.\n• Princy P.Jayan, Luxy Mathews, Sakuntala S. Pillai, “Scheduling for Video Transmission in LTE Downlink”, International Organization of Scientific Research Journal of Electronics and Communication Engineering (IOSR-JECE), ISSN: 2278-2834, Vol. 11, Issue 4, Ver. 4, Jul-Aug 2016\n• Neetha Mariam Jacob, Luxy Mathews, and Sakuntala S. Pillai,“Transmit Precoding with Encoding using Zadoff-Chu Sequence for MIMO-OFDM System” , IEEE International Conference on Communication Systems and Networks (ComNet), July 2016.\n• Varna L. Babu, Luxy Mathews, Sakuntala S. Pillai, “A Channel Independent Precoding with different Equalization Techniques in a MIMO based system”,International Conference on Innovative Trends in Engineering Science and Management,Feb 26 – 27,2016\n• Sherry Varghese George, Luxy Mathews, and Sakuntala S. Pillai, “Heterogeneous User Mobility based Scheduling Scheme and Transmission Mode Selection in Downlink LTE/LTE-A Systems”, 2nd IEEE International Conference on Control, Instrumentation, Communication and Computational Technologies (ICCICCT), pp. 78-83, December 2015.\n• Sherry Varghese George, Luxy Mathews, and Sakuntala S. Pillai, “Performance Analysis of Transmission Modes in 4G LTE/LTE-A Downlink Systems”, 2nd IEEE International Conference on Control, Instrumentation, Communication and Computational Technologies (ICCICCT), pp. 219-224, December 2015.\n• Sherry Varghese George, Luxy Mathews, Sakuntala S. Pillai, “A New Approach for the Modeling of LTE/LTE-A Downlink/Uplink Systems based on LTE System Toolbox”, International Journal of Research in Electronics and Computer Engineering (IJRECE), ISSN: 2393-9028 (print), ISSN: 2348-2281 (Online), Vol. 3, Issue 3, pp. 48-51, July 2015.\n• Varna L. Babu, Luxy Mathews, Sakuntala S. Pillai, “Performance Analysis of Linear and Nonlinear Precoding in MIMO Systems”, International Journal of Advanced Research in Computer and Communication Engineering (IJARCCE), ISSN (Online: 2278-1021, ISSN (Print): 2319-5940, Vol.4, Issue 6, June 2015.\n• Varna L. Babu, Luxy Mathews, Sakuntala S. Pillai, “A Codebook Selection based Precoding in LTE Systems”, International Journal of Research in Electronics and Computer Engineering (IJRECE), ISSN: 2393-9028 (print), ISSN: 2348-2281 (Online), Vol. 3, Issue 3, July 2015.\n• Sherry Varghese George, Luxy Mathews, Sakuntala S. Pillai, “Physical Layer Frame Structure in 4G LTE/LTE-A Downlink based on LTE System Toolbox”, International Organization of Scientific Research Journal of Electronics and Communication Engineering (IOSR-JECE), ISSN: 2278-2834, Vol. 10, Issue 3, Ver. 4, pp. 12-16, June 2015\n• Jobin Varghese and Luxy Mathews,” Low Power Area Optimized Novel Architecture for Software Defined Radio in FPGA”, IEEE International Conference on Advanced Communication Control and Computing Technologies (ICACCCT)May 8-10 2014\n• Luxy Mathews and Sakuntala S. Pillai, “Performance of Pre-coded Spatially Multiplexed MIMO-OFDM system”International Conference on Mobility in Computing (ICMiC13), December 17-18, 2013, Trivandrum.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNil\nAcademic / Professional Outreach Activities\n–\nMembership in Professional bodies/ organizations\nLife member ISTE\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\n–\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}