{
    "filename": "mbcet.ac.in_faculty_revathy-k-p_.html",
    "content": "Ms. Revathy K P – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs. Revathy K P\nEmployee Code / ID No.\n10322058\nQualifications\nM.Tech (Signal Processing), (Pursing Ph.D)\nOrcid ID\n—-\nIndustry / R & D Experience\n2.5 year experience in teaching\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n7356181750/403\nAreas of Interest / Current Research\nPower Electronics, Signal Processing, Electric vehicle ,Electronic Communication\nResearch,  Consultancy, Publication\nRevathy K P, Dr.Vijayakumar, “Powering the Future: A Comprehensive Review on DC-DC Converters and Their Vital Role in Electric Vehicle Technology” https://link.springer.com/book/10.1007/978-3-031-61475-0\nRevathy K P,Anila AV –An analysis on various charging methods of EV vehicle on International journal for research in applied science and technology volume 10 issue ix, https://doi.org/10.22214/ijraset.2022.46878\nRevathy K P, Suma sekhar, Dr. Sakuntala S. Pillai, Carrier frequency offset estimation in OFDM system using ML CRITERION precoded by turbo codes, IEEE intelligent computing Instrumentation and control technologies, ICICICT.\nRevathy K P, Suma sekhar, Dr. Sakuntala S. Pillai, Evaluation on frequency offset estimation methods in OFDM systems, NPCCC’17.\nRevathy K P, Suma sekhar, Dr. Sakuntala S. Pillai, Assessment of various PAPR reduction Techniques in OFDM, NACTET’17.\nRevathy K P, Suma sekhar, Dr. Sakuntala S. Pillai, Assessment of various residual carrier frequency offset estiamtion methods in OFDM system, ICCEE’17.\nRevathy K P, Suma sekhar, Dr. Sakuntala S. Pillai, Review on precoding techniques in OFDM, NACTAE’17.\nRevathy K P, Suma sekhar, Dr. Sakuntala S. Pillai, Frequency offset estimation in OFDM system with precoded turbo codes and almounti codes, ASPIRE’17.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nNBA Criteria 1 Coordinator\nNAAC Criteria 7 Sub  Coordinator\nFaculty in-charge and NSS Programmme officer at Heera College of Engineering and Technology\nKTU NSS Energy cell district coordinator\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\nNation Service Scheme (NSS) Coordinator\nIllumina and NSS activities\nAwards / Distinctions / Rank / Other Achievements if any\nB.E first class with Distinction(College first rank holder)\nSelected as Best participant among 230 participants at National event organized by department of EEE, Manipal Institute of Technology in association with Mathworks\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}