{
    "filename": "mbcet.ac.in_departments_electronics-communication-engineering_research_.html",
    "content": "Research and Consultancy – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nDepartments\n>\nElectronics & Communication Engineering\n>\nResearch and Consultancy\nPh. D\nPh. D\nDr. Jayakumari J.\nis guiding the following students in their doctoral research work under the APJ Abdul Kalam Technological University in the area of Wireless Communication and Signal Processing:\n1. Ms. Revathy Sivanandan\n(Completed)\nThesis title:  “Development of novel CNN for efficient tumour diagnosis from breast ultrasound images” (\n07 November 2023\n)\n2. Ms. Syama Sasikumar (CERD Fellowship)\n(Completed)\nThesis title:    “Efficient Resource Allocation for Carrier Aggregation based Cognitive Radio Networks” (\n31/01/2024\n)\n3. Ms. Parvathy Prathap\nTopic: Light Field Imaging and its Processing\n4. Ms. J.L. Lakshmi\nTopic: Efficient VLSI Implementation of Channel codes for 5G NR\n5. Mr. Shiras S.N.\nTopic: Performance enhancement in Intelligent reflecting surface aided millimetre wave networks\n6. Mr. Sherry Varghese George\nTopic: Optimal Resource Allocation for 5G NR V2X Communication\n7. Alin Mariam Solomon\nTopic: Spectrum sensing and resource allocation for cognitive based 6G networks\nThe following staff members are pursuing Ph. D\n:\nMs. Deepa P. L.\nMr. Niyas K. Haneefa\nMs. Ann Mary Alex\nMs. P.P. Hema\nMr. Jithin M. George\nMr. Shiras S.N.\nMr. Sherry Varghese George\nMr. Arun J.S.\nMs. Teena Rajan\nMs. Remya Annie Eapen\nMoUs initiated\nSummary of Active MoUs\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nMoU SIGNING BETWEEN MBCET & INTERNATIONAL IoT COMMUNICATION TECHNOLOGIES PVT. LTD\nMBCET has signed an MoU with International IoT Communication Technologies (IICT) Pvt. Ltd on 26th May 2025. IICT – International IoT Communication Technologies GmbH, is a deep-tech spin-off company founded from the ivESK Research Institute, Germany. They specialize in developing systematic educational testbeds and hands on training labs that empower learners and professionals to build real-world skills in AIoT (Artificial Intelligence of Things), Embedded AI , IoT Communication Technologies , Next-Generation Wireless Networks (5G, 6G, LPWAN) , Industrial IoT and Automation , IoT/5G Security and Embedded Edge etc. IICT presents a Lab as a Service (LaaS) model for MBCET, which can be later used for delivering advanced training in AIoT(Artificial Intelligence of Things), Embedded AI, and future communication networks such as 5G, IoT, LPWAN technologies and its usecase development through structured hybrid training labs.\nForeign Research Collaboration\nForeign Research Collaboration with UNIVERSITI TEKNOLOGI MALAYSIA\nTitle of the project\n: Intelligent Reflecting Surface Assisted Millimetre Wave Communication for 6G.\nTeam members from Universiti Teknologi Malaysia: Professor Ir. Dr. Sharul Kamal Abdul Rahim, Dr. Bruce Leow Chee Yen, Prof. Dr.Jafri Din, Siti Fatimah Ausordin.\nTeam members from MBCET: Dr, Jayakumari J.(Prof. and HoD), Dr. Sreedevi P. (Asso. Prof.), Ms. Teena Rajan, Mr. Shiras S.N. (Asst. Professors)\nDuration of the project: 2 years\nFunded Projects\n2025\nTitle: EYE GAZE CONTROLLED  STANDING WHEELCHAIR\nPI: Ms. Amritha B J  Co-PI :Dr. M J Jayashree\nType of funding: CERD KTU Funding (Student Project)\nDuration: One year\nAmount: Rs.20,100/-\n2024\nTitle: AI Enhanced Customizable 5-DoF Robotic Arm for Optimizing Warehouse Operations\nPI: Mr. Shiras SN\nType of funding: CERD KTU Funding (Student Project)\nDuration: One year\nAmount: Rs.32,500\nTitle: Realization of Quadrupled Robot for Interplanetary Mission and Logistics Operations\nPI: Dr. Vineetha Mathai\nType of funding: CERD KTU Funding (Student Project)\nDuration: One year\nAmount: Rs.27,500\n2023\nDevelopment of Transit signal priority module with integrated AI assistant\nPI: Dr. Jayakumari J.\nType of funding: CERD KTU Funding (Student Project)\nDuration: One year\nAmout: Rs.25,500\nElectric Wheelchair with Sip and Puff Technology, for quadriplegic/ALS patients\nPI: Ms. Amrita B.J\nType of funding: CERD KTU Funding (Student Project)\nDuration: One year\nAmout: Rs.29,000\n2022\nDevelopment of IOT based energy autonomous parking sensor device\nPI: Dr. Jayakumari J. (PI)\nCo-PI: Mr. Sherry Varghese George (Co-PI)\nType of funding: CERD KTU funding (Student project)\nDuration: One year\nFunding: 15,000 INR\nGesture controlled stair climbing wheelchair\nPI: Dr. M.J. Jayashree\nCo-PI: Ms. Amritha B.J.\nType of funding: CERD KTU funding (Student project)\nDuration: One year\nFunding: 26,000 INR\nROS based autonomous hospital assistant robot\nPI: Mr. Arun J.S.\nType of funding: CERD KTU funding (Student project)\nDuration: One year\nFunding: 26,000 INR\n2021\nTitle: Speech therapy system for cleft lip/Palate patients\nPI: Ms. Lani Rachel Mathew, Assistant Professor\nCo-PI: Ms. Amritha B.J., Assistant Professor\nStudents:  Deepthi G.A., Aneeta Sabu, Sowmiya V.  and V. S. Devika\nType of funding: CERD KTU (Student Project)\nDate of start: 01 June 2021\nDuration: 1 year (Ongoing)\nProject funding: 11,000 INR\nTitle: Voice actuated backrest for paralysis palliation\nPI: Mr. Arun J.S., Assistant Professor\nStudents: Anjana Santhosh, Arun Y., Meenakshy Sunil\nType of funding: CERD KTU (Student Project) approved in 2021\nDate of start: 01 November 2021\nDuration: 9 months\nProject funding: 9,000 INR\nTitle: Portable brain computer interface for medical applications\nPI: Dr. Jayakumari J., Professor and HoD\nCo-PI: Dr. M.J. Jayashree, Professor\nStudents: Daniel C., Rohit Satheeshan, Sandra Jeeva, Shamil Shamsudheen\nType of funding: CERD\nStatus: Completed\nIn-house Projects\nIn-house Projects\n5 DOF 3D Printed Robotic Arm\nPI: Mr. Jijo Jose\nDuration: One year\nAmout: Rs.1,33,000\nStudy and development of face recognition system for automated classroom attendance.\nPI: Ms. Athira V., Co-PI: Ms. Riya John\nBrain tumor detection from MRI images using Deep Learning.\nPI: Ms. Deepa P. L.\nImplementation of Optical OFDM\nPI: Ms. Swapna P. S.\nImplementation of Wireless Communication System on FPGA\nPI: Mr. Shiras S. N., Co-PI: Ms. Ancy Joy\nStudy on Textile Sensors\nPI: Ms. Teena Rajan, Co-PI: Mr. Priyadarsan U. S.\n“Analysis of Voice signals using Throat Microphone” – This project aims at investigating the use of a throat microphone for analyzing voice. For persons with disability in speech, this analysis will be helpful in the designing of suitable voice reconstruction algorithms.\nPI: Ms. Lani Rachel Mathew\n“Autonomous Region Explore and Surveyor (A.R.E.S)” – This project proposing a drone which can map an area autonomously.\nPI: Mr. Arun P. S., Co-PI:  Ms. Lakshmy S.\nStudy of Energy Harvesting for Wireless Sensors\nPI: Prof. S. Viswanatha Rao, Co-PI: Ms. Remya Annie Eapen\nIndustry - Institute Collaboration Initiatives\nIntel Unnati AI Lab Inauguration:\nRajeev Chandrasekhar,  Hon’ble  Minister of State for Electronics and Information Technology, Skill Development and Entrepreneur­ ship, Govt. of  India  inaugurated  the  Intel® Unnati AI IoT Lab on 13 June 2023 in the presence of H.B Moran Mor Baselios Cardinal Cleemis Catholicos, the Major Archbishop  of Trivandrum and the Patron of the College. Fr.  John Varghese, Bursar gave the welcome address. H.B Moran Mor Baselios Cardinal Cleemis Catholicos gave the presidential address. Shri. Rajeev Chandrasekhar as part of his ‘New India for Young India ‘ lecture series, spoke of how New India offers great opportunities for Youth. He emphasized the importance of skill development Technology and skills are the pillars to transform India. Mr. Sumeet Verma, Director, Strategy, Intel India Coorporation gave the felicitatory address. Dr. Abraham T Mathew, Principal, proposed the vote of thanks. Faculty Coordinators: Dr. Swapna P. S, Assoc. Professor and Mr. Jijo Jose, Asst. Professors, ECED.\nThe prototype of the project titled “Accessible Plug for Visually impaired” was demonstrated at NISH on 1\nst\nJune 2023. Student members: Ms. Abhirami J. Pradeep, Ms. Shilpa S. P. and Mr. Sreedev P.S (S8EC2).\nA project team from S8 EC comprising\nAbhinav A. Pillai, Aravind U.R. and Varun George\nwas selected to exhibit their project “Electric wheelchair using Sip and Puff Technology”, as part of the “ente Keralam” event organized by the Government of Kerala, at Kanakakunnu on 20th May 2023.  The project was guided by\nAmritha B J\n, Asst. Professor, Department of EC.\nI-YwD (Innovation by Youth with Disabilities) Cohort 3 Selection Camp venue at MBCET\nMBCET hosted the I-YwD team for the online I-YwD (Innovation by Youth with Disabilities) Cohort 3 Selection Camp on 12th and 13th of May 2023. The sessions included orientation, online activities and discussions in breakout rooms for young entrepreneurs with disabilities. Indian Sign Language (ISL) interpreter,\nMs. Bhavana U B\n, helped the team to communicate in real time with persons having hearing impairment. Project coordinators, Ms. Daisy Sebastian, Ms. Sari P Vishwanath, Ms. Anjali Gopan and Mr. Avaneesh M and interns, Ms. Archa Krishnan S and Ms.Jisha M, were involved in conducting the various sessions. Prof. Raju K. Gopal and Mr. Jith from the ITMS team ensured smooth conduct of the online sessions that were held in Faraday Hall. Faculty coordinator:\nDr. Lani Rachel Mathew\n, Asst. Professor (ECE).\nMoU Signed\nA MoU was signed between the Metro Scans and MBCET on 6\nth\nApril 2023, to provide medical radiological images for support study of graduates, post graduates and doctorate study of bio-medical engineering students.\nLani Rachel Mathew\n, Asst. Professor, ECED, was part of the delegation from APJAKTU to Tata Consultancy Services (TCS), Trivandrum, on 15th February 2023, to discuss possibilities of promotion of assistive technology related activities in the engineering community.\nMoU Signed with SCTIMST\nMBCET signed an MoU with TIMed of Sree Chithra Institute of Medical Science and Technology on 9th January 2023, in the presence of Mr. Balram S., Scientist G, Founder CEO of SCTIMST-TIMed and HoD of Department of Technology and Quality Management, and  Mr. Sarath S. Nair, Scientist/Engineer F, Department of Medical Devices Engineering, SCTIMST. The MoU will pave the way for enabling students interested in biomedical-based engineering startups and medical device development.\nKELTRON Visit\nA team of six people from Keltron visited the IEDC and 3D printing facilities provided by the college on 25th November 2022. The team members are Mr. Hemachandran, Executive Director, Mr. Vijeesh V, Deputy Manager and Division Head, Traffic Signals Division, Mr. Srijith C S, Senior Executive and Head QA, Mr. Anoop G S, Engineer, Head Production Mr. Bijoy S, Engineer, Head Testing, Ms.Revathy Sivanandan, Engineer, Engineering and Student Projects. Dr. Abraham T Mathew, Principal, Dr. S Viswanatha Rao, Vice principal, Head of various department and faculty coordinators were present during the visit.\nMBCET Team Visited Intel Unnati lab, Crescent University, Chennai\nA team of faculty members and technical staff from the\nDepartment of Electronics and Communication Engineering\nvisited the Intel Unnati Lab at the B.S.Abdur Rahman Crescent Institute of Science & Technology, Chennai as part of the establishment of the Intel Unnati AI IoT Lab on our campus. The team included\nMr.\nAnoop K Johnson\n, Assistant Professor, ECED,\nMr. Jijo Jose\n, Assistant Professor, ECED,\nMr. Ajith Kumar SM\n, Lab Instructor, ECED.  The Crescent Innovation and Incubation Council (CIIC) team along with Mr. Ramaiah Chidambaram, Head of Industry 4.0 & IT, interacted with the team and offered all support in establishing an Intel Unnati AI IoT Lab on our campus.\nLab Visit\nMs. Teena Rajan and Dr. Lani Rachel Mathew,\nAsst. Professors, Dept. of ECED visited the SCTIMST Biomedical Technology Wing at Poojapura, Trivandrum on 16th November 2022, in order to discuss product development related to biomedical devices.\nMoU signed with INTEL and AUK Computing\nThe Mar Baselios College of Engineering and Technology has signed a MoU with Intel and AUK Computing to set up the Intel Unnati AI IoT Lab on November 1st, 2022. Mr. Ashok R and Mr. Arun Shankar, directors of AUK Computing, Fr. John Varghese, Bursar, Dr. Abraham T. Mathew, Principal, Dr. Viswanatha Rao, Vice Principal, Mr. Sanju Mathew, CEO, Code of Duty Innovation s, Heads of various departments, Deans and faculty members were present during the MoU signing ceremony.\nThe Department has been striving continuously to establish linkages with industry. Experts from industry are invited for giving talks on recent advances in technology. Students are allowed to undertake project works out sourced from industry and seek guidance from well established R&D departments for in-house project developments. Industry experts are also actively involved during various technical activities related to organizing conferences, workshops etc.\nMoU Signed with CDAC\nAn MoU has been signed by Mar Baselios College of Engineering and Technology with\nCentre for Development of Advanced Computing\n, Trivandrum,  to associate in the studies and research in the subject areas of Cyber Security and Forensics, Cyber Law, Software Technologies, Cloud Computing, GIS Technology, 5G Networks, Power Electronics, Control Systems and Instrumentation, VEGA Processor based Microcontrollers and System-on-Chips and in the efforts of Collaborative Teaching, Research and Development. The cooperation will be in the form of expert lectures,collaborating in R & D projects, joint programs, students projects, industrial training, pre-placement training, faculty exchange etc.  A team from CDAC consisting of Mr. Krishnakumar Rao S., Mr. Libin T T, Mr. Deepu Krishnan and Ms. Neeta Maria Celin from Hardware Design Group, visited MBCET .  Fr. John Varghese, Bursar, Dr. Abraham T. Mathew, Principal, Dr. Viswanatha Rao, Vice Principal, Heads of various departments, Deans and faculty members were present during the MoU signing.\nIIST Lab Visit\nA team of faculty members from the department of ECE, visited the labs at IIST on 23 June 2022, as an initial step towards improving the research facilities in the department\nMoU Signed\nAn MoU was signed between\nMaven Silicon\n(VLSI training institute) and\nMBCET,\non 07 April 2022.\nMoU Renewed\nThe MoU between\nMBCET\nand\nBSNL\nwas renewed on 19 May 2022, opening up avenues for our students to explore the field of telecommunication networks.\nMBCET\nhas renewed the MoU with\nNational Institute of Speech and Hearing, Akkulam, Thiruvananthapuram,\non 09 March 2022\nMoU Signed\nMoU was signed between\nVinvish Technologies Pvt. Ltd.\n, Technopark and Mar Baselios College of Engineering and Technology (Autonomous) on 30 September 2021. The company is a DSIR (Govt. of India) approved R&D centre with a solid R&D foundation in niche areas of Optoelectronics. A full-fledged design and engineering team with expertise in optics, electronics, embedded firmware, and mechanical is in place.\nAT Projects discussion with NISH\nAn online discussion with experts from National Institute of Speech and Hearing (NISH), on the ongoing Assistive Technology (AT) projects in the college, was held on 30 April 2021.\nProf (Dr.) K. G. Satheesh Kumar\n, Director, Centre for Assistive Technology and Innovation (CATI), NISH and\nDr. Akila S.\n, Senior Engineer (CATI) gave suggestions for improvement and appreciated the progress in the projects. Ten projects from across the college were presented before a virtual audience of more than 60 participants.\nStaff Coordinator:\nMs. Jisha Jose\n(Asst. Professor, Dept. of Computer Science Engineering)\nProject at NISH\nA team of 8 students  (\nAparna Sreekumar\nand\nVaishnavy Menon\n(S6 CS2) ,\nVaibhav K.\nand\nVishnu P. Kumar\n(S6 EC2) ,\nArya P.K.\nand\nDevika M.M.\n(S6 EE2),\nPratyush Moni S.\nand\nSidharth Nair\n(S6 ME2) ) from MBCET under the mentorship of\nMr. Amith G. Nair\n, Hardware Engineer at NISH, started off with the project work on implementing an alert device for the hearing impaired, to be used inside the library and that can be controlled using a phone.\nVisit to NISH\nFaculty representatives from the Assistive Technology group at MBCET (\nDr. M.J. Jayashree\n,\nMr. Aswin  R.B. , Ms. P.P. Hema, Mr. Jijo Jose and Ms. Amritha B.J.)\nvisited the National Institute of Speech and Hearing (NISH) on  25 March 2021, to discuss the projects related to Assistive Technology that can be implemented in collaboration with NISH. It was decided to select 7 students from across the various departments in the college to start working on their projects.\nMoU Signed\nAn MoU was signed between\nBSNL Regional Telecom Training Centre\n(RTTC) and Mar Baselios College of Engineering and Technology (Autonomous) on 15 March 2021. This will help our students for attending training, internships, projects etc.\nDr. Sreedevi P.\nand\nMr. Shiras S.N.\npaid a visit to\nVinvish Technologies Pvt. Ltd.\nin Technopark as part of the Industry-Institute Collaboration. The company is a DSIR (Govt. of India) approved R&D centre with a solid R&D foundation in niche areas of Optoelectronics. A full-fledged design and engineering team with expertise in optics, electronics, embedded firmware, and mechanical is in place. On the 24th of March 2021, a meeting with Vinvish Technologies and the faculty of the ECE Department was scheduled. Vinvish Technologies was represented by Mr. Pius Varghese, Chief Operating Officer, Mr.Ignatius, and Mr.Jijo. The meeting concluded on a high note\nNATIONAL INSTITUTE OF SPEECH AND HEARING (NISH)\nConnected Announcement System for Hearing Impaired (CASHI) developed for deaf students in National Institute of Speech & Hearing (NISH) has been installed successfully in one of their classrooms on 25 January 2019.\nStudents members: Pranav Peter (S6 EC1), Joel Raju (S6 EC1)\nGuided by: Ms. P. P. Hema, Ms. Lani Rachel Mathew and Mr. Anil Kumar\nThe project titled “Vocal Tract Resonance Measurement” was sanctioned by NISH. The project was demonstrated at NISH on 12 May 2017.\nStudent members: Nilu Anna George, Rohit S., SelvaGanama, Vamsee Krishnan S.\nGuided by: Ms. Lani Rachel Mathew\nThe project titled “Fundamental Frequency Estimation using Praat” was sanctioned by NISH. The project was demonstrated at NISH on 18 September 2017.\nStudent members: Krishnendu Lalaji, Pooja G. S., Rahul Krishnan K. S.\nGuided by: Ms. Lani Rachel Mathew\nHLL LIFECARE LIMITED (A GOVT. OF INDIA ENTERPRISE)\nThe project “Wireless System for Water Level Monitoring in Overhead Tank” was sanctioned by HLL Lifecare, Trivandrum.\nStudent members: Abhinand S., Naveen S., Joji John Varghese\nGuided by: Ms. Lani Rachel Mathew, Ms. Teena Rajan\nCENTRE FOR DISABILITY STUDIES (CeDS)\nCentre for Disability Studies, Poojapura, Trivandrum sanctioned the project titled “Interface for Hearing Impaired and Talking Disability with Normal People”.\nStudent members: Abhishek V., Don Jose, Aiswarya S., Aneeta Regi\nGuided by: Ms. Deepa P. L.\nCentre for Disability Studies, Poojapura, Trivandrum, sanctioned an amount of Rs. 44,000/- for the research project titled “Visual Interface System for the Disabled (VSID)”.\nStudent members: Vineeth G. K., Geethu S., Nagma Rani, Zabin P. C.\nGuided by: Ms. Remya Annie Eapen\nCentre for Disability Studies, Poojapura, Trivandrum sanctioned the project titled “Kazcha: Text to Speech Convertor”.\nStudent members: Darrel Daniel, Libya Thomas, Anjumol Antony, Aparna K. S.\nGuided by: Mr. Shiras S. N.\nINDIAN SPACE RESEARCH ORGANIZATION (ISRO)\nA research project titled ‘Study and Implementation of Advanced Low bit rate Audio Encoding and Decoding algorithms’ was approved by ISRO under the RESPOND project scheme during the period 1st Feb 2013 to Oct 31st 2015. The total funding for the project was Rs 13.02 lakhs.\nPI: Dr. Sakuntala S. Pillai, Co-PI: Ms. Ancy S. Anselam\nResearch Groups\n1. Communication group\n2. Signal Processing group\n3. Biomedical group\n4. Embedded systems group\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}