{
    "filename": "mbcet.ac.in_faculty_mr-h-aravind-sarma_.html",
    "content": "Mr.H Aravind Sarma – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nMr.H Aravind Sarma\nQualification\nM- Tech\nemail ID\n[email protected]\nRoom No. | Extension No.\nB 100\nArea of Interest\nCommunication, Deep Learning, Machine Learning\nPublications\nH Aravind Sarma, Sherry Varghese George, “Channel Estimation in V2V Communication”,  International Conference on  Emerging Technologies for Intelligent Systems (ETIS), Feb 7-9 2025,  DOI: 10.1109/ETIS64005.2025.\n10961228\nH Aravind Sarma, Jijo Jose,” Real Time Fall Detection Model with Action Recognition”, Global Conference on Information Technologies and Communications (GCITC), December 1, 2023.\nH Aravind Sarma, Jijo Jose, “Deep Learning Based Real Time Fall Detection Model”, 3\nrd\nInternational Conference on Emerging Techniques in Computational Intelligence, September 21 2023, ISBN:979-8-3503-0061-1, DOI: 10.1109/ICETCI58599.2023.10331387.\nAditya Raj, Abhishek Anil, H Aravind Sarma, R Naveen Chandran, Deepa P. L., BrainNET: A Deep Learning Network for Brain Tumor Detection and Classification” Advances in Communication Systems and Networks, Lecture notes in Electrical Engineering Vol. 656, pp. 577-589, June 2020.\nAditya Raj, Abhishek Anil, H Aravind Sarma, R Naveen Chandran, Deepa P. L., “Brain Tumor detection from brain MRI using Deep Learning”, International Conference of Recent Engineering Trends and Technology Journal of Engineering and Advanced Technology, December 2019.\nDetails of Faculty as resource person\n—\nAchievements of faculty (Like Gate/Net Qualification or any other achievement)\n—\nWorkshops, conferences, seminars (ORGANIZED)\n—\nWorkshops, conferences, seminars(ATTENDED)\n1. Attended  workshop on Ansys for High Frequency Electromagnetics at MBCET\n2. Attended workshop on IoT at MBCET\n3. Attended workshop on Ethical Hacking at MBCET\n4. Attended workshop on Android Controlled Robotics & IOT at NIT Calicut\n5. Attended workshop on Artifical Intelligence at Intel Unnati LAb, MBCET\nProfessional body Membership\n—\nDate of joining @MBCET\n9-4-2023\nDetails of previous work Experience:Industry / Academics / Others\n1.Worked as Guest Lecturer in Central Polytechnic College, Vattiyoorkavu.\n2. Worked as Firmware Engineer at Vinvish Technologies, Technopark Trivandrum.\nAwards\nFirst Rank for B.tech ECE at MBT[ 2015- 2019]\nFirst Rank for M.tech TCE [ 2021-2023]\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}