{
    "filename": "mbcet.ac.in_mar-ivanios-vidya-nagar_.html",
    "content": "Mar Ivanios Vidya Nagar – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nMar Ivanios Vidya Nagar\nMar Ivanios Vidya Nagar is one of the most beautiful hillocks in the city of Thiruvanathapuram with an extent of about 130 acres of land, housing a lot of educational and other institutions under the patronage of the Major Archdiocese of Trivandrum. This educational campus emerged out of the educational vision of the Syro-Malankara Catholic Church in the State of Kerala. The sprawling campus, blessed with natural beauty and learning ambiance, is studded with 18 centers of excellence in education.\nThe campus has been named ‘Mar Ivanios Vidya Nagar’ as a tribute to Archbishop Mar Ivanios, the founder of Mar Ivanios College\nThe campus has been named ‘Mar Ivanios Vidya Nagar’ as a tribute to Archbishop Mar Ivanios, the founder of Mar Ivanios College, the first educational institution in the campus. This prestigious college, founded in 1949, in its 64 years of vibrant existence and service has made profound contributions towards the field of higher education in the state, true to the vision of its founder Archbishop Mar Ivanios and true to the motto of the college “ Veritas Vos Liberabit” ‘Truth Shall Liberate You’.\nInstitutions\nMar Ivanios College\nThis prestigious college, founded in 1949, in its 64 years of vibrant existence and service has made profound contributions towards the field of higher education in the state, true to the vision of its founder Archbishop Mar Ivanios and true to the motto of the college “ Veritas Vos Liberabit” ‘Truth Shall Liberate You’.\nView Website\nMar Baselios College of Engineering & Technology\nMAR BASELIOS COLLEGE OF ENGINEERING AND TECHNOLOGY (MBCET) inspires the aspirations of generations of knowledge-seekers. Dedicated to mould morally upright, socially committed and intellectually trained Engineers, the College strives to realize its dreams.\nView Website\nB'Hub\nView Website\nBethany college of physiotherapy\nView Website\nMar Gregorios College of Law\nView Website\nMar Theophilus Training college\nView Website\nSarvodaya Central Vidyalaya\nView Website\nMar Gregorios Renewal Center\nSarvodaya Vidyalaya\nView Website\nSt John’s Model Higher Secondary School\nSt Marys Malankara Major Seminary\nJayaMatha Boys Home\nSt Alphonsa Hostel\nMary Matha Hostel\nSt Thomas Hostel\nMar Aprem Hostel\nHighlights\nStands among the top tier Engineering College in Kerala\nTraining and Placement Unit for Placement support and Soft Skill Training.\nDue importance to Arts & Sports. First runner-up in Kerala University Youth Festival competitions in 2017.\nMOU with National, International Institution/MNCs such as Infosys, HLL, IBS and UST Global for Technology transfer and Faculty/Student Training.\nFrequent National and International Conferences for dissemination of knowledge and ideas.\nDr. APJ Abdul Kalam Centre for Incubation, innovation & Entrepreneurship.\nPartners of VSSC for Testing Space Craft Electronic Packages\nDigital Library with OPAC.\nVibrant eco-friendly green Campus, with Rain water Harvesting facility.\n100 KW Solar Power Plant. Additional 100 kW under construction,\nMany ISR Initiatives\nActive student branches of Professional Societies.\nEffective student advisory System.\nWinners of National & International Project Competitions.\nMulti-media/Smart Class Rooms & Seminar Halls\nNodal Centre for e-Yantra Robotics Lab, IIT Bombay\nA host of proficiency Awards, Merit Awards…\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}