{
    "filename": "mbcet.ac.in_first-year_.html",
    "content": "First Year Student Induction Program – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nFirst Year Student Induction Program\n22 July 2019\nParodos 2019 – The Welcome Ceremony\nAll first year students and their parents shall be present for the Welcome Ceremony\nParodos 2019’\nat\n9.30 am\nat the\nOlympia\n, MBCET.\nThe function will be over by 1.00 pm.\n23 July –\n09 Aug 2019\nAs per the guidelines issued by AICTE and APJ Abdul Kalam Technological University, a three week Student Induction Program will be held for the first year students from July 22 to August 09, 2019.\nThe objective of the Induction Program is to make the Freshers feel comfortable, adjust to the new environment, inculcate in them the ethos of the Institution, build relations between teachers and students and promote bonding within them. This will help them develop self-awareness, give a broader view of life, and sensitize them towards exploring their academic interests and activities. Apart from this, the Induction Programme will provide an opportunity for fostering a closer and meaningful Advisor- Advisee relationship.\nThe three week program will feature:\na)    Visits to the Departments\nb)   Sessions on Universal Human Values\nc)    Bridge classes in English, Mathematics and Science Courses\nd)   Expert lectures\ne)    Creative arts, Yoga and Physical Activities\nf)     Entrepreneurship Development Sessions and\ng)   Diagnostic Tests\nThe Student Induction Program is mandatory as per AICTE and APJ Abdul Kalam Technological University. Hence, students shall compulsorily attend all the classes.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}