{
    "filename": "mbcet.ac.in_faculty_ms-shalu-george-k_.html",
    "content": "Dr. Shalu George K – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nDr. Shalu George K\nEmployee Code / ID No.\n10313032\nQualifications\nPhD (Control Systems)\nOrcid ID\nhttps://orcid.org/0000-0001-9399-438X\nIndustry / R & D Experience\nIndustrial experience: 8 months in Pricol Ltd. As Design Engineer\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9947539777 / 402\nAreas of Interest / Current Research\nControl Systems, Soft Computing Techniques, Assistive technology\nResearch, Consultancy, Publication\nCompleted PhD in 2019.\nPublications:\nVrinda SS, Shilpa Nair U S, Sai Krishnan A K, Sibin George, AadhilAnsar, Soumya A V, Shalu George K, Smart Ergonomic Office Chair, National Conference on Biomedical Instrumentation and Signal Processing, NABIOCON 2023, June 2023.\nShalu George K., Abhiram A., Amal Jose, Ajay Soorya Madhav, Najiya N, S Aswin presented a paper entitled “Steering Angle Estimation for an Autonomous Car” in the International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022 (IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nAdithya S Kumar, Anulekshmi A S, Aparna K P Srikanth, Bhavana Suresh, Anu Gopinath, Shalu George K, An Assistive Mobility Device for Tetraplegic People, Journal of Advances in Electrical Devices,  Volume-5,  Issue-3 (September-December,  2020).\nJoseph John Panicker, Midhun M S, Sanjna Pramod, Sanjo Santhosh, Shilpa Susan Peter, Shalu George K, A Review of Energy Management Schemes using EV Batteries, Journal of Digital Integrated Circuits in Electrical Devices,  Volume – 5,  Issue – 2 (May-August,  2020).\nArya P. Lal, Shalu George K., Modelling and Control of Non-linear Ball and beam system, Indian Journal of Applied Research,  vol. 9,  no. 7,  pp: 1-2,  July 2019.\nShalu George K., K. S. Sivanandan, K.P. Mohandas, Estimation of Elbow Angle using Surface Electromyographic Signals, Journal of Intelligent & Fuzzy Systems (SCI),  Vol. 34,  no. 6,  pp: 4191-4201,  June 2018.\nJisha Joseph, Shalu George K., Field Oriented Control of Permanent Magnet Synchronous Motor, International Journal of Power System and Power Electronics,  Vol. 1,  No. 1,  pp: 45-48,  May 2018.\nJisha Joseph, Shalu George K., Vector Control of Permanent Magnet Synchronous Motor with Sine Pulse Width Modulation Technique, International Journal of Emerging Technology & Advanced Engg,  Volume 7,  pp: 7-12,  April 2018.\nJisha Joseph, Shalu George K., Modelling of Permanent magnet synchronous motor and speed control using Conventional PI controller, International Journal of Innovative Research Explorer,  Volume 5,  Issue 4,  pp: 270-275,  April 2018.\nThasneem M. S., Shalu George K., Speed Control of Brushless DC Motor using Adaptive Fuzzy PID Controller, International Journal of Science and Innovative Engineering & Technology,  Volume 5 May 2017.\nAkhila S. S., Shalu George K., Model Reference Adaptive Control of Ionic Polymer Metal Composite Actuators, 7th International Conference on Advances in Science, Engineering & Technology 2017.\nDeign Gloria Jose, Shalu George K., Modelling and Controller of Liquid Level system using PID controller, International Research Journal of Engineering and Technology,  Vol. 03 Issue 08,  pp: 1-5,  August 2016.\nAarsha Unni J., Vinukumar A. R., Shalu George K., Cyber Security Analysis of Substation Automation System, International Research Journal of Engineering and Technology,  Vol. 3,  No. 7,  pp: 301-304,  July 2016.\nAarsha Unni J., Vinukumar A. R., Shalu George K., Monitoring of Substation Automation System, National Conference on Recent Advances in Computer Science, Applied Electronics & Power Engineering, Prabandh ’16.,  July 2016,  pp: EECS 9.1 – EECS 9.5.\nCelia Pradeep, Shalu George K., Control of Stepper Motor Using Surface EMG Signals, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering,  Vol. 4,  Issue 10,  October 2015,  pp: 8326 – 8333.\nVishnu R. S., Shalu George K., Identification of Surface EMG – Angular Velocity Model using Artificial Neural Network, International Journal of Advanced Research in Electrical, Electronics & Instrumentation Engineering,  Vol.4,  Issue 8,  August 2015,  pp: 7201-7208.\nVishnu R. S., Shalu George K., Modelling of Surface EMG Signals using System Identification Techniques, International Journal of Engineering Research & Technology,  Vol.4,  Issue 7,  July 2015,  pp: 702-705.\nCelia Pradeep, Shalu George K., Acquisition & Classification of sEMG signals, International Conference on Emerging Trends in Engineering and Technology,  August 2015,  pp.11-16.\nSreelekshmi T., Shalu George K., Common Mode Voltage Reduction with Harmonics Study using different PWM Techniques for Three Phase and Five Phase BLDC Motor, 2014 IEEE International Conference on Advances in Green Energy (ICAGE’14).,  December 2014.\nSreelekshmi T., Shalu George K., Comparative Study of Common Mode Voltage Reduction using different PWM Techniques for a Five Phase BLDC Motor, 3rd National Conference on Emerging Technologies (NCET’14).,  August 2014.\nSreelekshmi T., Shalu George K., Harmonics Study in Common mode voltage reduction by Space Vector PWM and Hysteresis Current Controller, National Conference on Emerging Trends in Electrical Engineering.\nVidhya V.P., Shalu George K. & K. S. Sivanandan, Speed based Classification of Mechanomyogram using Fuzzy Logic, IEEE International Multi Conference on Automation, Computing, Control, Communication and Compressed Sensing.,  March 2013.\nShalu George K., K. S. Sivanandan, K.P. Mohandas, Fuzzy Logic and Probabilistic Neural Network for EMG Classification – A Comparative Study, International Journal of Engineering, Research & Technology.,  Vol. 1,  Issue 5,  July 2012.\nShalu George K., K. S. Sivanandan, K.P. Mohandas, Speed based EMG Classification using Fuzzy Logic, International Review on Computers and Softwares (Scopus indexed),  Vol. 7,  N. 3,  May 2012.\nShalu George K.& Carmel Sobia, Stand-alone Controller for Rotary Inverted Pendulum, National Conference on Trends in Instrumentation, System Design & Automation,  April 2007.\nPh.D Research Guidance (Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nApproved KTU Research Supervisor\nResearch Scholars: 2 (Ongoing)Research topics: Energy cooperation in Micrgrids, More Electric Aircraft\nAcademic / Professional Outreach Activities\nMember Secretary, Board of Studies\nMBCET Music Club Coordinator\nReviewer for various International Conferences\nReviewer for Springer Journal of The Institution of Engineers (India): Series B\nCommittee Member of IEEE SPICES 2022\nCommittee Member and Co-chair for ISTE Faculty Convention 2021\nNBA Criteria 10 Sub coordinator\nNAAC Criteria 6 Coordinator\nResource person for the Webinar on “Introduction to Robotic Control” at Adi Shankara Institute of Engineering and Technology, July 2020.\nTechnical Committee Member, National Science Congress, December 2019\nNEXUZ 2019 International Summit Committee Member\nPEDES 2016 International Conference Committee Member\nPEDES 2016 International Conference Cultural events Co-ordinator\nICAGE 2015 International Conference Committee Member\nCommittee Member for Querencia 2014\nMembership in Professional bodies/ organizations\nISTE Life Member, IEI Associate Member\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\nLMCST-ISTE Best Teacher Award (2011)\nFirst Rank for M. E (Control and Instrumentation) in Karunya University, Coimbatore (2007)\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}