{
    "filename": "mbcet.ac.in_faculty_ms-anaswara-johny_.html",
    "content": "Ms. ANASWARA JOHNY – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nScience & Humanities\n>\nMs. ANASWARA JOHNY\nEmployee Code / ID No.\n10722053\nQualifications\nM.Sc\n.(Mathematics),\nB.Sc\n.(Mathematics), B.Ed.\nOrcid ID\n—-\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9946054543/703\nAreas of Interest / Current Research\nLinear Algebra\nResearch, Consultancy, Publication\nFDP ATTENDED:\nParticipated in a 3 day FDP on “Mentoring matters: Strategies for effective academic counselling organized by the Science and Humanities department of Mar Baselios College of Engineering and Technology, Trivandrum from 19\nth\nto 21\nst\nMay 2025.\nParticipated in a 5-day online FDP on “Discrete Mathematics” organized by the Department of Mathematics, School of Advanced Sciences, Vellore Institute of Technology, Vellore from 13\nth\nto 17\nth\nJune 2023.\nParticipated in a 5 day FDP on “Universal Human Values” organized by AICTE from (May 29 -June 2, 2023).\nParticipated in a 2-day FDP on “Awareness and Internal Auditor Training with ISO 9001:2015” conducted by TUVRheinland at the Mar Baselios College of Engineering and Technology, Trivandrum from 25\nth\nto 26\nth\nApril 2023.\nParticipated in a 5 days online (Feb 20-24, 2023) Orientation program on Statistical data analysis using R programming (Theory and practice) organized by Centre for Skill Development and Innovative Research.\nParticipated in a National Conference on Operations research, Differential Equations, Numerical analysis, Computing and Applications held from 23\nrd\nto 25\nth\nMarch 2023 at Mohandas College of Engineering and Technology, Trivandrum.\nParticipated in a 5-Day online FDP on “Ethics in Profession and Student Psychology” conducted by SNGCE, Department of Electrical and Electronics Engineering from 19\nth\nto 24\nth\nJuly 2021.\nParticipated in a National FDP on “Teaching – Competencies for Self – Directed Learning”, conducted by Internal Quality Assurance Cell (IQAC), Mar Baselios Institute of Technology & Science Kothamangalam from 28\nth\nto 30\nth\nJuly 2021.\nParticipated in a 4-day FDP on “Mathematics for Engineering Research”, organized by the Department of Science and Humanities, Sree Buddha College of Engineering from 10\nth\nto 14\nth\nAugust, 2020.\nParticipated in a 5-day FDP on “Discrete Mathematics, Graph Theory and its Application” organized by Department of Applied Science and Humanities, Universal College, Vallivattom from 17\nth\nto 21\nst\nAugust 2020.\nParticipated in a 1-day FDP on “Concept Coaching” conducted by ICT Academy of Kerala, October 2014, Marian Engineering College, Thiruvananthapuram.\n5-Day online FDP on “Ethics in Profession and Student Psychology” conducted by SNGCE, Department of Electrical and Electronics Engineering from 19\nth\nto 24\nth\nJuly 2021.\nNational FDP on “Teaching – Competencies for Self – Directed Learning”, conducted by Internal Quality Assurance Cell (IQAC), Mar Baselios Institute of Technology & Science Kothamangalam from 28\nth\nto 30\nth\nJuly 2021.\nFour-day FDP on “Mathematics for Engineering Research”, organized by the Department of Science and Humanities, Sree Buddha College of Engineering from 10\nth\nto 14\nth\nAugust, 2020.\n“Discrete Mathematics, Graph Theory and its Application” organized by Department of Applied Science and Humanities, Universal College, Vallivattom from 17\nth\nto 21\nst\nAugust 2020.\n“Concept Coaching” conducted by ICT Academy of Kerala, October 2014, Marian Engineering College, Thiruvananthapuram.\nWEBINARS ATTENDED:\nAttended a Two-day National Webinar on “Linear Algebra and its Applications”, organized by the Department of Science and Humanities, FISAT on 19\nth\nand 20\nth\nNovember, 2021.\nAttended an International Webinar Series on “Advances in the Mathematical Modeling of Infectious Diseases”, conducted by Mar Ivanios College on 6\nth\nand 7\nth\nAugust 2020.\nAttended anInternational webinar on Statistics organized by Department of Mathematics and Statistics, Carmel College, Mala on 27\nth\nand 28\nth\nof July 2020.\nAttended aNational Webinar on “An Introduction to Mathematical Control Theory” conducted by St. George’s College, Aruvithura on 21\nst\nAugust 2020.\nAttended a1-day webinar on “Application of Mathematics in Engineering” conducted by UKF College, Department of Humanities and Science on 15\nth\nAugust 2020.\nTwo-day National Webinar on “Linear Algebra and its Applications”, organized by the Department of Science and Humanities, FISAT on 19\nth\nand 20\nth\nNovember, 2021.\nInternational Webinar Series on “Advances in the Mathematical Modeling of Infectious Diseases”, conducted by Mar Ivanios College on 6\nth\nand 7\nth\nAugust 2020.\nInternational webinar on Statistics organized by Department of Mathematics and Statistics, Carmel College, Mala on 27\nth\nand 28\nth\nof July 2020.\nNational Webinar on “An Introduction to Mathematical Control Theory” conducted by St. George’s College, Aruvithura on 21\nst\nAugust 2020.\n“Application of Mathematics in Engineering” conducted by UKF College, Department of Humanities and Science on 15\nth\nAugust 2020.\nNational level webinar on “Polynomials associated with graphs” organized by the Department of Mathematics, Tirunelveli Dakshina Mara Nadar Sangam College, T.Kallikulam on 15\nth\nJune, 2020.\nSEMINARS ATENDED:\nAttended aTwo-day seminar on “Graph Theory and its applications in Engineering”, organized by the Department of Science and Humanities, Mar Baselios College of Engineering and Technology on May 20-21, 2022.\nAttended aOne-day seminar on “Differential Equations and Fourier Series-Some Applications”, organized by the Department of Science and Humanities, Mar Baselios College of Engineering and Technology, on 14\nth\nJanuary 2016.\nTwo-day seminar on “Graph Theory and its applications in Engineering”, organized by the Department of Science and Humanities, Mar Baselios College of Engineering and Technology on May 20-21, 2022.\nOne day seminar on “Differential Equations and Fourier Series-Some Applications”, organized by the Department of Science and Humanities, Mar Baselios College of Engineering and Technology, on 14\nth\nJanuary 2016.\nWORKSHOPS ATTENDED:\nParticipated in a 3-day Online Workshop on “Effective Online Teaching Tools” organized by the Department of Civil Engineering, Mar Baselios College of Engineering and Technology, from 29\nth\nto 31\nst\nJuly 2020.\nParticipated in a 2-day Workshop on “Significance of Research and Development and New Age Recruitment Trends, from 19\nth\nto 20\nth\nJuly 2017, Marian Engineering College, NISH, Thiruvananthapuram.\nParticipated in a One-day workshop on “Stochastic Processes”, on 1\nst\nDecember 2016, ACE College of Engineering, Thiruvananthapuram.\nParticipated in a Three-day UGC sponsored National Workshop on Computational Mathematics, organized by the Department of Mathematics, Mar Ivanios College (Autonomous), Thiruvananthapuram from 9\nth\nto 11\nth\nDecember, 2015.\nThree-days Online Workshop on “Effective Online Teaching Tools” organized by the Department of Civil Engineering, Mar Baselios College of Engineering and Technology, from 29\nth\nto 31\nst\nJuly 2020.\nTwo-day Workshop on “Significance of Research and Development and New Age Recruitment Trends, from 19\nth\nto 20\nth\nJuly 2017, Marian Engineering College, NISH, Thiruvananthapuram.\nOne-day workshop on “Stochastic Processes”, on 1\nst\nDecember 2016, ACE College of Engineering, Thiruvananthapuram.\nThree-day UGC sponsored National Workshop on Computational Mathematics, organized by the Department of Mathematics, Mar Ivanios College (Autonomous), Thiruvananthapuram from 9\nth\nto 11\nth\nDecember, 2015.\nPRESENTATION:\nResource person for FDP on “Engineering Mathematics and Research Methodology”, held on 13\nth\nand 14\nth\nDecember 2018, organized by the Department of Electrical and Electronics Engineering, Marian Engineering College, Thiruvananthapuram.\nRESOURCE PERSON:\nResource person for FDP on “Engineering Mathematics and Research Methodology”, held on 13\nth\nand 14\nth\nDecember 2018, organized by the Department of Electrical and Electronics Engineering, Marian Engineering College, Thiruvananthapuram.\nRESOURCE PERSON:\nResource person for FDP on “Engineering Mathematics and Research Methodology”, held on 13\nth\nand 14\nth\nDecember 2018, organized by the Department of Electrical and Electronics Engineering, Marian Engineering College, Thiruvananthapuram.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\nPassed SET in June 2015.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}