{
    "filename": "mbcet.ac.in_faculty_ms-jean-molly-simon_.html",
    "content": "Ms. Jean Molly Simon – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nCivil Engineering\n>\nMs. Jean Molly Simon\nEmployee Code / ID No.\n10113037\nQualifications\nM.Tech Structural Engineering\nOrcid ID\nhttps://orcid.org/0000-0001-5212-3182\nIndustry / R & D Experience\nTeaching – 17\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9633717790/ 206\nAreas of Interest / Current Research\nConcrete Structures, Steel Structures, Earthquake resistant design, Soil Mechanics, Hydraulic Structures\nResearch, Consultancy, Publication\n1. Dr. A. K. Asraff, Er. Krishnajith Jayamani, Ms. Jean Molly Simon and Ms. Reeba Jacob, “Evaluation of Mechanical Properties and Material Modeling for a Rocket Thrust Chamber”, International Journal of Science, Technology & Engineering (IJSTE), Volume 3, Issue 02, ISSN: 2349-784X, August 2016.\nMs. Jean Molly Simon and Ms. Deepthi Dennison, “Effect of Metakaolin on the mechanical properties of Normal and Steel Fibre Reinforced Concrete”, Proceedings of Furthering Aspiration in Civil Engineering Techniques, Conference held at Govt. College of Engineering, Kannur, June 2014.\nMs. Jean Molly Simon& Ms. Deepthi Dennison, “Shear Behaviour of Reinforced Concrete Beams strengthened with Metakaolin and Steel Fibres”, ‘Proceedings of National Conference on Recent Advances in Civil Engineering, Published by International Journal of Engineering Research and Technology (IJERT) ISSN : 2278-0181, August2014.\nMs. Jean Molly Simon& Ms. Deepthi Dennison, “Flexural Behaviour of Reinforced Concrete Beams strengthened with Metakaolin and Steel Fibres”,‘Proceedings of International Conference on Recent Advances in Civil Engineering, Published by International Conference on Materials, Mechanics and Management.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNil\nAcademic / Professional Outreach Activities\n—–\nMembership in Professional bodies/ organizations\nLife Member ISTE\nCommunity Outreach Activities\n—–\nAwards / Distinctions / Rank / Other Achievements if any\n—–\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}