{
    "filename": "mbcet.ac.in_event_online-internship-on-assistive-technology-mbcet_.html",
    "content": "Online Internship on Assistive Technology – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nThe Department of Electronics & Communication is offering an online internship for the students of the college. The internship will be for 2 weeks under the initiative of the Assistive Technology (AT) group. During the internship, students will be involved in understanding how technology can be used to enhance the lives of differently-abled persons. This year, the internship will be covering the areas of visual impairment, speech and hearing disorders, autism and special needs.\nDates: 3rd August 2020 – 14th August 2020\nThe Internship program comprises:\n1. Webinars by experts from National Institute of Speech and Hearing (NISH), Trivandrum\n2. Live Interaction with FIDE-rated Blind Chess Master, Mr. P. Balaraman, Jyotirgamaya Institute for the Blind\n3. Introduction to VR and AR technology for assistive devices, Embright Technologies\n4. Introduction to hardware and software related to projects\n5. Idea pooling, discussions and much more!\nRegistration Form: https://forms.gle/RvZ3279LJTSiSFRS8\nRegistration Fee: Nil\nEligibility: B. Tech students (S3, S5 and S7 Students) or M.Tech students (S3) of MBCET can apply for the internship.\nGoogle Meet interactions: One to two hours per day\nOpportunity for eligible students to become a Student Mentor! (Please check the eligibility conditions in the Registration Form.)\nEarn your activity points for internships now!\nLimited Seats. Please contact the following faculty for clarifications:\nLani Rachel Mathew: 9995877394\nAmritha B. J. : 9496817349\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}