{
    "filename": "mbcet.ac.in_home_professional-socities_iste_.html",
    "content": "ISTE – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nProfessional Societies\n>\nISTE\nISTE\nThe Indian Society for Technical Education is a national, professional, non-profit making Society registered under the Societies Registration Act of 1860. ISTE is a society of academicians from the field of Engineering Education since 1976 with the objective of improving the quality of technical education. ISTE is involved in the activities such as updating of academic curriculum, summer schools for Engineering Faculties and also for professionals from Engineering field for the continuous improvement in the quality of Engineering Education and its practice. The college is an institutional member of the ISTE since 2005 and a Chapter of the Society is functioning in the college with above 700 student members and 100 faculty members.\nThe major objective of the ISTE are:\nProviding quality training programmes to teachers and administrators of technical institutions to update their knowledge and skills in their fields of activity.\nTo assist and contribute in the production and development of top quality professional engineers and technicians needed by the industry and other organisations.\nProviding guidance and training to students to develop better learning skills and personality.\nISTE MBCET\nMs Asha S, Associate Professor, CS, Chairman, ISTE MBCET\nMs Sheenu P, Assistant Professor, EEE, Secretary, ISTE MBCET\nDr. Nidhi M B, Associate Professor, Associate Professor, ME, Mentor ISTE MBCET and National Executive committee Member ISTE\nDr. Deepak G Dilip. Assistant Professor, ME, Faculty in charge, ISTE MBCET Student chapter\nMs. Soumya A V, Assistant Professor, EEE, Faculty in charge, SHE MBCET\nMs Poorna B R, Assistant Professor, CS, Faculty in charge ISTE MBCET Faculty chapter\nMs. Amritha B J, Assistant Professor, EC, Faculty in charge ISTE MBCET Faculty chapter\nMr Deepak B S, Assistant Professor, ME, Treasurer, ISTE MBCET Student chapter\nMr. Lakshmy S, Assistant Professor, EC, Treasurer, ISTE MBCET Faculty chapter\nMs Lekshmi Chandran M, Assistant Professor, CE, E Bulletin coordinator\nMs Jean Molly Simon, Assistant Professor, CE, E Bulletin co-coordinator\nReports\nAnnual Report 2024-2025 –\nc\nlickhere\nAnnual Report 2023-2024 –\nclick here\nAnnual Report 2022-2023 –\nclick here\nAnnual Report 2021-2022 –\nclick here\nAnnual Report 2020-2021 –\nclick here\nANNUAL GENERAL BODY MEETING (AGM) 2020\n–\nclickhere\nISTE Faculty chapter report 2023-24 –\nclickhere\nISTE :\nSummary of Report Activities during\nFeb 2019 – Aug 2020 –\nclick here\nISTE: Summary of Report Activities Sep 2018- Aug 2019 (Student chapter)-\nclick here\nAwards\nMar Baselios College of Engineering and Technology received the special appreciation award for the contributions of ISTE faculty chapter during 2023-24(Engineering College stream)at the 35th Annual State Convention of ISTE Kerala Section  held on 18th January 2025 at Marian Engineering College, Thiruvananthapuram.\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nISHARE\nASME\nIET\nIEEE Activities\nSAE MBCET\nComputer Society of India\nISTE\nACM\nInvited Talks\nCourses\nTechnical Events\nWorkshops\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}