{
    "filename": "mbcet.ac.in_departments_computer-science-engineering_peos-pos_.html",
    "content": "B. Tech PEOs POs & PSOs – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nComputer Science & Engineering\n>\nB. Tech PEOs POs & PSOs\nB. Tech PEOs POs & PSOs\nProgramme Outcomes\nEngineering knowledge:\nApply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.\nProblem analysis\n: Identify, formulate, research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.\nDesign/development of solutions\n: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.\nConduct investigations of complex problems\n: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.\nModern tool usage\n: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.\nThe engineer and society\n: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.\nEnvironment and sustainability\n: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.\nEthics:\nApply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.\nIndividual and team work\n: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.\nCommunication:\nCommunicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.\nProject management and finance\n: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.\nLife-long learning\n: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.\nB.Tech - Computer Science - PEOs and PSOs\nProgramme Educational Objectives\nGraduates will be successful professionals in Industries of core or interdisciplinary nature or entrepreneurs, demonstrating effective leadership and excellent team work.\nGraduates will expand the horizon of knowledge through higher education or research, leading to self-directed professional development.\nGraduates will demonstrate professional attitude and ethics while providing solutions in societal and environmental contexts.\nProgramme Specific Objectives\nApply Algorithmic Principles, Programming Skills and Software Engineering Principles to design, develop and evaluate Software Systems of varying complexities.\nApply knowledge of System Integration to design and implement computer-based systems.\nSolve real world and socially relevant problems with the knowledge in recent and advanced Computing Technologies\nB.Tech - Artificial Intelligence - PEOs and PSOs\nProgramme Educational Objectives\nPEO1:\nGraduates will be successful professionals in Industries of core or interdisciplinary nature or entrepreneurs, demonstrating effective leadership and excellent team work.\nPEO2:\nGraduates will expand the horizon of knowledge through higher education or research, leading to self-directed professional development.\nPEO3:\nGraduates will demonstrate competency in AI & ML, professional attitude and ethics while providing solutions in societal and environmental contexts\nProgramme Specific Objectives\nPSO1:\nTo apply Algorithmic Principles, Programming Skills and Software Engineering Principles to design, develop and evaluate Software Systems of varying complexities.\nPSO2:\nTo apply knowledge of System Integration to design and implement computer-based systems\nPSO3:\nTo solve real world and socially relevant problems using AI and ML techniques\nVision\nTo be a Centre of Excellence in Computer Science and Engineering providing quality education and research for the betterment of the society.\nMission\nTo impart sound knowledge in theoretical and applied foundations of Computer Science and Engineering, and to train the students to solve real life issues to effectively define and shape life.\nBoS\nThe People\nDepartment Advisory Board\nFacilities\nNews & Events\nWorkshops & Seminars\nResearch and Consultancy\nPlacements\nActivities\nVideo Lectures\nB. Tech PEOs POs & PSOs\nSyllabus\nTime Table\nCSE Blog\nFormer HoDs"
}