{
    "filename": "mbcet.ac.in_resources_itms_.html",
    "content": "ITMS – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nResources\n>\nITMS\nITMS\nInformation Technology Management and Services (ITMS) division effectively manages the IT infrastructure facilities and provide quality IT Services for the Institution’s Academic, Research and Administrative needs. ITMS is headed by the Head-ITMS and has four sub units, namely Server Administration, Network Administration, Software Development and Systems Support having a total of nine staff members.\nCore Services\nInstallation, Operation and Management of the computer backbone network in the college buildings.\nInstallation and Maintenance of all computer hardware and systems like Switches, Routers, Servers, NVR, PC’s, UPS, WiFi Access Points, LCD projectors, Biometric machines, Surveillance Cameras etc.\nConnection of the College Network to Internet through UTM device and its management.\nProvision of a central storage space and email service for all staff.\nInstallation, Operation and Management of Academic Management System, Digital Library (DSpace), Biometric Attendance and Leave Management System, Streaming media server, Email server and other Campus management Software.\nCo-ordination of Campus-wide software licenses.\nCollege Domain and Website Management.\nCo-ordination of on-line publication on the college website.\nITMS TEAM\n1\nMr. Raju K Gopal\nProfessor  &  Head\n2\nMs. Reena Rajan\nSel. Grade Programmer\n3\nMr. Jiju Wilfred\nNetwork Administrator\n4\nMr. Shinulal P K\nSr. Programmer\n5\nMr. Laiju B\nAsst. System Administrator\n6\nMs. Priya Rani K\nData Entry Operator\n7\nMs. Mrinalini S V\nJunior Programmer\n8\nMr. Arun Prasad S K\nAsst. System Supp. Tech.\n9\nMr. Krishna Kumar S U\nAsst. Network Administrator\n10\nMr. Abey E Mathews\nJunior Tech. Asst.\n11\nMs. Nisha Mathew\nAsst. System Administrator\nNursing Station\nLibrary\nITMS\nHostel\nTransportation\nCanteen\nAmenities Center\nGymnasium\nChapel\nMaintenance Cell\nCells and Groups\nEnvironment Management Cell\nWaste Management Cell\nCentral Computing Facility\nConference Halls\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}