{
    "filename": "mbcet.ac.in_innovation-entrepreneurship_iedc-innovation-entrepreneurship-development-centre_.html",
    "content": "Innovation & Entrepreneurship Development Centre (IEDC) – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nInnovation & Entrepreneurship\n>\nInnovation & Entrepreneurship Development Centre (IEDC)\nInnovation & Entrepreneurship Development Centre (IEDC)\nCatalyst- Mar Baselios IEDC\nThe Innovation and Entrepreneurship Development Centre of Mar Baselios College of Engineering and Technology, Catalyst was inaugurated in the year 2013 with a purpose of inspiring students to become independent engineers by exposing then to the world of Entrepreneurship through Innovation. The Centre aims in sharpening the skills of students, broadening their knowledge base and equipping them with technical and non-technical qualities that an engineer need.\nRather than pushing students to startup, the centre believes in inculcating the entrepreneurial spirit in students. The members have identified the true joy of self-learning and they passionately involve in brining life into their ideas, to solve the problems that they see around. They know the importance of spreading this fire to ignite the minds of their fellow students and hence have dedicated all their work in IEDC for this purpose, besides working on their own individual projects. Catalyst Mar Baselios IEDC aims in helping the students follow their dreams and passion to help them depart MBCET campus not just as engineering graduates, but as real engineers who seek and solve problems.\nThe Executive Committee\nThe Executive committee of Catalyst works as a team which identifies the opportunities and challenges around social as well as engineering scenarios. The core working committee of IEDC has 14 student members and 1 faculty member. The faculty member in charge is designated as the Nodal Officer of IEDC.\nThe members of Executive committee are:\nNodal officer (Faculty Member)\nCEO- Chief Executive Officer\nCOO- Chief Operations Officer\nCTO- Chief Technical Officer\nCCO- Chief Creative Officer\nCMO- Chief Marketing Officer\nCSO- Chief Social Officer\nCFO- Chief Finance Officer\nExecutive Creative Curators (7 student members)\nThe Executive Committee Selection\nThe members are selected through IEDC RELevent- Recruitment of Emerging Leaders Event; which is a two-day event where students are given multiple assignments and activities to measure their attitude and growth mindset. The major sessions were based on ideation, productization, communication, stress management. It was followed by a one to one discussion with an external panel.\nIEDC Catalyst link –\nClickhere\n2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2018\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nInnovation & Entrepreneurship Development Centre (IEDC)\nMaker Space\nµLearn and Skill Development Program(SDP)\nInstitution's Innovation Council (IIC)\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}