{
    "filename": "mbcet.ac.in_faculty_ms-poorna-b-r_.html",
    "content": "Ms. Poorna B.R – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nComputer Science & Engineering\n>\nMs. Poorna B.R\nEmployee Code / ID No.\n10509008\nQualifications\nM.E\nOrcid ID\nhttps://orcid.org/0000-0002-1181-2448\nIndustry / R & D Experience\n—\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9446356114\nAreas of Interest / Current Research\nMedical Imaging, Deep learning, Machine learning, Data Analytics\nResearch,  Consultancy, Publication\nMs. Poorna B.R presented a research paper titled“ Machine Learning Techniques for Healthcare Recommendation Systems” at National Seminar on Transformative Innovations Shaping the AI-Driven Epoch , as part of 35th Annual State Convention of ISTE Kerala Section held on 18th January 2025 at Marian Engineering College, Thiruvananthapuram.\nB. R. Poorna, Dhanush D. Chandran, Varsha Sujith Krishna, Deanne Maria Rodricks, Johann Joshua Knox, “Healthcare Recommender System Using Random Forest Classifier,” in International Journal of Research in Engineering, Science and Management, vol. 7, no. 10, pp. 13-16, October 2024.\nB. R. Poorna, Edwin Charles Mathew, “Drug Recommendation System Using TF-IDF Vectorization and Cosine Similarity,” in International Journal of Research in Engineering, Science and Management, vol. 7, no. 10, pp. 1-3, October 2024.\nTony, A., Jayaram, R., Gokul Krishna, J.K., Gokul Krishna, B., Poorna, B.R. (2022) Augmented Reality Integrated Smart Math Solver. In: Asokan, R., Ruiz, D.P., Baig, Z.A., Piramuthu, S. (eds) Smart Data Intelligence. Algorithms for Intelligent Systems. Springer, Singapore. https://doi.org/10.1007/978-981-19-3311-0_49.\nIsmail, M., Najeeb, T., Anzar, N.S., Aditya, A., Poorna, B.R. (2022). Using Computer Vision to Detect Violation of Social Distancing in Queues. In: Smys, S., Balas, V.E., Palanisamy, R. (eds) Inventive Computation and Information Technologies. Lecture Notes in Networks and Systems, vol 336. Springer, Singapore. https://doi.org/10.1007/978-981-16-6723-7_57.\nAdil, A.P., Anandhu, M.G., Joy, J.E., Karethara, T.S., Anjali, S., Poorna, B.R. (2023). Accident Detection in Surveillance Camera. In: Hemanth, J., Pelusi, D., Chen, J.IZ. (eds) Intelligent Cyber Physical Systems and Internet of Things. ICoICI 2022. Engineering Cyber-Physical Systems and Critical Infrastructures, vol 3. Springer, Cham. https://doi.org/10.1007/978-3-031-18497-0_26.\nPoorna B.R presented research paper entitled “Using Computer Vision to detect violation of social distancing in Queues” at the third International Conference  on Inventive Computation and Information Technologies(ICICIT-2021) organised by RVS Technical  Campus, Coimbatore on 12 August  2021.\nPoorna B.R presented papers entitled “Using Computer Vision to Detect Violation of Social Distancing” and “Augmented Reality Integrated Smart Math Solver” in the in the 31st Annual State Faculty Convention of the ISTE Kerala Section, on “Opportunities and Challenges in Technical Education in the Post-COVID Scenario” organized by Mar Baselios College of Engineering and Technology, on 23 January 2021,\nPoorna B.R, Akhil R,Athul soori,Dileep Shankar,Mrinal Krishnan presented a paper“Detection of specific learning disabilities in children,2017” at International conference –NETACT-2017 organized by CSE,MBCET\nPoorna B.R Jesna Mohan and J Haripriya Published a research paper titled” wSafe24/7- A Personalized Women Safety Application” in IRJAES, Volume 5, Issue 3, 2020.\nPoorna B R, Reshma J P, Vidhya Varma E, “Voice Controlled Computer System using FUZZY Logic”, International Journal of Modern Trends in Engineering and Research,2015.\nPoorna B.R, Dhanusha T. John , Kavya S. Kumar , Vaishak T. Nair , P. Visakh , published a paper “Cricket Scoreboard Automation using Umpire Gestures” in International Journal of Research in Engineering, Science and Management Volume-2, Issue-7, July-2019\nMr. Vysakh Jayan,Mr. Nikhil Anilkumar ,Mr.Augustine B,Mr.Amal saji Varghese,Ms.Poorna B.R has published a research paper titled” Personal Journal with Emotional Intelligence and Sentiment Tracking” in IJSER,June 2020\nPoorna B.R  has published a paper entitled  “Medical diagnostic system using Fuzzy logic ” in International journal of latest trends in Engineering and Technology(IJLTET)\nPoorna B.R  presented a paper entitled “Graphical Passwords” in the National Conferences On Advances And Challenges In Multimedia Communication organized by Noorul Islam College of Engineering.\nPoorna B.R presented a paper entitled “Phising:Attacks And Defence Mechanisms” in the National Conference On Internet And Multimedia Communication organized by Noorul Islam College of Engineering\nPoorna B.R presented a paper entitled ” Disease Estimation Using Fuzzy Approach” in the National Conference NC-Vcom organized by Saintgits College of Engineering.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—\nAcademic / Professional Outreach Activities\nIBM Skills Academy -Data Science Instructor.\nResource person for the workshop on “Machine learning and Deep learning “organized by ACM student’s chapter,during September 20 and 21 and November 9 and 10,2019 at Mar Baselios College of Engineering and Technology.\nResource person for “Infosys Campus Connect Programme” for students who got placed in Infosys, at MBCET\nMembership in Professional bodies/ organizations\nISTE\nCommunity Outreach Activities\nCoordinator of SPARSHAM community outreach activities of CSE (2023-24)\nAwards / Distinctions / Rank / Other Achievements if any\nMs. Poorna B.R received the best paper award for the paper titled“ Machine Learning Techniques for Healthcare Recommendation Systems” at National Seminar on Transformative Innovations Shaping the AI-Driven Epoch , as part of 35th Annual State Convention of ISTE Kerala Section held on 18th January 2025 at Marian Engineering College, Thiruvananthapuram.\nThe project titled, “Augmented Reality Integrated Smart Math Solver”, by Ms. Poorna.BR, Assistant Professor (Principal Investigator) and Mr. Abraham Tony Itty, Mr. Gokul Krishna JK, Mr. Gokul Krishna B, Mr. Jayaram R (Student Investigators)  got  funding by the Kerala State Council for Science Technology and Environment (KSCSTE)\nThe faculty project proposal  “Health care recommender system  using hybrid filtering technique“  by Ms.Poorna B.R, Asst.Professor, CSE has been approved for CERD funding.\nThe papers entitled “Using Computer Vision to Detect Violation of Social Distancing” and “Augmented Reality Integrated Smart Math Solver” presented by Ms. Poorna B.R, Assistant Professor, CSE have been selected as best papers of tracks “Inclusivity in Technical Education and Society” and “Effective Technologies in Education” respectively in the 31st Annual State Faculty Convention of the ISTE Kerala Section, on “Opportunities and Challenges in Technical Education in the Post-COVID Scenario” organized by Mar Baselios College of Engineering and Technology, on 23 January 2021, at Thiruvananthapuram in association with ISTE Kerala Section.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}