{
    "filename": "mbcet.ac.in_departments_electrical-electronics-engineering_conferences_.html",
    "content": "Conferences – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nElectrical and Electronics Engineering\n>\nConferences\nConferences\nInternational Conferences Attended\n2024-2025\nPAPER PRESENTATION\nDr. Nisha G K,\nProfessor, EEE Department presented three papers in the AICTE sponsored International Conference on Recent Trends in Energy, Environment, Science and Technology (CREEST- 2025) held @ UKF College of Engineering and Technology from 7th- 9th May 2025.\nChinmay Krishna S\n, “Artificial Intelligence: Revolutionising Electrical and Electronics Engineering”\nSandhya P, Ms. Aiswarya S S\n, ” Mitigating Risks in EV Wireless Power Transmission through Foreign Object Detection”\nMs. Rinku R S, Dr. Sheryl Arulini A\n,” Review on Torque Ripple Mitigation Strategies and Fault Tolerant Control Techniques for Switched Reluctance Motor Drives”\n2023-24\nMr Anil J\n, Assistant Professor, EED\nchaired a Technical session\nin the International Conference on Circuit Power and Computing Technologies\n(ICCPCT 2024)\norganized by Baselios Mathews II College of Engineering, Sasthamcotta, Kollam. He was also one of the\nTechnical reviewers\nfor the conference.\nDr. Sheryl Arulini\n, Assistant Professor, EED attended the IEEE sponsored 3\nrd\nInternational Conference on New Energy and Power Engineering as an Academic Committee Member held at Huzhou, China from 24 to 26 November 2023.\nMs. Surasmi N. L\n., Assistant Professor, EED presented two papers titled “Hybrid Multilevel Inverter Control for Harmonic Mitigation” and “Grid-integrated Solar Photovoltaic Converter Control for Power Quality Enhancement”, in IEEE International Conference on Control, Communication and Computing (ICCC 2023) organized by College of Engineering Trivandrum from 19 to 21 May 2023. She received the\nbest paper award\nfor the paper titled “Hybrid Multilevel Inverter Control for Harmonic Mitigation”.\n2021-22\nG K Nisha\n, Stella Kurien presented a paper entitled “Current Control with Hysteresis Controller and Sliding mode Controller in SRM” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nG K Nisha\n, Praveen O. presented a paper entitled “Performance study of Capacitor Clamped Multilevel Inverter fed Induction Motor Drive for Electric Vehicle Application” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nG K Nisha\n, Lekshmi P. Nair presented a paper entitled “Torque Ripple Reduction And Speed Control Of PMSM Using Fuzzy Logic For Propulsion Application” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nPraveen Raj R. S.\npresented a paper entitled “Performance Assessment of A Hybrid Islanding Detection Scheme For PV Based Distributed Generators Combining Total Harmonic Distortion And Bidirectional Reactive Power Injection” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nSandhya P, G K Nisha\npresented a paper entitled “Review of Battery Charging Methods for Electric Vehicle” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nShalu George K\n., Abhiram A., Amal Jose, Ajay Soorya Madhav, Najiya N, S Aswin presented a paper entitled “Steering Angle Estimation for an Autonomous Car” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nShyju Susan Mathew\n, V R Jisha presented a paper entitled “Decentralized control of a slow moving mobile manipulator” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nShyju Susan Mathew\n, Aswin, Navya S Warrier, Ann Elizabeth Babu presented a paper entitled “Design of an Optimized Controller for Docking System for Space Application” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nSojy C Rajan\npresented a paper entitled “Voltage Profile Improvement of a Multi Microgrid Interconnection Scheme using Synchronverters” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nSojy C Rajan\npresented a paper entitled “Grey Wolf Optimizer Algorithm for Performance Improvement & Cost Optimization in Microgrids” in the 6th IEEE\nInternational Conference on Green Energy & Applications 2022\n(ICGEA 2022) jointly organized by IEEE and sponsored by Power & Energy Society, Singapore from March 4-6, 2022.\nAnu Gopinath\n, V. R. Jisha presented a paper entitled “Gain Scheduled LQR Control of a Two Wheeled Mobile Robot with Heavy Payloads” in the\nInternational Conference on Signal Processing, Informatics, Communication and Energy Systems 2022\n(IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nArjun U, Gowri B K, Gayathri U, Malavika V P,\nSojy Rajan\nand\nAjish Ashok\npresented a paper titled “Dual Axis Solar Tracker for an Automated Irrigation System in the\nSpringer International Conference\non Smart Energy and Advances in Power Technologies\n(ICSEAPT’21), NIT Jamshedpur on 7 September 2021.\nAiswarya R, Elby Barnabas, Hari Shankar R S, Nandagopal S, and\nA N Archana\npresented a paper titled “Design and Simulation of Wireless Power Transfer System for Electric Vehicle Application” in the\nSpringer International Conference\non Smart Energy and Advances in Power Technologies\n(ICSEAPT’21), NIT Jamshedpur on 6 September 2021.\nVishnu M Nair, Nanditha Sai Prasanth, Amaze Anna Toms, Abinshah Ameer,\nManju Sreekumar\npresented a paper titled “Demand Management System using Artificial Intelligence and IoT” in the 9th\nScopus Indexed International Conference\non Innovations in Computer Science and Engineering\n(ICICSE 2021) on 3 September 2021\n2020-21\nC Sojy Rajan\npresented a paper entitled “Fuzzy Controlled D-STATCOM to improve the PCC Voltage Profile of a Multi-Microgrid Interconnection Scheme” in the Springer Electric Power & Renewable Energy International Conference (EPREC-2021) organized by Department of Electrical Engineering, NIT Jamshedpur and sponsored by Springer from May 28-30, 2021.\nManju Ann Mathews\npresented a paper entitled “A novel power Management Strategy for Frequency Regulation in Low Inertia Grid” in 8th IEEE Conference on Technologies for Sustainability (SusTech 2021) organized by IEEE Region 6 USA at\nOrange County, California, USA\non April 22-24, 2021.\nSandhya P\n. presented a paper entitled “Solar PV fed BLDC motor Drive using ZETA Converter” in the\nInternational Conference on Energy and Environment\n(ICEE 2021) held during April 09 – 10, 2021, organised by Jyothi Engineering College, Thrissur.\nN. Archana\nand T. Rajeev, “EV Charging Station Allocation in a Distribution Network Based on Power Quality,” in Proc. of 2021\nIEEE Power and Energy Conference\nat Illinois (PECI), pp. 1-6, April 2021. doi: 10.1109/PECI51586.2021.9435228.\nElizabeth Varghese\npresented a paper entitled “Design of Robust Fractional Controller for Unstable Linear Systems Based on Phase Shaper Method” in the 6\nth\nIEEE International Conference for Convergence in Technology\n(I2CT), Pune held during April 2 – 4, 2021.\nArchana A N\npresented a paper entitled “EV Charging Station Allocation in a Distribution System based on Power Quality” in the IEEE Power and Energy Conference at Illinois (PECI 2021) organized by University of Illinois, Urbana–Champaign, USA and sponsored by IEEE PES/PELS/IAS Joint Student Chapter from April 1 – 2, 2021.\nNisha G K\npresented a paper entitled “Induction Machine Characteristics Control in Field Weakening Region for Propulsion Application” in the International Conference on Smart Grid Energy Systems and Control (SGESC-2021) organized by Department of Electrical Engineering, NIT Kurukshetra and sponsored by Springer Series from March 19-21, 2021.\nJeneena Babu\npresented a paper entitled “Comparative study of Closed Loop Controlled Parallel Connected Converter Methods for Minimization of Circulating Current” in the International Conference on Smart Grid Energy Systems and Control (SGESC-2021) organized by Department of Electrical Engineering, NIT Kurukshetra and sponsored by Springer Series from March 19-21, 2021.\nNisha G K,\nand\nDr. Shalu\nGeorge chaired ISTE Faculty Convention organized by Mar Baselios College of Engineering and Technology and sponsored by ISTE on 23.01.2021\nNisha G.K and Aswin R. B.,\npresented a paper ‘Creating an online virtual environment for Electrical Engineers’, in the 31st Annual State Convention of the ISTE Kerala Section on “Opportunities and Challenges in Technical Education in the Post-COVID Scenario” organized by Mar Baselios College of Engineering and Technology, on 23 January 2021, at Thiruvananthapuram in association with ISTE Kerala Section.\nHridya C. K., Surasmi N. L., Jeneena Babu, Soumya A. V. and Sheenu P\n. presented a paper ‘ COVID-19 and Digital Transformation in Academia: A Case Study’, in the 31st Annual State Convention of the ISTE Kerala Section on “Opportunities and Challenges in Technical Education in the Post-COVID Scenario” organized by Mar Baselios College of Engineering and Technology, on 23 January 2021, at Thiruvananthapuram in association with ISTE Kerala Section.\nSurasmi N. L.\npresented a paper titled “Harmonic Mitigation in Induction-Motor Drives using Active Filtering Approach” at the 2020 IEEE International Power and Renewable Energy Conference (IPRECON) held at College of Engineering Karunagappally from 30 October 2020 to 1 November 2020.\nElizabeth Varghese\npresented a paper on “Robust Fractional Order PI Controller for Attitude Control of Launch Vehicle with Flexible Dynamics” in the International Conference on Sustainable Technology Applications for Green Engineering Solutions STAGE 2020 organized by NSS College of Engineering, Palakkad from 17 to 18 July 2020.\nManju Sreekumar\nattended the RBCDSAI’s International Summit organized by Indian Institute of Technology Madras and sponsored by Indian Institute of Technology, Madras from 18 to 20 June 2020.\nShyju Susan Mathew presented a paper titled “Tracking Control of a Mobile Manipulator with External Torque disturbances using Computed Torque Control” in the 17\nth\nIEEE INDICON 2020 held between 11 to 13 December 2020 at Netaji Subhash University of Technology, New Delhi.\nSojy Rajan C. presented a paper titled “Modeling Operation and Simulation of Interconnected DC Microgrids” at the third edition of the 2020\nIEEE International Conference on Power Instrumentation Control and Computing\n(PICC2020) under the aegis of the Sixth Biennial International Conference on Emerging Trends in Engineering Science and Technology held at Government Engineering College Thrissur from 17 to 19 December 2020\n.\n2019-20\nMerin Zachariah,\nNisha G. K. and Jeneena Babu\n, presented a paper entitled “Circulating Current Control of Parallel connected converters”, in the\n4\nth\nInternational Conference on Inventive Systems and Control,\nICISC 2020, organized by JCT College of Engineering and Technology, Coimbatore, 8-10 January 2020.\nElizabeth Varghese\npresented a paper entitled “Robust Fractional Order Controller for an Expendable Launch Vehicle” in the\nInternational Conference on Design, Automation and Control\n, ICDAC 2020, held on 6 to 8 January 2020 at Vellore Institute of Technology.\nManju Ann Mathews\npresented a paper entitled “Fuzzy based management of Hybrid Energy Storage System for improved dynamic response of DC microgrid” in the\nIEEE International conference on “Power Electronics, Smart Grid and Renewable Energy\n(PESGRE 2020) held on 2 to 4 January 2020 at Le Meridien, Kochi.\nArchana A. N.\npresented a paper entitled “Reliability Index based approach for allocating EV charging station in a distribution system” in the\nIEEE International conference on “Power Electronics, Smart Grid and Renewable Energy\n(PESGRE 2020) held on 2 to 4 January 2020 at Le Meridien, Kochi.\nMs. Surasmi N. L.\npresented a paper entitled “Power Quality Improvement in Multilevel Inverter using Open end winding Motor Scheme” in the\n5th IEEE International Women in Engineering (WIE) Conference on Electrical and Computer Engineering 2019\n(IEEE WIECON-ECE 2019 Conference) on 15 & 16 November 2019 at Bangalore, India.\nInternational Conferences Conducted/Hosted\nICEMPS 2024 Technically co-sponsored by IEEE Kerala Section\nThe 2024 International Conference on E-Mobility, Power Control and Smart Systems (ICEMPS 2024), technically co-sponsored by IEEE Kerala Section and co-sponsored by APJ Abdul Kalam Technological University and MBCET Alumni Association was organised by the Department of Electrical and Electronics Engineering, Mar Baselios College of Engineering and Technology, Thiruvananthapuram, from 18 to 20 April 2024. The conference was conducted in the hybrid mode. Out of the 406 papers received, 112 papers were accepted, and 106 papers were registered.\nICEMPS 2024 Report\nNEXUZ ’19\nNexuz ’19 Report –\nClick here\nIEEE PEDES 2016-Hosted by MBCET\nPEDES, the IEEE sponsored series of International Conferences on Power Electronics, Drives and Energy Systems was started in 1996. The first in the Series, PEDES 1996 was held in New Delhi. It was followed by PEDES 1998 in Perth, Australia; PEDES 2006 & PEDES 2010 in New Delhi, PEDES 2012 in Bangalore and PEDES 2014 in Mumbai. PEDES 2016 was held at Trivandrum and was sponsored by the four important IEEE societies, viz., the IEEE Industry Application Society, IEEE Power Electronics Society, IEEE Industrial Electronics Society and IEEE Power and Energy Society.\nThe event was hosted by Mar Baselios College of Engineering & Technology.\nThe sessions on 14\nth\nDec 2016 was held at Hotel UdaySamudra, Kovalam, Trivandrum and included one full day tutorials and the inaugural ceremony. The sessions from 15\nth\nDec to 17\nth\nDec 2016 was held at MBCET and included\nplenary talks and over 350 paper and poster presentations in 6 different tracks over 9 different venues. Over 500 delegates from 21 countries all over the world participated in the Conference.\nThe tutorial sessions were handled by eminent personalities –\nMr. Joachim Holtz\nfrom University of Wuppertal, Germany,\nMr. Anurag K Srivastava\n, Professor & Director of Smart Grid Demonstration and Research Investigation Lab School of Electrical Engineering and Computer Science, Washington State University,\nMr. LalitGoel\n, Professor of Power Engineering & Director of Office of Global Education & Mobility Nanyang Technological University Singapore,\nAlirezaKhaligh\nProfessor & Director of the MPEL, University of Maryland, College park, USA.\nPlenary talks were handled by eminent personalities like\nDr. Deepak Divan\n, Professor, John E Pippin Chair, GRA Eminent Scholar and Director of the Center for Distributed Energy at the Georgia Institute of Technology in Atlanta, GA;\nDr. Ambrish Chandra\n, Professor of Electrical Engineering Department at École de TechnologieSupérieure, Université du Québec, Montréal, Canada;\nDr. Prasad Enjeti\n, lead developer of the Power Electronics / Power Quality & Fuel Cell Power Conditioning Laboratories at Texas A&M University;\nDr. Jih-Sheng (Jason) Lai\n, James. S. Tucker Endowed Chair Professor and Director of Future Energy Electronics Center (FEEC);\nDr. Praveen Jain\n, Professor of Electrical and Computer Engineering, Tier 1 Canada Research Chair in Power Electronics, and Director of the Queens Centre for Energy and Power Electronics Research at Queens University.\nDr. Sheldon S. Williamson\n, Associate Professor at the Smart Transportation Electrification and Energy Research (STEER) group, within the Department of Electrical, Computer, and Software Engineering, at the University of Ontario-Institute of Technology (UOIT) in Oshawa, Ontario, Canada;\nDr. Koki Matsuse\n, Emeritus Professor in Dept of Electrical Engineering, Meiji University;\nDr. Seung-Ki Sul,\nProfessor, School of the Electrical and Computer Engineering, Seoul National University.\nThe conference provided a unique forum for the exchange of knowledge and information among the professionals across the globe in the areas of Power Electronics, Drives and Energy Systems – subjects which have greater significance owing to the emphasis on Energy affected by the climate change. The Conference concluded with panel discussion followed by the valedictory session. Variety of programs was performed by the students of MBCET for Gala dinner arranged for all delegates on 16th December 2016 and was well appreciated by all.\nThe delegates congratulated the efforts taken by MBCET team in organizing the event. The General Chair of the Conference was the Principal,\nDr T M George\n. The hospitality and local arrangement co-ordinators of the event were\nProf. A S Shajilal, Ms. Elizabeth Varghese and Ms. C SojyRajan\n. The technical program chair was\nDr. Unnikrishnan A K\nand the publication chair was\nMs. Divya N A\n.\nVision\nTo be a Centre of Excellence in Electrical & Electronics Engineering Education, Research and Application of knowledge to benefit the society at large.\nMission\nTo mould quality Electrical Engineers, fostering creativity and innovation to address global issues.\nBoS\nDepartment Advisory Board\nThe People\nFacilities\nNews and Events\nActivities\nConferences\nWorkshops & Seminars\nResearch & Consultancy\nPlacement\nB. Tech PEOs, POs & PSOs\nOpportunities\nCurriculum & Syllabus\nTime Table\nVideo Lectures\nFormer HODs\nDepartment Google Site"
}