{
    "filename": "mbcet.ac.in_departments_civil-engineering_achievements_.html",
    "content": "Achievements – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nCivil Engineering\n>\nAchievements\nAchievements\nStudent Achievements\nStudent Achievements 2024-2025\nPaper Presentation\nDilsa M, Greeshma G, Sona Mary John and S P Balasubramaniam of the Semester 8 CE2 batch, presented a paper titled “Impact of threshold Rainfall on Landslides: A case study of Kerala ” at the second International Conference in Civil Engineering for Sustainable Planet (ICCESP), held at Marian Engineering College, Thiruvananthapuram Kerala, from 6th December to 8th December 2024. The project was guided by Dr. Alice Thomas, Assistant Professor Department of Civil Engineering.\nAshna Rachel Shine (S5 CE2) got selected in the KTU Women ‘KABADDI’ University team\nStudent Achievements 2023-2024\nASCE India Section Southern Region Outstanding Thesis Award 2024\nMr. Jyothis S., M Tech Structural Engineering student and Dr. Jayasree S.,Professor Department of Civil engineering won the Outstanding Thesis Award under the PG category (2nd Prize) organized by the ASCE India Section Southern Region, for the topic ‘Strength and Behaviour of RCC and alkali activated sustainable concrete deep beams with openings’. The recipients are invited to Mahindra University, Jeedimetla, Hyderabad to receive the award on 19.08.2024. The thesis has demonstrated remarkable innovation, depth of research and practical impact, setting a high benchmark for academic excellence in the Civil Engineering field as commented by the judgment panel.\nBEST PROJECT AWARD\nTeam Mar Baselios College of Engineering and Technology (Dept. of Civil Engineering), guided by\nMs. Radhika P\n. Has secured\nfirst place at all Kerala Project Expo 2024\nconducted by KTU for the Project\n“Valorization of Plastic Wastes using Thermo-Catalytic Plastic Pyrolysis”.\nThe project also bagged the “\nYoung Innovators Awards\n” at the Young Innovators Technical Summit 2024, held at Govt. Polytechnic college, Kalamasserry.\nTeam members Adarsh S L, Alen Alex, Dhanush Vijay and Shaheen Noushad receiving the award.\nLawn Tennis Champion\nFaiz Muhammad.S of S3 CE along with his team lifted the Intercollegiate, Inter-Zone (All Kerala) Lawn Tennis Championship held at TKM Engineering College on 25 Nov 2023.\nSelected to University Volleyball Team\nVineeth Rohan of S7 CE 1 got selected to the KTU University Volleyball Team for the third time and he has also been selected as the captain of the University Volleyball Team.\nSelected to Senior Basketball Team\nASHISH T of S3 CE got selected in the Thiruvananthapuram Senior Basketball Men’s team going to participate in the State Basketball Championship to be held from 7 to 12 Nov 2023.\nEvent\nAward\nLevel (College/University/State/National)\nName of the student(s)\nFirst Place in Dance competition Nrithya 23 as part of cultural fest Tharang 2023 held at Jyothi Engineering College Cheruthuruthy\nFirst prize\nState\nKarthik R\nA Akash\nParticipated in the District Volleyball Championshipand has been  selected to State level tournament representing Trivandrum District.\nSelected to State level tournament representing Trivandrum District\nState\nVineeth Roshan\nWon 1st prize (Rs 30,000/-) for intercollegiate band competition\n1\nst\nprize and Cash award of Rs 30,000\nState\nGanesh GS\nHonorary mention for PG thesis\nASCE Award\nASCE India Section Southern Region\nSonima A\nOutstanding UG thesis\nASCE Award\nASCE India Section Southern Region\nAnakha S\nAnanthaKrishnan U S\nBPL Football Tournament\nSecond prize\nUniversity\nNirmal Sabu Issac\nKTU A zone cricket Tournament\nThird prize\nUniversity\nSai Krishnan\nJavelin Throw\nSecond prize\nUniversity\nManu Jose Abraham\nInter college Dance\nFirst Prize\nUniversity\nSania B P\nBPL Cricket (Big Bash) Tournament\nSecond prize\nUniversity\nMohammed Roshan N\nFINANCIAL ASSISTANCE FOR INNOVATIVE STUDENT PROJECT BY APJKTU\nThe following student projects were funded by KTU for the academic year 2022-23\nProject by students of S8 CE (Aswin Asok, N Thanzeer, Arun Raj A, Nirmal Sabu Isaac ) “Development of Cement Treated Subbase (CTSB) Mix having Partial Replacement of Coarse Aggregates with Construction Demolition Waste for Optimum permeability and strength” Guided by Dr. Neethu Roy.\nProject by students of S8 CE (Arpitha R Nair, Asmidh N S, Ganga Gopan, Govind S P ) “Mitigation measures using Soil bioengineering in rainfall induced landslide prone areas” Guided by Dr. Jisha S V.\nProject by students of S8 CE (Devika Jose, Feba Ann Varughese, Navajith Sasi, Pallavi Premjith)  “Wastewater treatment combined with CO2 biofixation and biofuel production using indigenous microalgae” guided by Dr Jaya S V.\nDrishti 2K22 Tech Conclaveat\nAs part of Transportation and Development with K-Rail, a competition was conducted by K-Rail on\nDrishti 2K22 Tech Conclaveat\nat CET. From 30 entries 7 entries were shortlisted for the idea pitching/presentation round. Our team consists of Bharath B L, Rahul S, Roshni S Nair, and A P Prasanthi of S6 CE2 secured the first prize in the competition. They were guided by Dr. M Satyakumar (Professor, CED). Special acknowledgment to Mr. Sijo M Saji (Assistant Professor, CED) and Dr. Praveen P S (Assistant Professor, CED)\nAlumni Achievements\nAbey Boban Chacko (2005-2009 CE Batch) received Highly commended Sustainability Engineer Awards of the year at the CIBSE 6th Annual Awards, UAE on 30th October 2024\nMs.Vishnupriya Nair\nof 2018-2022 B.Tech civil Engineering Batch commissioned as\nLieutenant  in Indian Army\n(Short Service Commission Women Technical Entry Civil Engineering).\nName of the student\nAwards/Recognition\nMs.Vishnupriya Nair\n(2018-2022 B.Tech Batch)\nGot Selected for Short Service Commission Women Technical Entry(Civil Engineering) in Indian Army\nAnakha S\nAnanthaKrishnanan U S\nAshik S H\nAthulyaElzaMaju\n(2018-2022 B.Tech Batch)\nASCE India Section Southern Region for Outstanding UG thesis\nSonima R\n(2020-2022 M.Tech Batch)\nASCE India Section Southern Region Honorary mention for best PG thesis\nPaper publication\nPaper titled “Numerical Analysis of Fibre Reinforced White Topping Pavement Under Wheel Loading” authored by Dr. Jisha S V, Dr. M. Satyakumar and Remya Valsalan (M. Tech 2017-2019) published a full paper in the springer sponsored 6th Conference of the Transportation Research Group of India (CTRG-2021) organized by National Institute of Technology Tiruchirappalli, during 14 – 17 December, 2021.\nM Satyakumar (Professor, Department of Civil Engineering) and Ms. Aleena Seban (M.Tech 2017-2019), paper titled “Numerical Slosh Studies of Multiple Ring Baffles in a Semi-Cryogenic Fuel Tank” got published in ‘Advances in Structural Integrity’, pp. 321-328, 2022.\nPhD Admission\nGayathri D.S., M. Tech Structural Engineering (M. Tech 2017-2019) guided by Ms. Parvathy U., Assistant Professor, Department of Civil Engineering, got PhD admission in Kerala Technological University at College of Engineering Trivandrum under AICTE Doctoral Fellowship 2020-2021 Scheme.\nAwards\nMr. Thouzeef Hussain A (M. Tech 2017-2019 batch) CE department guided by Dr. Jayasree S received an award for outstanding thesis in the field of concrete – masters for the topic “flexural behaviour of prestressed fiber reinforced lightweight concrete beams”, at concrete day celebrations and ICI- UltraTech awards 2020, organized by Indian concrete institute and UltraTech cement Ltd.\nEr. Santhi Sara George MBCET alumni from CE department received outstanding young concrete engineer award from Indian concrete institute and Ultratech Cement Ltd. on concrete day celebration and ICI- UltraTech awards 2020.\nMr. Jyothis S, Alumni CE Department (2005 -2009 Batch) was awarded as the Best Engineer of the year by Institute of Engineers (India) Kerala state center on the occasion of the 54th Engineers Day\nVision\nTo be a Centre of Excellence in Civil Engineering education with a global perspective, creating ethically strong engineers for the service of society.\nMission\nTo provide Engineering Education which can create exemplary professional Civil Engineers of high ethics with strong conceptual foundation coupled with practical insight, to serve the industry and community.\nBoS\nThe People\nDAB\nFacilities\nNews & Events\nAchievements\nActivities\nFaculty Activities\nConferences\nResearch & Consultancy\nB. Tech PEOs, POs & PSOs\nPlacement\nCurriculum & Syllabus\nTime Table\nFormer HoDs"
}