{
    "filename": "mbcet.ac.in_faculty_dr-m-j-jayashree_.html",
    "content": "Dr. M. J. Jayashree – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAbout Us\n>\nDr. M. J. Jayashree\nEmployee Code / ID No.\n10402003\nQualifications\nBE, M.Tech., Ph.D\nOrcid ID\nhttps://orcid.org/0000-0003-4322-5560\nIndustry / R & D Experience\n—–\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9349338747/ 04712545868 – 504\nAreas of Interest / Current Research\nBio Signal and Image Processing, Assistive Technology\nResearch, Consultancy, Publications\nPublications\nDr M. J. Jayashree, “Administrative Audit for Quality Improvement in Higher Educational Institute (HEI) – an imperative component for Internal Quality Assurance of Autonomous Institutions” 15th National IQAC Conference (I-con) Revisiting Quality in Higher Education at Kristu Jayanti College Bengaluru, 17th March 2023.\nJayakumari. J, Jayashree M.J, Daniel C, Rohit Satheesan, Sandra Jeeva, Shamil Shamsudeen, Portable EEG data acquisition system for BCI applications, International Conference on IoT based Control Networks and Intelligent Systems (ICICNIS 2020) at St. Joseph’s College of Engineering and Technology, SSRN’s Research Paper Series, 20 Jan 2021\nSherin Sara Samuel, Advaid Chand Krishna, Dr. M J Jayashree, “Thyroid Monitoring Device”, International Journal of Research and Analytical Reviews (IJRAR), (E-ISSN 2348-1269, P- ISSN 2349-5138), Volume 7, Issue 3, August 2020.\nRemya M. M., Dr. M. J. Jayashree, “A Novel Method for Lung Module Classification”, International Journal of Electronics, Electrical and Computational System, ISSN 2348-117X, Volume 6, Issue 7, July 2017\nSanju Mathew, M. J. Jayashree, “Affordable bionic hand for forearm amputees” IOSR Journal of Electronics and Communication Engineering (IOSR-JECE), Volume 11, Issue 5,Ver II ( Sep-Oct 2016) pp 42-47.\nTina Joy Mathew, M. J. Jayashree “Super-Resolution MRI Reconstruction Using Compressed Sensing”, International Journal of Engineering Technology and Management (IJETM), Volume 3, Issue 4, Page No. 13-19, July-August: 2016.\nTina Joy Mathew, M. J. Jayashree, “Novel Sampling Approach for MRI Reconstruction using Dual Tree Double Density Discrete Complex Wavelets”, International Journal of Computer Science and information Security (IJCSIS), Volume 14, no.5, May 2016.\nTina Joy Mathew, M. J. Jayashree, “Compressed Sensing MRI Reconstruction Using Wavelets for High Performance”, International Journal of Scientific Research and Engineering Studies (IJSRES), Volume 3, Issue 4, April 2016.\nJoji John Varghese, Arun Krishna, Vivek Suresh kumar, M. J. Jayashree “UPASANA: Diagnostic Toolkit for ASHA Worker, Third International Conference on Control, Communication and Computing ICCC 2015, College of Engineering, Thiruvananthapuram, Nov 19 – 21, 2015 will be indexed in IEEE xplore.\nAnu J. Mohan, M.J. Jayashree “Detection of Diabetic Retinopathy”, International Research Journal of Computer Science (IRJCS) Volume2, Issue 10, pp 1-9, October, 2015.\nAnu J. Mohan, M.J. Jayashree “Detection of diabetic retinopathy using blood vessels”, International Journal of Engineering Research and Technology (IJERT) ISSN: 2278-0181, Vol. 4, Issue 09, pp 785-790, September-2015.\nAnu J. Mohan, M.J. Jayashree Techniques for the detection of blood vessels in diabetic retinopathy”, IOSR Journal of Computer Engineering (IOSR-JCE) e-ISSN: 2278-0661, p-ISSN: 2278-8727, Volume 17, Issue 4, pp 77-81, 1 (Jul.-Aug.2015).\nMerin Susan Philip, M. J. Jayashree, Satyabhushan Shukla, “Performance Evaluation of an Ultra Wideband Slot Antenna” IJEIT, Vol. 5, Issue 1, pp 27-30, July 2015.\nCharutha S., M J. Jayashree “An Effective Brain Tumor Detection By Integrating Multi Constrain Based Region Growing And Cellular Automata Edge Detection” has been presented in the “2014 International Conference on Signal and Speech Processing (ICSSP)” held at TKM College of Engineering, Kollam, Kerala on 21 August 2014, Chapter 54, Elsevier, Science::Technology.\nCharutha S., M. J. Jayashree “Brain Tumor Detection By Integrating Multi- Constrain Based Region Growing And Sobel Edge Detection”  has been presented in the “2014 International Conference on Current Techniques in Medical Image Analysis (CUTECMIA)”  at  Adishankara Institute of Engineering and Technology, Kalady, Kerala ,August 9, 2014, pp. 107-113\nCharutha S., M. .J. Jayashree “An Efficient Brain Tumor Detection By Integrating Modified Texture Based Region Growing And Cellular Automata Edge Detection” has been presented in the “2014 International Conference on Control, Instrumentation, Communication and Computational Technologies (ICCICCT)”  indexed in IEEE xplore , Noorul Islam University, Kumaracoil, Tamil Nadu, India, July 10- 11, 2014\nM.J. Jayashree, Prof (Dr.) A. Sukesh Kumar “Comparison of ECG Signal Compression Using Particle Swarm and Genetic Algorithm Optimized Neural Networks” is published in International. Journal of Applied Engineering Research (IJAER) ISSN 0973-4562 Volume 9, pp 10529-10539, November2014.\nM.J. Jayashree, Aju Sam Sunny, Anu John, Ashley Anna Sunny, Shruthi Susan “Smart Hospital Technology” is published in Health Informatics – An International Journal (HIIJ), ISSN: 2319-3190, Vol.3, No.3, pp 9-16, August 2014.\nCharutha S., M. J .Jayashree “An Integrated Brain Tumor Detection Technique” , International Journal of Research in Advent Technology (IJRAT), E-ISSN 2321-9637, Volume 2,No:5, pp 211-214, May 2014.\nM.J .Jayashree, Prof (Dr.) A. Sukesh Kumar “Display of ECG Signal in Android Mobile Phone from Personal Computer after Compression and Decompression”, European Journal of Scientific Research, ISSN 1450-216X/1450-202X, Volume 98, No2, pp :208-15, March 2013.\nM.J.Jayashree, Dr. A. SukeshKumar “An Improved Compression Scheme Using Particle Swarm Optimised Neural Network for ECG Signals”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering(IJAREEIE), ISSN No: 2320-3765  ,Vol. 2, Issue 1,pp 667-674,  January 2013.\nM.J.Jayashree, Prof (Dr.) A. Sukesh Kumar “Compression of ECG signal in personal computer, decompression in server and display in Android phone” Telemedicon 12, 8th International Conference ,Coimbatore, Tamil Nadu, India, Nov 29 – Dec 1,  2012.\nSherin Sebastian, Neethu Rachel Jacob, YeduManmadhan, Anand V.R., M.J.Jayashree “Remote patient monitoring system” International Journal of Distributed and Parallel Systems ISNN No 2229-3957(IJDPS) Vol.3, No.5, pp 99-110, September 2012.\nM.J.Jayashree, Prof (Dr.) A. Sukesh Kumar “Compression of ECG after baseline removal using Wavelet transform , Vector quantisation and PDLZW encoding” National conference on Emerging Technologies- 2012,Govt. engineering College, Barton Hill, Thiruvananthapuram, Kerala, India, July 20-21, 2012.\nM.J.Jayashree, Prof (Dr.) A. Sukesh Kumar ”Comparison of Neural Network Based ECG Signal Compression using Feed- Forward and cascade correlation Back Propagation networks” International Journal of Mobile and Adhoc Network  (IJMAN), ISSN (Print) 2249-202X, Vol2,issue 1,pp : 34-38, Feb 2012.\nAnupama Mary Thomas, Asiya Ashraf, LiniLal, Minju Jose Mathew , M.J Jayashree “Security enhancement using motion detection” International Conference on Signal Processing, Communication, Computing and Networking Technologies (ICSCCN), Indexed in IEEE explore.  NI college of Engineering, Thuckalay, 21-22 , July 2011.\nM.J.Jayashree, Prof (Dr.) A. Sukesh Kumar “Resourceful scheme of ECG compression using different Wavelet transforms and PDLZW method” 3rd International Conference on Electronics Computer Technology (ICECT 2011) Indexed in IEEE explore ,Kanyakumari, India, April 8 – 10, 2011.\nM.J.Jayashree, Prof (Dr.) A. Sukesh Kumar” Effectual compression of ECG using different Wavelet transforms,Vectorquantisation and PDLZW method” International Conference on Intelligent System and Data Processing (ICISD 2011) , G H Patel College of Engineering and Technology, VallabhVidyanagar, India, January 24-25, 2011.\nProf (Dr.) A. Sukesh Kumar, M.J.Jayashree, “ Comparison of lossy ECG signal compression and decompression algorithms” International Conference on Bioengineering (ICBE-2010) SRM university, Tamil Nadu, India, July  29- 31, 2010.\nProf (Dr.) A. Sukesh Kumar, M.J.Jayashree, “ECG transmission through PC”  National Conference (RAIN ’05)   Noorul Islam College of Engineering, Thuckalay,  March 2005,\nFunded Projects\nEye gaze controlled standing wheelchair – Funded by Centre for Engineering Research and Development (CERD)during 2025-Co-Principal Investigator-Rs 20,100/-\nStair case climbing gesture control motion wheelchair – Funded by Centre for Engineering Research and Development (CERD) during 2022– Principal Investigator – Rs 26,000/-\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n——\nAcademic / Professional Outreach Activities\nBoard of Studies member of Electronics and Biomedical Engineering of APJ Abdul Kalam Technological University (2021-2022 and 2022-2023).\nRoles in professional bodies or societies\nTreasurer of IEEE EMBS Kerala chapter from 2024-till date.\nChair of IEEE EMBS Women in Biomedical Engineering (WIBE), a Sub Organizational Unit of IEEE EMBS Kerala Chapter from 2023 – till date\nStudent Activities Chair of IEEE EMBS Kerala chapter from 2020-2024.\nDoctoral Committee Member\nServing as a Doctoral Committee member for three research scholars currently pursuing their Ph.D. under APJ Abdul Kalam Technological University.\nServed as a Doctoral Committee internal member for one research scholar.\nAlso serving as a Doctoral Committee member for four research scholars currently pursuing their Ph.D. under Anna University.\nConferences\nTPC Co-Chair\nof 2024 International Conference on Brain Computer Interface & Healthcare Technologies\n(\niCon-BCIHT)\nand chaired\ntwo sessions during 19-20 December 2024.\nFinancial Chair\nof IEEE International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022(IEEE SPICES 2022) 10 – 12 March,\nReviewer\nof Conference Papers – ETIS 2025, iCon-BCIHT,\nOrganizing Chair\nof International Conference on Communication Systems & Networks Jointly with University of Dayton, USA, 12 – 13 Dec 2019 (ComNet 2019).\nOrganizing Chair\nof ComNeT 2016 – an International Conference on Communication Systems and Networks.\nHead\nof Reception and Core committee of International Conference on Green Technologies (ICGT12) held during 18 -20, December 2012 in MBCET, jointly with University of Dayton, USA.\nResource Person\nOrientation session on “NAAC Criteria and the Accreditation Process” on 19-01-2024 to the faculty members of Marian Engineering College. Also had a discussion with IQAC core team and Management representatives.\nSession on ” NAAC Benchmarks for Affiliated Colleges” for the staff members of DMI ENGINEERING COLLEGE, Aralvaimozhi, Thovala, Kanyakumari District, Tamil Nadu on 16th August 2023.\nTalks on IEEE EMBS and its benefits during the inauguration of the Student Branch Chapters at MBCET, Musaliar College of Engineering, Chirayinkeezhu, Adi Shankara Institute of Engineering and Technology, Kalady and Sreechitra Thirunal, College of Engineering, Papapnamode, Thiruvananthapuram.\nPresented the Mission, Vision, Principles and Activities of IRCS and YRC during the Seminar on “Indian Red Cross Society (IRCS) and its Activities” to the MSW students of IGNOU on 8th February 2023 at IMA hall, Thiruvananthapuram.\nTalk on “Gender Equality today for a Sustainable tomorrow” as a part of International Women’s Day 2022 on 9th March 2022 at 11.30 am for the students of Sree Mookambika Institute of Dental Sciences.\nSuggestions for quality improvement were given to the staff members of Dept. of ECE, St. Xavier’s Catholic College of Engineering, Nagercoil on Dec 1st 2018.\nKeynote address on “India 20:20 – Inter School Quiz Competition” in Carmel Girls Higher Secondary School, Thycaud, Trivandrum on November 10th 2018.\nMembership in Professional bodies/ organizations\nLife member of Indian Society for Technical Education (ISTE)\nMember of Institution of Electrical and Electronics Engineers (IEEE)\nMember of  IEEE Engineering in Medicine and Biology Society (EMBS)\nFellow of Institution of Electronics and Telecommunication Engineers (IETE)\nLife member of Indian Red Cross Society (IRCS)\nCommunity Outreach Activities\nDistrict Committee member of Indian Red Cross Society and Joint Coordinator of Youth Red Cross (YRC) from 2021 –\ntill date.\nSpandanam (Social service wing of Dept. of ECE, MBCET) Activities.\nAwards / Distinctions / Rank / Other Achievements if any\nReceived the Special Recognition award, for her contributions towards building IEEE EMBS Kerala Chapter Student Community in exceeding goals and surpassing expectations. during the IEEE EMBS Kerala Chapter Annual General Meeting 2021.\nReceived the Dewang Mehta National Education Award for Best Professor in Electronics and Communication Engineering from Dr. R. L. Bhatia, Founder, World CSR Day & World Sustainability at Vivanta by Taj, Trivandrum on 20th January 2018\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}