{
    "filename": "mbcet.ac.in_faculty_ms-lekshmi-chandran-m_.html",
    "content": "Dr. Lekshmi Chandran M – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nCivil Engineering\n>\nDr. Lekshmi Chandran M\nEmployee Code / ID No.\n10112032\nQualifications\nMTech., Ph.D.\nOrcid ID\nhttps://orcid.org/0000-0001-6819-3935\nIndustry / R & D Experience\nTeaching -10yrs\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9496335333  (167)\nAreas of Interest / Current Research\nGround vibration ,Coir composites , Soil stabilisation\nResearch, Consultancy, Publication\nLekshmi chandran M, Sameer S (2019) ,” An Experimental study on iron based material:Ferrock” ,International Conference on Geotechnics for High Speed Corridors 25th and 26th July 2019, Thiruvananthapuram, India.\nLekshmi chandran M, Sameer S (2019) ,” Environmental Impact and Cost Analysis on Ferrock Paver Blocks” ,International Conference on Geotechnics for High Speed Corridors 25th and 26th July 2019, Thiruvananthapuram, India.\nJaya V., Lekshmi Chandran and Lakshmi Nandan (2016) , “Evaluation of Ground Vibration Isolation using In-Filled Coir- Latex Composite Trenches” Indian Geotechnical Society Chennai chapter, IGC 2016 December 15th-17th.\nLekshmi Chandran and Jaya V (2017) , “Numerical parametric study on Screening Effectiveness of Ground Vibration Isolation using coir composite trenches” International conference on Geotechniques for infrastructure projects GIP 2017.\nLekshmi Chandran, M., Jaya, V. & Balan, K. A Field Study Using Coir–Latex Composites as Wave Barriers for the attenuation of Ground Vibration. Indian Geotech J 54, 1511–1526 (2024). https://doi.org/10.1007/s40098-023-00828-y.\nLekshmi Chandran M, Jaya V. and Balan, K.(2023), “Laboratory Study of Vibration Isolation Performance of Needle Felt Coir Latex Composite (NFCLC) Trench Type Wave Barriers,&quot; SSRG International Journal of Civil Engineering, 10(7), pp 45-57. https://doi.org/10.14445/23488352/IJCE-V10I7P103.\nLekshmi Chandran M., Jaya V. and Balan, K.(2023), “Mitigation of Train-Induced Vibrations with Developed In-Filled Coir Composite Wave Barriers”, International Journal of Scientific &amp; Engineering Research, 14(7).\nLekshmi Chandran M., Jaya V. and Balan, K. (2024), “Effect of Poisson’s Ratio of Developed Coir Latex Composite”,International Conference on Sustainable Materials for Engineering Applications(ICSMEA 2024),IIT Madras, Chennai, India.\nLekshmi Chandran M., Jaya V. and Balan, K.(2023), “Sound Absorption Property of Coir Latex Composite using ImpedanceTube”, 8 th International Conference on Engineering Research and Innovations (ICERI-2023), Terna Engineering College.\nLekshmi Chandran M., JayaV. andBalan,K. (2022), “Effectiveness of Ground Vibration Isolation using Needle Felt Coir Latex Composite (NFCLC) Barriers: An Experimental Model Study, International Conference on Recent Developments in Civil Engineering, Motilal Nehru National Institute of Technology(MNNIT) Allahabad, Prayagraj,India.\nJaya V. and Lekshmi Chandran M. (2016),“Evaluation of Ground Vibration Isolation Using In-Filled Coir- Latex Composite Trenches,”Indian Geotechnical Conference. IIT Madras, Chennai, India.\nChandran, L.M., Iraniose, D.C., Thankachan, A.A. et al. Effect of Latex Content on Morphological Behaviour of Coir-Latex Composite. Mater Circ Econ 6, 41 (2024). https://doi.org/10.1007/s42824-024-00126-9.\nLekshmi Chandran, M., Jaya, V. & Balan, K. Effect of Poisson’s Ratio of Developed Coir Latex Composite. Mater Circ Econ 6, 42 (2024). https://doi.org/10.1007/s42824-024-00125-w.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\n—–\nMembership in Professional bodies/ organizations\nISTE\nCommunity Outreach Activities\nnil\nAwards / Distinctions / Rank / Other Achievements if any\n—–\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}