{
    "filename": "mbcet.ac.in_faculty-department_patrons_.html",
    "content": "Patrons – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHis Beatitude Moran Mor Cyril Baselios Catholicos, the first Major Archbishop of the Malankara Syrian Catholic Church\nestablished this Institution with a sublime objective namely, to provide quality technical education based on fundamental human values. To quote from the words of wisdom of the Late Major Archbishop His Beatitude Moran Mor Cyril Baselios Catholicos: “…. this Engineering College is meant to train and develop men and women of higher caliber equipped with the most modern scientific knowledge and technical skills destined not only to help our people in their march towards progress abut also to bring glory and honour to our people and our Country. True to its motto : “Duc In Altum “ Leading to the Heights of Excellence – the students of our College are to strive for excellence and skills and in pursuit of success in life, in terms of their commitment to bring happiness to our fellow beings and for the development of our Nation”.\nThe establishment and the astonishing progress of the College owe greatly to the vision and toil of His Beatitude Moran Mor Cyril Baselios Catholicos, the former Major Archbishop of Trivandrum. This College has been established with a sublime objective, namely to provide quality technical education based on fundamental human values. As the motto of the College ‘Duc In Altum’, very well depicts what we aim at is something more than the ordinary and the mediocre, without at the same time compromising on values. We wish to reach out to all sections of our society without the distinction of caste, creed, etc. In short, Mar Baselios College Of Engineering And Technology is envisaged to be a glowing example of the philosophy of education and the apostolate of human resource development which the Major Archdiocese of Trivandrum has been pursuing for the last Eight Decades. The Major Archdiocese has every reason to be proud of the quality and greatness of the service that this Institution is providing to the society and of its potential in radically transforming our society for a better tomorrow. We are sure, thousands of young men and women will come out of this Institution, fully equipped to contribute their valuable share in the great mission of Nation-building. My wish and prayer is that the College may live upto the great dreams of its Founders and be an agent of social transformation.\nRev. Fr. John Varghese Palanilkunnathil\nassumed charge as the New Director of our College on 19 March 2022. After securing Post Graduate Degree in Public Administration and Philosophy, B.Ed and M.Phil Degree, Fr. John has been serving in the field of Education as a Teacher and Administrator in various Institutions of the Major Archdiocese. He has travelled extensively in India and abroad on various missions\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}