{
    "filename": "mbcet.ac.in_departments_computer-science-engineering_news-events_.html",
    "content": "News & Events – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nComputer Science & Engineering\n>\nNews & Events\nNews & Events\nUpcoming Events\nPast Events\nANNOUNCING THE PRELIMS OF SMART INDIA HACKATHON 2024!\nICFOSS TECHVENTURE\nICFOSS is conducting Training & Hackathon programs on\nOpen IoT, Open Drone,\nand\nCyber Security\nduring March 2024. The objective of \"FOSS TechVenture\" is to inspire students to innovate, cultivate an entrepreneurial mindset, and gain practical knowledge in the rapidly evolving fields of IoT, Drones, and Cybersecurity. The selected participants from the program will have the opportunity to attend specialized training sessions in their chosen domains. Interested and eligible contestants who are attending the training program, will also have the opportunity to receive one year complimentary incubation support from ICFOSS. Last date for registration : 1st March 5:00 pm. Eligible students : EC, EEE, EL, CS, CT (S4, S6) Interested participants may apply here :\nhttps://forms.gle/E2piscunrKhRxTHR8\nDepartment of Computer Science & Engineering, MBCET is organizing a Five-Day Faculty Development Programme (Hybrid Mode) on Digital Forensics from 19th - 23rd February, 2024. Time: 9.30 am - 4.30 pm. The sessions will be handled by experts from CDAC, EY, VIT, RSET, and UST Global. Online Registration link:\nhttps://bit.ly/DigitalForensics2024\n. Online Registration closes on: 14th February 2024. E-Certificates will be provided! Faculty Coordinators:\nMs. Prathibha S. Nair, Ms. Vijitha Robinson,\nAP, CSE.\nSMART INDIA HACKATHON PRELIMS 2023\nThe Department of Computer Science and Engineering, in association with IEEE, CSI MBCET, IEDC & AI Open Labs is organizing the prelims of\n\"Smart India Hackathon 2023\"\non 23rd September 2023. Students can participate as a team of 6 members (atleast one should be a female candidate), choosing any sector of their interest from the specified sectors, for the 12-hour coding competition. The shortlisted teams will become eligible to participate in the Smart India Hackathon 2023. Faculty Coordinators: Ms. Vishagini.V., Ms. Dhanya.L. K.\nAgile and Software Testing Workshop\nDepartment of Computer Science and Engineering in association with CSI SB MBCET, Mar Baselios College of Engineering and Technology, Thiruvananthapuram is organising a 2 day workshop on\nAgile and Software Testing, An Industrial Approach\n- for S6 CSE BTech students.\nFaculty coordinators: Ms. Deepthi K Moorthy, Ms. Gauri Shree V K\nFLUTTER WORKSHOP\nDepartment of Computer Science and Engineering has organized a three-day workshop on “Flutter-the versatile cross-platform app” development tool from 17th to 19th April 2023. About 53 students from second and fourth semesters of various branches participated in the workshop. The classes were handled by Sera Mariam George, Amal Joe and Navaneeth (final year students of CSE). Students got an opportunity to learn new skills and grow their expertise in the technical world. Faculty Co-ordinator: Ms Anjali S.\nSUMMER CODING CAMP\nThe Department of Computer Science and Engineering in association with ACE, Mar Baselios College of Engineering and Technology organized a summer coding camp for school students. Thirty students from various schools in and around Thiruvananthapuram participated in the camp which started on 10th April 2023. The classes were managed by the faculty members of the college. Children got a chance to try the latest technologies like Arduino, Python and computer hardware. Classes ended on 14th April 2023. Faculty coordinators :Ms. Dhanya L. K., Ms. Prathibha S. Nair.\nThe Department of Computer Science and Engineering is organizing a 5-days “Summer Coding Camp on Python” for students of classes 7 to 10, from 2023 April 10-14. Coordinators: Ms. Prathibha S. Nair & Ms. Dhanya L. K, Asst. Professors, Dept. of CSE.\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nTechnical Fest, *HASH 2022*\nThe wait is over!\nThe day which you eagerly waited for has arrived. We cordially invite you to be a part of yet another technical fest, *HASH 2022* , the fest with exhilarating competitions, a platform to display skills, and a plethora of cutting-edge technologies, added with mindblowing events like idea presentations, project expo, and hackathon.\nFurther, the event is loaded with fun games like basketball shooting, pyramid, tech hunter, hoopla and much more\nNo time to waste! Head on and complete your registration on our website\n*_www.hashmbcet.tech_*\nGrab your tickets, fasten your belts and be ready for a technical adventure\nCOURSEATHON\nThe Department of Computer Science and Engineering, in association with CSI MBCET is organizing a micro skills course-making competition,\n“COURSEATHON”\n. Participants individually or as a team of 3 members, can choose any topic of their interest to create a short video tutorial. Content delivery, visuals, creativity, and methodological structuring of sub-topics would be considered as a part of the evaluation criteria. Submissions must be made on or before 10th August 2022. Faculty coordinator: Ms. Deepthi K Moorthy.\nCERTIFICATE COURSE IN ARTIFICIAL INTELLIGENCE AND MACHINE LEARNING\nDepartment of Computer Science and Engineering has started a certification program in\n\"Artificial Intelligence and Machine Learning\"\non 9th august 2022.First session was handled by Dr Tessy Mathew (HOD-CSE). This course aims to create a strong understanding and skill set on the topics needed before taking up any study on Artificial Intelligence, Machine Learning, and Deep Learning\nSmart India Hackathon PRELIMS 2022\n5 DAYS  ONLINE SHORT TERM TRAINING PROGRAMME ON \"HIGH-PERFORMANCE COMPUTING AND DEEP LEARNING FOR IMAGE AND TEXT ANALYSIS, SESSION-2”\nThe Department of Computer Science and Engineering, Mar Baselios College of Engineering and Technology is organizing an AICTE sponsored  5 days Online short-Term Training Programme on \"HIGH-PERFORMANCE COMPUTING AND DEEP LEARNING FOR IMAGE AND TEXT ANALYSIS SESSION-2\". The program is open to Faculty & Research Scholars of Engineering Colleges, Universities, and other allied disciplines. Industry persons working in the concerned/allied areas can also apply.  The STTP is scheduled for five days starting from 21.03.2022. There is no registration fee.  Participation in the program will be monitored on a regular basis and attendance is mandatory for issuing the certificate. Limited seats are available.\nFor any queries contact:\n[email protected]\nRegistration Link:\nclickhere\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nCareer Options after Engineering\nWebstination - 7 Day Web Development Bootcamp\nFDP on Android App using Kotlin\nINTRODUCTION TO PROGRAMMING FUNDAMENTALS\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nCareer opportunities on \"FOSS TECHNOLOGIES\"\nProject Build-A-Thon\nBuild Practical Skills through Hands-on Projects -\nclickhere\nNPTEL Special lecture  series\nNPTEL Special lecture  series\nDate\nTime\nTopic\nYou Tube Link\n17.7.2020\n6.00PM\nWhat to do in Covid 19 time? & An Introduction to Statistics and Artificial Intelligence\nhttps://youtu.be/AcuM_cAXw-4\n16.7.2020\n6.00PM\nAI in the New Digital Economy\nhttps://youtu.be/FMASzEH-2V8\n15.7.2020\n6:00 PM\nCyber Security of Critical Infrastructures\nhttps://youtu.be/3uxt5WeVCYg\n3.7.2020\n6.00PM\nCareers in Infosys through INFYTQ and HACKWITHINFY\nhttps://youtu.be/RLF2PX8TztQ\n1.7.2020\n7:00 PM\nWhat is depression and how to manage stress\nhttps://youtu.be/C0tb36B8kbg\n29.6.2020\n5.00 PM\nSocial Entrepreneurship Opportunities\nhttps://youtu.be/CqHIOWjn7Is\n28.6.2020\n6.00PM\nInnovating Education & Skills for Digital Economy\nhttps://youtu.be/cZIyzvWLZpA\n26.6.2020\n6.00PM\nThe Art and Science Behind Search Engines\nhttps://youtu.be/xmcgyDLL2CY\n23.6.2020\n5.00 PM\nAI and Data Science in the times of COVID\nhttps://youtu.be/ITuZ4JIfPls\nALUMNI TALK - Zero to One – About Entrepreneurship\nAlumni Group of Department of Computer Science and Engineering organized a talk on\n“Zero to One – About Entrepreneurship\n” on November 4th, 2020 from 10.00 am to 11.30 am. Mr. Fariq Noushad handled the session effectively. He is an alumni of MBCET family working as an Entrepreneur. He is the Cofounder and CEO of Greenikk Sustainable Ventures. He explained different opportunities as well as challenges faced to become an entrepreneur. Students became more interactive during question-answering session and they asked about the feasibility of Entrepreneurship. Around 150 students participated in the talk. Talk was coordinated and organized by Alumni coordinators\nQuick tips for a head start to the corporate world\nA webinar on\n“Quick tips for a head start to the corporate world”\nwas organized by Department of Computer Science and Engineering for final year students on 31/10/2020 from 10:00AM-11:30 AM. The session was handled by Ms. Dainu Kuruvilla, Associate Manager, Learning and development, Tata Elxsi,Trivandrum.\nTo view the Brochure\nclickhere\nIntroduction to Natural Language Processing\nFOSS CELL and NLP Research Group of Department of Computer Science and Engineering in association with ICFOSS organized a webinar on “Introduction to Natural Language Processing” on October 23rd, 2020. Dr Rajeev R R, Programme Head, International Centre for Free and Open source Software (ICFOSS) handled the session effectively. He is an Experienced faculty with a demonstrated history of working in the Information Technology and services industry, with total 15 years’ experience and having skills in Mathematical Modelling, Machine Learning, Natural Language Processing and Python.  He explained different applications in the area of Natural language processing and basic steps needed for the research in that area. Students became more interactive during question-answering session and they asked about the feasibility of project topics in the area of Natural Language Processing.\n60 students and some faculties participated in the webinar and attended assessment test after the webinar.45 students among the participants cleared assessment test and became eligible for certification. Webinar was hosted by ICFOSS on Moodle platform\nSummer Internship on Deep Learning\nAbout Internship\nThe Department of Computer Science Engineering at Mar Baselios College of Engineering and Technology is offering a summer internship for the students of the college. The internship will be for 4 weeks under the initiative of AI club. The internship starts on\n24th June 2019\nand ends on\n19th July 2019\n. During the 4 weeks internship, the students will be engaged on Machine Learning based or Deep Learning based project. In the first week, we will host a crash course to cover the basic concepts related to Machine Learning and Deep Learning. In the further weeks, the students will be engaged to work on an end-to-end Deep Learning project.\nThese are some of the broad areas on which you will pursue Deep Learning projects:\nObject Classification\nNatural Language Processing\nVideo Processing\nThe internship covers the following topics\nBasics of Python(Open CV), Basics of Machine Learning, Regression, Basics of Artificial Neural Network, Basics of Deep Neural Network, Reccurent Neural Network, Natural Language Processing, Autoencoders, Basics of Convolutional Neural Network, Transfer Learning, Basics of Video Processing\nSkill(s) required\n: Proficiency in at least one coding language is necessary. Python is highly preferred, but not mandatory.\nWho can apply\n: Interested students (S3, S5 and S7) of all branches. The amount for 4 weeks will be Rs. 3000.\nApplicants are required to fill in and submit the application form on or before 12 June 2019.\nPlease follow the registration link :\nclick here\nfor registration\nContact Numbers : Jesna Mohan – 9497467715\nRamjith R P – 9746314160\nEvading Social Engineering Attacks-COVID 19\nNetsec Research Group of Department of Computer Science and Engineering organized a webinar on\n“Evading Social Engineering Attacks-COVID 19\n” on July 21st, 2020. Mr. Shibin B Shaji and Mr. Mohammed Shine, Security Engineer, UST Global handled the session effectively. Both are experienced professionals in the field of cyber security and ethical hacking. They are winners of various security related hackathons. They explained different attacks with demonstrations in the area of security also gave a clear idea of how to secure ourselves from these attacks. Participants became more interactive during question-answering session and they asked about the feasibility of project topics in the area of cyber security. Around 80 students and some faculties participated in the webinar. The event was coordinated by M. DeviPriya V S.\nFor Brochure –\nclickhere\n2nd International Conference on Networks & Advances in Computational Technologies 2019\n2nd International Conference on Networks & Advances in Computational Technologies 2019, July 23-25 (NetAct 2019)\nWOMEN IN COMPUTING-NetACT19\nA panel discussion on the topic\n“Women in Computing “\nwas conducted as part of\n2\nnd\nInternational conference on Networks  & Advances in Computational Technologies.\nPanel Members were\nSmt (Dr.) B Valsa (Deputy Director, ISRO)\nSmt. (Dr.) DarsanaJosyula (Bowie University, USA)\nSmt. Manju B S   (IBS Pvt Limited, Technopark)\nSmt. Dainu Kuruvilla (Lifeskills Trainer, Tata Elxsi, Technopark)\nThe session was fruitful, where all  members shared thechallenges faced as women in their respective fields and  how they overcame them and succeeded in their career. They quoted their role models and motivation to succeed in life and also gave valuable take a way’s to become a successful woman engineer\nNATIONAL WORKSHOP ON ADVANCED DEEP LEARNING\nDeep Learning percolates into the various facets of technology. The technology enables computers to capture concept level features hidden in the input data. The methods based on deep learning have a significant impact in the performance of algorithms used for speech recognition, image and video processing, text analysis and medical image processing. This workshop aims towards promoting research, assist to educators and designers in the field of deep learning. The workshop sessions and hands-on will enable participants to understand the basics of deep learning and the various deep learning architectures. The sessions will be handled by eminent members from Bennett University.\nTHE PROGRAMME WILL COVER THE FOLLOWING TOPICS IN DETAIL AND HANDS-ON ON:\nHands On with Python\nBasics of Convolutional Neural Networks\nDeep Learning Techniques for Medical Image Processing\nIntroduction to Recurrent Neural Networks\nHands On with Tensorflow 2.0\nHands On with PyTorch\nUnsupervised Deep Learning\nDeep Generative Models: Autoencoders, Variational Autoencoders, GANs\nAdvanced Deep Learning Topics in CNN\nAdvanced Deep Learning Topics in RNN\nDeep Learning Model Optimization\nNeural Architecture Search (NAS): AutoML, Auto Keras, Multi-objective Approaches\nELIGIBILITY\nThis workshop is open to the faculty members from AICTE/UGC approved academic institutions, Research Scholars, IT Professionals and PG students.\nREGISTRATION FEE\nThe registration fee for participants including GST has been given below\nIndustry: 4000\nFaculty: 3500\nResearch Scholar and PG students : 3000\nSession Coverage –\nclick here\nWorkshop Brochure –\nclick here\nRegistration link –\nclick here\nEvent Timing:\nMay 20th – 22nd, 2019\nOrganized by:\nDepartment of Computer Science and Engineering\nVenue:\nMar Baselios College of Engineering and Technology, Thiruvananthapuram, Kerala\nMs. Jesna Mohan (Assistant Professor) Department of CSE MBCET  | Phone: 9497467715\nMr. Ramjith R P (Assistant Professor) Department of CSE MBCET | Phone: 9746314160\nEmail:\n[email protected]\nFaculty Achievements\nDr. Priya Mariam Raju\n, Assistant Professor, Dept. of CSE, received Google Cloud Career Launchpad Certificate for successfully facilitating students (S6 and S8) in Google Cloud Career Launchpad program at Mar Baselios College of Engineering and Technology from September 2024 to March 2025.\nMs. Poorna B.R(Assistant professor, CSED) received the best paper award for the paper titled “ Machine Learning Techniques for Healthcare Recommendation Systems”  at National Seminar on Transformative Innovations Shaping the AI-Driven Epoch , as part of 35\nth\nAnnual State Convention of ISTE Kerala Section held on 18th January 2025 at Marian Engineering College, Thiruvananthapuram.\nDESIGN PATENTS REGISTERED\nMs. Sreeja S. R.\n, Asst. Professor, Dept. of CSE secured Design Patent for her work on “\nSurround perception and Audio Assistant Device\n” (\nDesign No. 431786-001\n) on 25\nth\nNovember 2024. This is the second patent to her credit.\nDESIGN PATENT REGISTERED\nMs. Deepthi K. Moorthy\n(Asst. Professor, Dept. of CSE),\nMr. Shibin Shibu\n,\nMr. Gopal S.\n,\nMr. Ashwin A.\nand\nMr. Adithya Anil\n(2024 CSE Passout Batch) have secured a design patent registration for  “\nSmart energy forecasting and management Device\n”, on October 2024.\nWINNER OF ART OF TEACHING 3.0 COMPETITION\nDr. Merlin George\n, Assistant Professor, Department of Computer Science and Engineering, won first prize in the Art of Teaching 3.0 competition organized by µLearn.\nMs. Dhanya L.K.,\nAssistant Professor, Department of Computer Science and Engineering received -Best Institutional Knowledge Officer Award for Academic Year 2023-24 given by ICT Academy of Kerala.\nPhD AWARDED\nMs. Merlin George\n, Asst. Professor, Dept. of Computer Science & Engineering, has successfully defended her PhD thesis titled “\nPatient-Centric Healthcare using Blockchain Technology\n” and is awarded with Doctoral degree by NIT Calicut, on August 2024.\nMs. Sreeja S. R.\n(Asst. Professor, Dept. of CSE),\nMr. Allen Manu Philip\n,\nMr. Dilshan Dileep Shyni\n,\nMr. Manikandan B. Nair\nand\nMs. Medlyn Sairah Jacob\n(2024 CSE Passout Batch) have acquired a design registration in respect to the application of the design to “\nAssistive Device for the Visually Impaired\n”, on August 2024.\nDr. Tessy Mathew, Professor, CSED, has successfully completed the Artificial Intelligence Foundation Certification and the Artificial Intelligence Primer Certification by Infosys Springboard.\nMs. Sreeja S. R.\n, Asst. Professor, Department of Computer Science and Engineering served as reviewer for the Journal\n“Journal of Advances in Medicine and Medical Research”\n.The journal is indexed in US National Library of Medicine(NLM) Catalog ( NLM ID : 101711724),Index Copernicus(ICV:100.00), CNKI(China), Polish Ministry of Science and Higher Education etc. It is also included in Publons, a part of web of science group. Based on the review she has been nominated for the “Best Reviewer of the Month” award competition.\nMs. Sreeja S. R.\n, Assistant Professor, Dept. of CSE, chaired the session on “Mixed Reality in Surgery Planning” conducted as part of the Pulse Talks, organized by IEEE EMBS, on 14\nth\nDecember 2023.\nDr. Tessy Mathew\n, Professor, Dept. of CSE, participated in the “\nMachine Learning with Tensor Flow Bootcamp\n” organized by the ICT Academy of Kerala in association with Google for Developers India Edu Program on 18\nth\nNovember 2023.\nISTE Kerala Section Special Appreciation Award\nMs. Asha S.,\n(Associate Professor, Dept. of Computer Science and Engineering) is awarded the ISTE Kerala section Special Appreciation Award for her valuable contributions.\nDr. Priya Mariam Raju\nAssistant Professor, CSED got approval for Ph.D. guideship by the APJ Abdul Kalam Technological University (KTU), Thiruvananthapuram.\nDr. Tessy Mathew, Professor, Dept. of CSE got selected as the Management Committee member of Student Activity Council-Computer society of India.\nDr. Tessy Mathew, Professor, Dept of CSE, served as a reviewer in the International Conference on Power Instrumentation Control and Computing (PICC 2023) under the aegis of the 7\nth\nInternational Conference on Emerging Trends in Engineering, Science and Technology (ICETEST 2023) organized by Govt. Engineering College, Thrissur during 19-21 April 2023.\nDr. Jisha John, Associate Professor, Dept of CSE, served as a reviewer in the International Conference on Power Instrumentation Control and Computing (PICC 2023) under the aegis of the 7\nth\nInternational Conference on Emerging Trends in Engineering, Science and Technology (ICETEST 2023) organized by Govt. Engineering College, Thrissur during 19-21 April 2023.\nMs. Anne Dickson, Asst. Professor, Department of Computer Science and Engineering was awarded PhD in Computer Science & Engineering from the University of Kerala in the topic “\nOptimization of Intrusion Detection over false alerts using Swarm Intelligence\n“, from Research Centre, College of Engineering, Trivandrum under the guidance of Dr. Ciza Thomas (Vice Chancellor, KTU).\nDr. Jesna Mohan, Asst. Professor, Dept. of CSE, published a paper entitled “\nA Novel Light Weight CNN framework integrated with Marine Predator Optimization for the assessment of Tear Film-Lipid layer\n” in CMES-Computer Modelling in Engineering & Sciences Volume 136, Number 1, 2023. (SCI Expanded 2.027).\nMs. Anne Dickson, Assistant Professor, Dept. of CSE have successfully defended her  Doctoral Thesis titled “\nOPTIMIZATION OF INTRUSION DETECTION OVER FALSE ALERTS USING SWARM INTELLIGENCE\n”\nfrom\nCollege of Engineering, Trivandrum  ,\nKerala University\nunder the guidance of Dr. Ciza Thomas (Senior Joint Director, DTE , GoK & KTU Vice Chancellor)\non 3rd January 2023.\nMs. Anne Dickson, Assistant Professor, Dept. of CSE received the BEST PAPER AWARD  for the paper titled “Attack Detection Availing Feature Discretion Using Random Forest” , presented in the First International conference on Computational Paradigms  held at NIT-Thiruchirapally on December 9, 2022.\nDr. Shini Renjith, Assistant Professor, Department of Computer Science and Engineering got selected for the award of Chief Minister’s Nava Kerala Post Doctoral Fellowship for the proposal titled “An intelligent disaster forecasting framework using Deep Hybrid Learning for proactive identification of recurring natural disasters in the state of Kerala” under the category “Climate Change & Geological Studies”. This is the first edition of the prestigious Nava Kerala Post-Doctoral Fellowships scheme offered by Government of Kerala for meeting innovation and development needs of the state through promoting quality research spanning the sectors like social, economic, agriculture, development and industry. The names of the selected candidates are announced by Dr. R Bindu, Minister for Higher Education in a press meet on 26/04/2022.\nDr. Shini Renjith, Asst. Professor, Dept. of CSE, has been invited for a formal International Research Collaboration with the Information Processing Group (IPG) at the Oregon State University (OSU), Oregon, USA. The post-doctoral research work will be carried out in the IPG’s research interests in neural engineering along with the allied fields of Data Analytics, Information Retrieval, ML, DL etc.\nMs. Sreeja.S R, Assistant Professor, Department of Computer Science and Engineering, had won the best paper award for her work\n“Prediction of Parkinson’s Disease from Voice Signals Using Machine Learning”\n, presented in the 2 nd International Conference on Innovative Research in Engineering and Technology(ICIRET-2022), 15-16 th July  2022,Vietnam. The presented work will be published in the Scopus Indexed Journal.\nDr. Jesna Mohan\n, Assistant Professor, Department of CSE was the resource person for the AICTE sponsored 5 days Online Short-Term Training Programme on\n“HIGH-PERFORMANCE COMPUTING AND DEEP LEARNING FOR IMAGE AND TEXT ANALYSIS SESSION-2”\norganized by the Department of Computer Science and Engineering, Mar Baselios College of Engineering. The program was open to Faculty, Research Scholars of Engineering Colleges, Universities, and other allied disciplines and Industry persons.\nDr. Jesna Mohan\nand\nDr.  Shini Renjith\n, Asst. Professor, CSED, MBCET got approval for KTU research guideship.\nMr. Binu Jose A\nand\nMr. Shibu V.S,\nAsst. Professor, CSED, MBCET qualified UGC NET-2022.\nDr. Shini Renjith\n, Asst. Professor, Department of CSE, served as the session chair, for the magnificent talk session of the Weekly Talk series sponsored by the CSI Trivandrum Chapter on the topic “A Day in the life of a SOC Analyst”. The session was handled by Mr. Alex T from Royal Holloway, University of London on the 20th of January 2022.\nMr. Praveen GL, Mr. Shibu VS, Ms. Divya RS, Ms. Gayatri KS, Mr. Robin Joseph\nand\nMr. Ramjith RP, Assistant Professor, CSE\ngot selection for PhD Registration 2021-22 under APJ ABDUL KALAM TECHNOLOGICAL UNIVERSITY\nMs.Devipriya V.S\nis  nominated as one of the Evaluators for the Toycathon 2021, that is to be held from 22nd June 2021 to 24th June 2021 at KCG College of Technology.\nDr.Tessy Mathew\nhas served as Session chair  for the National Conference on Emerging Technologies in Smart Systems-NCETSS’21 organized by the Computer Science & Engineering Department of Marian Engineering College on 6th July 2021.\nMs. Jesna Mohan\nof Computer Science and Engineering Department was awarded Ph.D for her thesis entitled “Design and Development of Adaptive Framework for Video Abstraction using Machine Learning Techniques”, from the Department of Computer Science, University of Kerala under the supervision of Dr. Madhu S. Nair, Associate Professor, CUSAT.\nMr. Binu Jose A\ngot selection for PhD in Department of Computer Science and Engineering at NIT Calicut during Winter Semester 2020-21.\nMs. Dhanya L.K got\nselection for PhD in Department of Computer Application at Cochin University of Science and technology during Winter semester 2020-21.\nMs. Shini Renjith\nhas served as an Invited Reviewer in Elsevier Information Processing and Management Journal (SCI Expanded, Scopus).\nMs. Shini Renjith\nhas served as an Invited Reviewer in Springer Artificial Intelligence Review Journal (SCI Expanded, Scopus).\nMs. Shini Renjith\nhas served as an Invited Reviewer in World Scientific International Journal of Information Technology and Decision-Making Journal (SCI Expanded, Scopus).\nMs. Shini Renjith\nhas served as an Invited Reviewer in Acta Scientiarum – Technology Journal (SCI Expanded).\nThe papers entitled “Using Computer Vision to Detect Violation of Social Distancing” and “Augmented Reality Integrated Smart Math Solver” presented by\nMs. Poorna B.R\n, Assistant Professor, CSE have been selected as best papers of tracks “Inclusivity in Technical Education and Society” and “Effective Technologies in Education” respectively in the 31st Annual State Faculty Convention of the ISTE Kerala Section, on “Opportunities and Challenges in Technical Education in the Post-COVID Scenario” organized by Mar Baselios College of Engineering and Technology, on 23 January 2021, at Thiruvananthapuram in association with ISTE Kerala Section.\nDr.Jisha John, Dr.Jesna Mohan, Ms.Devi Priya V S, Ms.Shini Renjith\nwere selected as Evaluators of “TOYCATHON 2021”: a Hackathon to crowd source innovative ideas for the Toys and Games based on Bharatiya history, civilization, ethos, and culture,  launched by Shri Ramesh Pokhriyal ‘Nishank’, Hon’ble Minister of Education and Smt. Smriti Irani, Hon’ble Minister for Women and Child Development and Textiles. Toycathon 2021 is organized by the Innovation Cell, Ministry of Education with support of AICTE, Ministry of Education, Ministry of Women and Child Development, Ministry of Textiles, Ministry of MSME, Ministry of Commerce and Industry, Ministry of Information and Broadcasting.\nMr. Shibu V.S\ncleared the AWS Certified Cloud Practitioner Exam. The training was      conducted by AWS Academy in relation to ASAP, Govt. of Kerala.\nDr. Jisha John\nand\nMs. Shini Renjith\nhas served as an invited reviewer in ISTE Faculty Convention conducted on 23-01-2021.\nDr. Jisha John\nhas served as ISTE chair in ISTE Faculty Convention conducted on 23-01-2021.\nDr. Jisha John\nis nominated as the core member of the CSI Trivandrum Chapter student activities committee for the upcoming year\nPATENT CITATION – A technical paper published by\nMs. Shini Renjith\n, Asst. Professor, Dept. of CSE, titled ” An Integrated Framework to Recommend Personalized Retention Actions to Control B2C E-Commerce Customer Churn” as part of her research work, has been cited by a United States patent granted to Amazon Technologies, Inc., with Patent ID US10853867B1, during the month of Dec 2020\nDr.Tessy Mathew and Dr.Jisha John\ngot approval for KTU  research guideship.\nMs.Shini Renjith\nacted as a reviewer for the Elsevier Journal “Information Processing & Management” and contributed a review to the journal during August 2020.\nMs.Shini Renjith and Mr.Binu Jose A\nare recognized as the toppers of the online quiz conducted as a part of two day OFDP on RDBMS PostgreSQL organised by VIT University Chennai and IIT Bombay from 9\nth\nMay 2020 to 10\nth\nMay 2020.\nMs.Anne Dickson\nreceived best paper award for presenting a paper entitled “Improved PSO for optimizing the performance of IDS” in the International Conference on ISTA-2019 held at IIITM-K on December 2019\nDr. Jisha John\nhas participated in the Graduate Thesis Evaluation, a 7 minute competition conducted by IEEE Communication Society on 30\nth\nMarch 2019 at Bangalore.\nRobin Joseph\nqualified both GATE 2018 and NET 2018.\nDr. Jisha John was the session chair for “The Fourth International Symposium on Intelligent Systems Technologies and Applications (ISTA’18)”, September 19-22, 2018, Bangalore\nDr. Vishnukumar S\nwas the Technical Program Committee Member of 2018 International Conference on Network Engineering and Information Security(NEIS2018),April 20th – 22nd, 2018, Wuhan, China Wuhan, China.\nDr. Vishnukumar S\nhas been nominated as the International scientific committee Member of 2018 International Symposium on Power Electronics and Control Engineering (ISPECE 2018) December 28-30,2018 in Xi’an, China.\nDr. Vishnukumar S\nhas been nominated as the Reviewer, 2018 International Conference on Sensor Networks and Signal Processing (SNSP 2018) October 28-31, 2018, Xi`an University of Science and Technology, China.\nDr. Vishnukumar S\nhas been nominated as the Reviewer of the following International Journals:\nDigital Signal Processing, Elsevier.\nBiomedicine & Pharmacotherapy, Elsevier.\nOptics Communications, Elsevier.\nKSII Transactions on Internet and Information Systems\nJournal of Testing and Evaluation\nDr. Vishnukumar S\nwas the Award Jury Member, CSI-InApp National Student Project Awards 2018.\nMr. Praveen G L\nqualified National Eligibility Test (NET) 2018.\nMs. Jisha John\nhas been awarded PhD degree in Computer Science and Engineering from University of Kerala on her thesis entitled “Algorithmic Processing of Nanoscale and Microscale Images”.\nMs. Tessy Mathew\nhas been awarded the PhD degree in Computer Science and Engineering from Vellore Institute of Technology on her thesis “\nA new combined Moving Average indicator for Stock trading using Dynamic Neighborhood Cellular Automata”.\nMr. Vishnukumar S\nhas been awarded the Ph D degree in Computer Science and Engineering from University of Kerala on his thesis “An Investigation into Image Super-Resolution Algorithms”.\nDr. Vishnukumar S\ninaugurated the\n“National Workshop on the Basics of Computers”\norganized by Government Sanskrit College, Tripunithura with the financial assistance from the Directorate of Collegiate Education from 23\nrd\nto 29\nth\nOctober 2017.\nDr. Vishnukumar S\nhas been elected as the Chairman of Computer Society of India, Trivandrum Chapter.\nDr. Vishnukumar S\nhas been nominated as the Governing Body Member and Executive Committee Member of Kerala State IT Mission, Department of Information Technology, Government of Kerala.\nDr. Vishnukumar S\nwas the Award Jury Member of the 6\nth\nCSI-InApp National Student Project Awards 2017.\nMr. Shibu V S\ngot a\nClass A Merit certificate\nfor completing all the assigned tasks in Task Based Training(TBT-2017), during January 10,2017-April 5,2017 conducted as a part of Teacher Training through the e-Yantra Lab Setup Initiative(eLSI). He also got a completion certificate for completing the “\nTheme Valet Parking Robot”\nassigned in the TBT Challenge as a part of e-Yantra project.\nMr. VishnuKumar S\nhas been elected as the Vice Chairman of Computer Society of India,Trivandrum Chapter.\nStudent Achievements\nBEST PROJECT AWARD\nMs. Nandini Krishna R.S, Mr. Abhinav K, Mr. Ambu Bharath V Nair, and Mr. Adwaith S Jith from S6CS2 have won the BEST PROJECT AWARD in the Artificial Intelligence stream for their project titled “AI-Powered Waste Management System for Urban Environment” at SRISHTI 2025, held at Saintgits College of Engineering (Autonomous), Kottayam on February 24-25, 2025.\nFUNDED PROJECT\nMr. Ashish Mohan, Mr. Jabin James, Mr. Neil John and Mr. Ritvik Jesse secured APJAKTU -CERD – Financial Assistance to project “Hand Written Text to Braille Converter” guided by Dr. Neena Raj N. R. The project aims to address the accessibility needs of individuals with visual impairments by providing a reliable and efficient method for translating handwritten materials into Braille format.\nWINNERS OF\nASAP IDEA FEST\nMs. Diya Mathews, Ms. Sara Robin Baby, Ms. Nayana Anna Binu, Mr. EV Jishnu , S4 CS2 students secured  second prize for the ASAP idea fest, Monthly ideathon series- November edition.\nμLEARN MBCET: DECEMBER 2024 HIGHLIGHTS\nCongratulations to the Top XII Karma Hunters of 2024! These exceptional individuals have demonstrated remarkable dedication and innovation. Leading the way is Aparna G Raj (S6 CT), who set a new record with an incredible 21,270 Karma Points. Adding to the celebration, MBCET proudly claimed the top position on the Global Monthly Campus Leaderboard, achieving a staggering 1,59,040+ Karma Points in December. This milestone highlights the collective efforts and enthusiasm of our vibrant campus community.\nWINNERS OF HackArtiThon HACKATHON\nMr. Abhinav Dev,  Mr. Karthik Raj, Mr. Adarsh Udayakumar & Mr. Stevin Santosh Baby of S6 CS1 (Team: Bit by Bit) achieved first runner-up position and a cash award of ₹15000 for the Best Innovative Startup and Mr. Krishna Prasad of S6 CS2 & Ms. Aleena Shaji of S4 EC2 (Team: Deepam) won the Best Socially Committed Startup award and a cash prize of  ₹10,000 at the 24 hour HackArtiThon Hackathon hosted by Al-Ameen College, Cochin,  on 18th January 2025.\nDESIGN PATENT REGISTERED\nMs. Deepthi K. Moorthy\n(Asst. Professor, Dept. of CSE),\nMr. Shibin Shibu\n,\nMr. Gopal S.\n,\nMr. Ashwin A.\nand\nMr. Adithya Anil\n(2024 CSE Passout Batch) have secured a design patent registration for  “\nSmart energy forecasting and management Device\n”, on October 2024.\nAs part of the She space and She hub project of the Trivandrum Corporation,\nMr.Mohammed Anaz (S5 CS1)\n,\nMr. Rizwan Shajahan (S5 CS2)\n&\nMr. Adwaith S. Jith (S5 CS2)\nhave developed a\nbooking software\nand it was inaugurated by the Hon’ble minister of Kerala (Local Self Governments, Rural Development and Excise) ,\nSri. M. B. Rajesh\n, on 18th December 2024.\nSMART WASTE BIN PROJECT TEAM RECEIVED CSI INAPP GLOBAL AWARD\nThe student team from the Department of  CSE,\nMr. Bryan Bishi\n,\nMr. Abraham A V\nand\nMr. Jinz Varghese\nguided by\nMr. Praveen G. L.\n(Asst. Professor, Dept. of CSE) received the Best Project Award, a memento and cash award of 50K in the 13th CSI Inapp International Student Project Award ceremony held at Travancore Hall, Technopark on 20\nth\nNovember 2024.\nCSI INAPP  INTERNATIONAL STUDENT PROJECT AWARD\nThe student team from CSE department  – Bryan Bishi, Abraham A V and Jins Varghese bagged the First prize for CSI Inapp  International Student Project Award for their project entitled ” Smart Waste Bin”. Mr. Praveen GL, Assistant Professor, Department of Computer Science and Engineering guided the team. This was a 6-month long process that involved selecting the best projects from the 200+ projects.\nIDEATHON ON “ETHICAL AI” WINNERS\nMr. Yash Chhalotre (S5 EL) and Mr. Anand Pillai (S5 CS2 ) won the Second Prize  and Mr. Manuraj M S, Mr. Hanok Samuel Boban and Mr. Navin Tom Babu (S3 EL) won the Fourth Prize in the Ideathon on “Ethical AI” Conducted by Kerala University of Digital Science, Innovation and Technology in association with Mozilla Foundation.\nMs. Angel T. John\n,\nMs. Anna Biju Abraham\n,\nMr. Aravind J. L.\n,\nMs. Feba Mariam Jacob\nand\nMr. Sam Sudheer\n, final year students of the Department of Computer Science and Engineering got selection for four months internship at MERP Systems from August to November, 2024.\nMr. Sijo Ajay, S8 CS2 got selected as\nUST (SEMICON Vertical) Intern, after clearing the selection process.\nMr. Adithya Krishnan, Ms. Amulya kandathil, Mr. Deva Narayanan PK, Ms. Diya Sundeep, Mr. Johann Varghese, Mr. Melvin Joseph, Mr. Neil John, Ms. Nevia Sebastian, Mr. Prajwal PP, Ms. Rhydu V Ajith and Mr. Samuel John  of Sixth semester BTech Computer Science and Engineering have been selected for internship at Nissan Digital.\nINTERNSHIP AT NISSAN DIGITAL\nThe following students of Sixth semester BTech Computer Science and Engineering have been selected for internship at Nissan Digital. Mr. Prajwal PP, Ms. Rhydu V Ajith, Mr. Neil John, Mr. Deva Narayanan PK(CS2) and Mr. Melvin Joseph (CS1).\nGTECH MULEARN  INTERNS\nWe are immensely proud to share the news  that seven of our talented students have successfully secured internships in the intern hunt organized by\nGTech Mulearn\nfor the second quarter of the year. Pioneering the movement associated with MuLearn, Ms. Sona Ponnachen (S6 EC1) has successfully landed the role of MuLearn District Lead, Trivandrum. the additional internship roles obtained by our students are Ms. Maria Sara Raju (S6 EC1)- Operations Intern, Ms. Jyothsna P Nair (S4 CT) – Operations Intern, Mr. Agnivesh PS (S2 CS1) – Graphic & UI Design Intern, Ms.  Lekha R (S6 EC1) – Content Writer Intern, Mr. Niranj R (S2 CS2) – Graphic Design Intern and Mr. Chris Thomas (S2 CS2) – Graphic Design Intern.\nMs. Elza Sabu, Ms. Sara Robin Baby, Ms. Diya Mathews and Ms. Christy John Tharakan, from S2CSE attended the IEEE India Council IIT Guwahati campus Immersion Program2024 from 26\nth\nJune 2024 to 3\nrd\nJuly 2024.\nThe students of Mar Baselios College of Engineering and Technology got selected in the *Top 100 coders competition* organised by *Gtech Mulearn* in association with *Kerala Startup Mission.* During the hackathon, they developed their software  products and showcased them in the Huddle Global, India’s Largest Beach Startup Festival from 16 November 2023 to 18 November 2023. They have placed themselves within the top 20k rank globally in the HackerRank platform for competitive coding.The members are 1. Aditya S, S5EC2, 2. Amrithesh S, S5EC2 , 3. Prajwal Pramod, S5CS2, 4. Abel Louis Fernandez, S1 CT.\nA team consisting of Abhilash George(S5 CS2), Johann Joshua Knox(S5 CS2) and Ann Santhosh(S5 EC2) won second place at Dekathon 2.0, held at St Thomas College, Chengannur. They received 25,000/- cash prize as well as a fully sponsored one week internship at FabLab KSUM, Kochi.\nMr. Abhishek Raman R and Mr. Adithya Krishnan\nof S5 CS1 were selected by Hex20 for internship based on a test covering topics from Basic Electronics, Programming in C & SPACE.\nThe Start-Up by\nMr. Abhilash George\n(S5 CS2) and\nMs. Ann Santhosh\n(S5 EC2) won the “Best Startup Award” in ‘NOVA 2k23’ conducted by Don Bosco college on 9th November 2023.  The team has already won funding from the Young Innovators Program organised by KDISC.\nMs. Nikita Anna Ajith ( S4 CS1 ), Ms. Ann Santhosh (S4 EC2), Ms. Maushmi Rajesh( S4 CS2) and Mr. Abhilash George (S4 CS2)  have won the State Level competition of\nYoung Innovators Programme 4.0\n.\nMs. Nikita ( S4 CS1 ), Ms. Ann (S4 EC2), Ms. Maushmi( S4 CS2) and Mr. Abhilash (S4 CS2)  have won the District Level competition of\nYoung Innovators Programme 4.0\n. Two ideas from Mar Baselios College of Engineering and Technology got selected and the institution secured the sixth position among the District Level Winner Institutions – Thiruvananthapuram in the Young Innovators Programme 4.0.\nTOP CONTRIBUTOR AWARD\nMr. Salman Faariz , S7 CSE MBCET received the “\nTop Contributor Award\n” for his invaluable contributions towards\nμLearn\n.\nFUNDING FOR STUDENT  PROJECT\nThe student project proposal entitled ” Parkinson’s Hand Stabilization Device” by Mr. Steve Thomas (S6CS2), Mr. Michael George Thomas(S6CS2), Mr. Kevin George Bino (S6CS2), Ms. Meghna Lekshman (S6CS1) guided by Dr. Jisha John, Associate Professor & Head, Dept of CSE, MBCET got approval for a funding of\nRs 40,000/- from the Center of Excellence for Disability Studies for the year 2022-23.\nBest Academic Performance Award For Outgoing Students\n2022\nMs. Devika A Nair, Ms. Aparna Sreekumar (2018-2022 BTech CSE Batch) and Ms. Aparna Suresh Kalarikkal (2020 – 2022 MTech Batch) received the Best Academic Performance Award for Outgoing Students 2022.\nMr. Revand S. (S6 CS2) and team, won second prize in the hackathon “HACKATHENA”,  organized by the Computer Science and Engineering department and coordinated by the Computer Engineering Students Association (CESA) of Jyothi Engineering College, Thrissur.\nAnand Pillai (S2 CS2) participated in a Model United Nations (MUN) organized by TKM College of Engineering, Kollam from March 31 to April 2. Anand Pillai was awarded a Special Mention in All India Political Parties Meet (AIPPM).\nAkshita Venkatesan of S8 cs1 was awarded the Best Student award during the 21st Annual student convention of ISTE Kerala section held at GEC, Thrissur.\nAshwin Abraham, Bhavya Suseelan, Jesin Mathew, Sabarinath P presented paper titled “\nA study on meta verse in education\n” on 7th International Conference On Computing Methodologies and Communication (ICCMC 2023) online the paper will be published in IEEE XPLORE the project is being guided by Mr. Arun K, Assistant Professor, Dept. of CSE.\nInternship at Catalyca\nMs. Amrutha Lakshmi S., Ms. Abigail Muthirakalayail Binu, Mr. Anandhu SJ, Ms. Akshita Venkatesan, Mr. Benson BIju Varghese, Ms. Sharon Susan Xavier of S6 CSE got selected for Internship at Catalyca Pvt Ltd, a travel tech startup in technopark campus, Thiruvananthapuram . The students will get a chance to work with the  product team for a sprint, on PoC and DevOps areas.\nGHC student scholarship\nTo honor Grace Hopper’s legacy and inspire future generations of women in tech, Dr. Anita Borg and Dr. Telle Whitney founded Grace Hopper Celebration (GHC) in 1994. The AnitaB.org flagship event brings the research and career interests of women in computing to the forefront, and highlights the contributions of women to the tech world. This year Ms Varsha Renjith from S4 CS2 secured this scholarship from a strong group of applicants\nMs. Kesia Mary Joies\n(2018 – 2022 batch of CS1) was awarded the prestigious Baselian Award for the year 2022. The memento was presented to her at\nEXODOS\n– The course completion ceremony of 2018-2022 batch B.Tech students at Girideepam Convention Centre.\nSpecial Mention Award for Technological Contributions\nMr. Rahul Sunil\n(2018 – 2022 batch of CS1) received Special Mention Award for Technological Contributions\nBest Project Award sponsored by MBCETAA\nThe Best Project Award sponsored by MBCETAA was awarded to the project tilted“Autism Spectrum Disorder Detection System” done by Ms. Ajmi N S, Ms. Diya Ann George and Ms. Megha M B of S8 CS1 and the project titled “Traffic violation Data Security System” done by Mr. Fleming B Vinu, Mr. Aromal M, Mr. Arun Jiju Joseph and Mr. Sharan George Mammen of S8CS2.\nBest Project Award sponsored by Dept of CSE\nThe Best Project Award sponsored by Dept of CSE was awarded to the project tilted “Assistive Aid for Dyslexics”, done by Ms. Devika A Nair, Mr. Jeremy Dylan D’souza And Ms. Rita Elsa Thomas\nDepartment of CSE in association with ACE conducted an Anime Quiz- a quiz for all the anime fans on 8th February 2022. Harikrishnan R S from S7CS2 bagged first prize, Manu Jose Abraham (S1 CE) won Second and Sanjay SS(S3 EEE) won third prize.\nIEEE CS SBC MBCET has secured first prize in the Elever WebDez Task competition conducted by IEEE CS Kerala Chapter. It was an Inter SBC Monthly competition on Website Designing. A team of 9 students from CSE of the various semesters, led by Adinath Ajith Naik (S4 CS1), worked together to prepare the website and won the 1st prize. The other team members are Sarath R(S4CS1), Raef Nazir (S4CS1), Diya Mariam Biju (S4CS2), Sreelakshmi R (S2CS1), Theju CA (S4CS1), Fleming B Vinu (S7 CS2), Arun Jiju Joseph ( S7 CS2), Abhijith KP (S4CS1).The winning student branch chapter is awarded with ₹10000 cash prize\nAdvaith U\nof S7CS1 got selected as Regional Lead (India) in Friends of Figma, a community initiative by Figma Inc. to improve the collaboration and peer to peer learning among design enthusiasts. Advisors:\nMr. Shon J Das, Vinny Pious, Dhanya L K\nMr. Nathan Rolland, Ms. Aleena Elsa Thomas, Mr.  Hannah Abraham Jacob, Ms.  Muthulakshmi S, Mr.  Ashik Saleem, Mr.  HAFIZ MOHAMMED M, Mr.  Sharan George Mammen, Ms.LiyaPhilipose   of S7 CS2 and Mr. Rahul Sunil of s7 CS1 got selectedfor K-DISC’s FSD Scholarship for the academic year 21-22 Batch.\nThe students from our institution, Mr. Rahul Sunil, Ms. Kesia Mary Joies and Mr. Vishnu P Kumarwere selected for Internship at Microsoft interns in Field Data Technologies.Field Data Technologies (FDT) is a USA based non-profit organization that supports research, development and use of wireless smart devices for conservation.\nWINNERS OF Hac’KP 2021 – 5TH EDITION OF HACKATHON ORGANIZED BY KERALA POLICE\nRahul Sunil\n-S6 CSE,\nPaliyath S. Aju\n– S6 CSE and\nAjay John Abraham\n– S6 CS2, a team of students from MBCET developed the platform Grapnel, with an aim to deliver smart solutions focusing cybercrimes in the Dark Web. They received a prize money of Rs. 10 Lakhs\nNATIONAL STUDENT TECH TALK\nRiya P Mathew\nof S4 CSE delivered a talk on the topic” Chatbots- A bird’s eye view “in the 13th session of Padmabhushan FC KOHLI Commemorative National Student Tech Talk Series, Organized by CSI Trivandrum Chapter along with CSI SB LBS Institute of Technology for Women in partnership with Kerala Technological University and IEEE CS KERALA CHAPTER on 2\nnd\nSeptember, 2021\nMs.Kesia Mary Joies of S6 CSE\nsecured Grace Hooper  Celebration Student Scholarship Award 2021.\nMr.Ajay John Abraham,Mr.Paliyath S Aju and Mr.Rahul Sunil\nof S6 CSE got selected for the finals of Hac’KP-International online hackathon by Kerala Police.\nMr.Rahul Sunil and Ms.Kesia Mary Joies(S6 CS1)\ngot selected for an internship at TCS\nMs.Sanna Pramod  of S4 CS1\nhas been selected as Digital Marketing Intern in collaboration with Dieutek Developments.\nThe team consisting\nof Kesia Mary Joies(S5 CS1) and Rahul Sunil(S5 CS1)\nwon the first prize for their idea Bank Easy in the Christmas hackathon event  HackX  conducted by the Computer Society of IEEE NITC SB and IEEE NSSCE SB.\nMs. Meghna R Nair of S1 CS2\nand her team won the first prize at the 6 days Innodeate Bootcamp program held at IIT Palakkad from 20th January 2021 through 25th January 2021. The bootcamp introduced new software such as Sketchup using the arduino board and use design thinking skills to identify and solve problems. The teams were given assignment of finding a problem, interviewing who it affects and finally presenting a solution. Meghna’s team won this assignment and got a chance to present it at the closing ceremony along with a cash prize of 2000 per member. The workshop also had expert talks from delegates like Kris Gopalakrishnan and faculty from IITs.\nAswin S & Navya Zachariah (S5 CS1) won\nFirst Prize and\nB Raj Shankar Menon & Cyril Shiju (S5 CS1)\nwon second prize in the annual data structures coding competition held on 17/10/20 by CSI MBCET.\nThe Team Alpha Coders (\nRiya P Mathew, Jephin John, Ann Shiny, Hyareen Linda and Vaishakh R.S.\n) from\nS3 CS1\nwon the Second prize for the hackathon and the AI/ML track for their project Alphere, a distinctive approach to facilitate social distancing and fast track commuting details.\nThe Team MindCrusades (\nVarsha Renjith, C. Archana, Sandhra Sajeev, Sreya Mathew and Chris Dylan John\n) from\nS1 CS1\n, won the track prize in AR using echoAR, for their project Realta, a prototype to help upskill medical students on how to conduct themselves in this pandemic time.\nMs. Nudi Fathima\nof S1CS1 won the Robotics Quiz organised by IEEE.\nSTUDENT PROJECT APPROVED FOR CERD FUNDING\nThe student project “Identifying texting idiolects using transformer” guided by\nDr.Tessy Mathew\n(HOD and Associate Professor,CSE)has been approved for CERD funding.The team members are Bharath TU,Kavya Suresh,Sikha Shaji and Subalesh S of S8\nMs. Aleena Elsa Thomas of S6 CS\n,\nintern at MBCET Assistive Technology Internship 2019, and Student Mentor of MBCET Assistive Technology Internship 2020,enrolled for and successfully completed with A+ GRADE, two diploma courses in Learning Disabilities and Special Needs Education offered by British Learning, London\nJeffrey Roshan\nof S5 CS1 was awarded outstanding performance at the “24 hour 2-D Game Development Hackathon” held on 25\nth\nJuly 2020.\nB Raj Shankar Menon\nof S5CS1 secured Third position in Best Engineer conducted by IEEE Travancore Hub on 12/07/2020.\nRiya P Mathew, Deepak Mathews Koshy and Nagendran N of S3CS1\nreceived honory mention from 1\nst\nyear category for a virtual hackathon called HomeStack organised by IEEE CUSAT.\nAdwaith U(S5CS1)\nwas selected as Microsoft Learn Student Ambassador in     June2020.Heis also selected as the DSC Leads of Google Developer Community in August 2020.\nThe team consisting of\nAbhijeet C (S7CS1) ,Bharath T U( S7CS1),Rahul  Sunil(S5CS1) ,Kesia Mary Joies\n(S5CS1),Neha Sabu (S5EC1)\nwon All India competition “Cisco thingQbator” and got a prize money of  Rs. 40000.\nMBCET won first prize in EDEN 2.0 National Hackathon. Team members include Rajat Jose of S4CS1,Vignesh Murali of S4 CS1 and Rahul of S6 CS2.\nAbhijeet C, Bharath T U and Gautham Rajesh of S4 CS1 were selected as the top 5 finalists from the 150 teams for\neYantra Robotic competition eYRC’19\n.They secured second position in the final competition  held at IIT Bombay on 27\nth\nFebruary 2019.\nRehsma, Devi, Ajay Mohan, Amal Dev, Sreyas M Nair of S8 CS2 and NivedPriyadarsan of S6 CS2 won Special Achievement award in\nSmart India Hackathon\nat IIT Kharagpur on 2\nnd\nand 3\nrd\nMarch 2019.\nAthul C K, Savio Rajan of S6 CS1 paprticipated in\nthingQbator\nprogram conducted by Cisco at Amrita University.\nLekshmi A R won 1\nst\nprize in Idea Drafting competition held as part of World Women’s Day organized by ISTE MBCET Student’s Chapter.\nAiswaryaPadman G won 3\nrd\nprize in Idea Drafting competition held as part of World Women’s Day organized by ISTE MBCET Student’s Chapter.\nAthul C K and Amal Saju of S6 CS1 won 1\nst\nprize in CODE IT ’19 coding competition organized by Computer Society of India.\nNikhil Kurian and Sujith Thomas of S8 CS1 won 2\nnd\nprize in CODE IT ’19 coding competition organized by Computer Society of India.\nRahul Sunil of S2 CS1 attended a one day workshop on “Android Application Development” conducted by SANKET’19 at NIT, Calicut on 23\nrd\nFebruary 2019.\nAmal Dev of S8 CS2 won 1\nst\nprize in Drishti coding competition at CET campus on 25\nth\nJanuary 2019.\nReshma and Devi of S7 CS2 won Startup Yatra – Hero of the Bootcamp award on 26\nth\nand 27\nth\nNovember 2018\nAbhishek S R, Amal Dev, Varsha Ann Abraham and Anju S S\nof S7CS2 won 1st prize in Hackathon conducted by Google Development Group in association with SCT College of Engg. in cutaway.\nAnju S S\nof S7CS2 is chosen as the Infosys Campus Ambassador. She also got the chance to give a talk at tedx platform.\nNadeem Sajjad and Joan\nof S5CS2 won 1st prize in “Ragam”-NIT Calicut, Bartonhill, College of Engineering, Pathanamthitta.\nNadeem Sajjad and Joan\nof S5CS2 won 2nd  prize in “Dhwani”-CET, Ivanofest, YagnaDhruva.\nNived Priyadarshan\nof S5CS2 was the Distrcit Level and  South Zone winner and State Level Runner Up of the event “ Mobile Robotics” in India Skills Kerala-2018.\nNived Priyadarshan\nof S5CS2 won third place in National Level World Skills India-2018.\nVaishak Ramachandran\nof S5CS2 won first prize in “DCODZ”-CET and third prize in “Web Wizard”-SCT and first prize in coding fest held at Mar Baselios College of Engineering and Technology.\nNeeraj Nair\nof S3CS1 won 1st prize in SCT Reventon.\nBharath T U\nof S3CS1won 3rd prize in SCT Roborace.\nNeeraj Nair\nof S3CS1won 1st place for KTU Netball Championship.\nRoshini susan Regi\nof S3CS1 won 4th place in KTU Basketball Tournament. She is into KTU netball team National level.\nJoel Mathew\nof S3CS1 won 1st prize in Basketball tournament held at Mohandas College of Engineering, 3rd prize in Basketball tournament held at MBCET and 1st prize Basketball tournament held at Saintgits College.\nARVIND S PANICKER, ARFAN A, ARUN SANKAR, AKHIL J P and AMAL VIJAYAN\nof S8CS1 got fourth position and chosen for the IATA NDC Hackathon in Kochi.\nVishnu and Mahesh Markose\nof S8CS2 secured second position in debugging event on Drishti 2018 held at College of Engineering, Trivandrum.\nAchu Vinod Thomas, Adeline Anne Mathew, Aleena Rachel Varghese, Greshma Liz George,Gincy George and Golda Mary Varghese\n(S8CS1) won second prize in Kerala University Netball Tournament held at MBCET.\nAlan Davis Babu and Ashish A John\nwon first prize in All India Netball Tournament held at MBCET.\nAlan Davis Babu, Ashish A John and Athul Krishnan\nwon second prize in Kerala University Basketball Tournament held at MBCET.\nAlan Davis Babu, Abhishek Krishnan, Ashish A John and Mahesh Markose\nwon second prize in Kerala University Netball Tournament held at MBCET.\nAlan Davis Babu and Greshma Santhosh\ngot chosen to the National netball team.\nAtheena J P, Divya B M,Anu V P,Archana S G and Ashna Anne Philip\nwon second prize in Kerala University Inter collegiate chess tournament on December 2017.\nAmith Hari, Neeraj Nair, Githin Thomas George,Aparna K, Mekha Nair C.A , Roshni Susan Regi\nparticipated and got prizes in APJ AKTU All Kerala Inter-Zone Netball Men and Women Championship, February 2018.\nArun Krishna, Anita Acha George, Toney Dias, Asheena Varghese received “\nSpecial Jury Award”\nin the\n6\nth\nCSI InAPP National Student Project Awards 2017\nfor the project titled ”\nGOLDEN AID-An Emergency Ambulance System”\nunder the guidance of Ms. Divya R S.\nNibin peter, akhil A, Akhil R and Satyajith S L has secured\n“Best Project Award”\nfor the project titled\n“Secure IOT protocol”\nin the B-Tech Project Exhibition at MBCET,\nTECXPO’17\nunder the guidance of Ms.Gayathri K S.\nGreshma Liz George (S7CS1) won first prize in Kerala University Netball Tournament held at MBCET.\nAmal Vijayan(S7CS1) and team won first prize in Kolkali for Kerala University Kalolsavam-2017.\nMerlin (S5CS2) participated in Kerala University Basketball Tournament held at MBCET.\nAryaputhran G S of S5CS2 participated in a two days workshop on “Vision Robotics” organized by ROBOTech Labs.\nAryaputhran, Vaishak, Sreejishnu, Aswathi and Anju of S5CS2 participated in workshop on “Touch and Augmented Reality”at NIT.\nVishak, Sreyas, Kavya and Sreejishnu of S5CS2 participated in workshop on “Full Stack Development”.\nAnagha (S5CS2) participated in workshop on “Internet of Things” on Trivandrum Hub Meet.\nAbhijith S(S8CS2), Niraj Nirmal(S8CS1), Alisha Baji(S8CS2), Anjana Ann George(S8CS1) and Sneha Kurian(S8CS2) got placed in MICROSOFT with a salary estimate of around 10 lakhs per annum.The students were honored by the department for their outstanding achievement on a function held on 10/11/2016.\nThomas S Thelly, A.Blesswin Samuel, Kenny John Jacob, Francis Johny and Ashish Mammen Georgi of S8CS won the 5th National Level CSI-InApp Award for the best student project with a cash prize of Rs.50000 for developing the software application ” Data Harvestor-Healthcare Research Trend Finder” under the guidance of Mr.Biju B Varghese, instituted by Computer Society of India (CSI) Trivandrum Chapter in association with InApp.\nThomas S Thelly got placed in UBER with a salary estimate of around 15 lakhs per annum.\nKiranMohan(S8CS2), AkhilRamesh(S8CS1),MrinalKrishnan(S8CS1) and Niraj Nirmal(S8CS1) developed a well- researched technology solution in support of a noble cause in Healthcare, and received a Special Award of Rs. 40,000 for their noble solution in “HackD- Code For A Cause” organized by Envestnet India.\nGeorge T Kurian (S6CS1) and Bony Cherian(S6CS1) became the semifinalists in the “108 Emergency Services Hackathon” conducted by IIT Madras on December 2016.\nFrancis Johny of S8CS won “TOP 25″ with a Cash prize of Rs.  1  lakh and the Title  of  “IT  Genius  of  India”  in the IT  Olympiad ”A  Multilayer  Examination  and  Mega Quiz Contest  By  Computer  Society  of  India  and  Rotary  Club  of  Pune  Pride  on  a  National Level  from  11th February to 27th February, 2016.\nAlumni Achievements\nMr. Amal Joe of  CSE(2019-2023 batch) got admission for MTech in Computer Science and Engineering at IIT Bombay.\nMr. Samuel Punnoose John\n(CSE Alumni 2013-2017) joined Apple Inc. as System Design Engineer at San Diego, California.\nMs. Anjali Bhavana\n(Alumna of 2007 -2011 batch) of Department of Computer Science and\nEngineering secured 94\nth\nrank in the Indian Forest Service Examination-2022.\nMs. Nayana Josan\n(Alumna of 2014 -2018 batch ) of Department of Computer Science &  Engineering bagged the prestigious trophy of  “\nDancing Stars”\n, a celebrity dance reality show conducted in Asianet television channel .\nVision\nTo be a Centre of Excellence in Computer Science and Engineering providing quality education and research for the betterment of the society.\nMission\nTo impart sound knowledge in theoretical and applied foundations of Computer Science and Engineering, and to train the students to solve real life issues to effectively define and shape life.\nBoS\nThe People\nDepartment Advisory Board\nFacilities\nNews & Events\nWorkshops & Seminars\nResearch and Consultancy\nPlacements\nActivities\nVideo Lectures\nB. Tech PEOs POs & PSOs\nSyllabus\nTime Table\nCSE Blog\nFormer HoDs"
}