{
    "filename": "mbcet.ac.in_resources_cells-and-groups_.html",
    "content": "Cells and Groups – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nResources\n>\nCells and Groups\nCells and Groups\nEnvironment Management Cell\nThe Institute has a Environment Management Cell that facilitates the smooth functioning of the three cells namely Waste Management cell, water management cell, Energy management cell  under the umbrella of\nEnvironment Management Cell.\nThe cell periodically conducts / monitors :\n1)Green /Environment Audits\n2) Activities of 3 cells\n3) Encourage various initiatives to inculcate environment consciousness through innovative practices\nPolicy statement\nMBCET avows to protect the Environment by maintaining a Green, Eco-friendly campus, and by creating an awareness among it’s stakeholders both as individuals and members of the society, so as to contribute to making the earth, our common home, a sure haven and a comfortable abode for the posterity.\nFaculty Coordinator: Dr. Nidhi MB, Associate Professor, MED, MBCET\nWorld Environment Day-2025 Report\nWaste Management Cell\nAs an initiative towards proper waste management the Environmental Cell of MBCET along with Waste Management Cell conducted a talk on “Awareness on Solid Waste Management” on 20 December 2023 for the house keeping staff and faculty and students of sustainability cell.  The speaker of the session was Mr. Pratheesh M V, Project Coordinator, Green Worms Pvt Ltd. P. He gave deep insights on solid waste segregation, converting plastic waste to useful plastic, earning from waste and agencies for waste collection. The talk was coordinated by Dr. Nidhi M B, Coordinator Environmental Cell and Dr. Soumya A V, Coordinator, Waste Management Cell.\nThe Institute has a Waste Management Cell that facilitates the smooth functioning of the various types of wastes generated in the premises through effective Waste Management and sustainable practices in converting Waste to resource. Regular monitoring, conduct of awareness sessions for the stakeholders, encouraging innovative ideas and projects towards efficient disposal of waste are undertaken by the cell and various departments as when required.\nFaculty Coordinator\n: Ms. Soumya A V, Assistant Professor, EED.\nActivities of the cell 2023-24\nActivities of the cell 2022-23\nActivities of the cell 2021-22\nAssistive Technology\nWATER MANAGEMENT CELL\nEffective water management is essential for sustainable development and the preservation of natural resources. The\nWater Management Cell\nof our institution is dedicated to implementing and promoting efficient water usage practices, ensuring resource conservation, and fostering environmental responsibility.\nWater Management Cell, MBCET was constituted with the following objectives to achieve.\nOBJECTIVES:\nTo ensure proper maintenance of the water bodies and water distribution system of the Campus\nTo monitor the availability of adequate, good quality water in the Campus\nTo assist in the process of adopting Scientific Strategies for Water Conservation in the Campus.\nTo spread awareness about Water Conservation and Management to all students,faculty and staff members of the Campus by placing display boards, conducting seminars, competitions etc.\nKey Initiatives\nRainwater Harvesting\n: Installation of systems to capture and utilize rainwater, reducing dependency on external water sources.\nWater Recycling\n: Establishment of wastewater treatment plants for recycling and reusing water within the campus.\nLeakage Detection and Maintenance\n: Regular audits to identify and repair leaks promptly, minimizing water wastage.\nEfficient Irrigation\n: Adoption of drip and sprinkler systems to optimize water usage in landscaping and green spaces.\nAwareness Campaigns\n: Hosting workshops, seminars, and awareness drives on water conservation for students and staff.\nThe Water Management Cell ensures the responsible use of water resources, contributes to environmental conservation, and sets an example for sustainable practices. These efforts align with global sustainability goals and help our institution maintain a balance between growth and ecological stewardship.\nWe are committed to fostering a culture of responsibility and accountability in water management, ensuring a greener future for generations to come.\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nActivities\nNational Service Scheme(NSS)\nIn an age when relationships between individuals and organizations are getting more & more complex, it is not enough only to have an excellent academic record. Being good at number crunching and scoring high marks in subjects are not the only criteria for success in professional or personal life. The ability to deal with ones feelings and understand the feelings of others in any given situation helps one to complement knowledge with human values.\nNSS activities are imparted to fine tune the students\nattitudes, values, beliefs, motivation desires, feelings, eagerness to learn,\nwillingness to share and embrace new ideas, goal orientation, flexibility,\npersuasion, futuristic thinking, compassion, and various skill sets of communication,\netiquette and manners so that they\nNSS activities helps students will be able to\ndeal with different situations responsibility,\nStrengthen the student from within.\nRead More\nUniversal Human Values(UHV) Cell\nAs per the direction  from AICTE, every  College  affiliated to AICTE  is required to set up  Universal Human Values(UHV) Cell at College Level. As per the AICTE reference document,G911 UHV Cell, Nodal.\nRead More\nUnnat Bharat Abhiyan (UBA)\nUnnat Bharat Abhiyan (UBA) is a flagship programme of Ministry of Human Resource Development (MHRD), Govt. of India. It is a scheme for selected Higher educational Institutions (HEIs) of the country where they adopt villages for their development. Faculty and students are involved in village development plan in collaboration with district administration.\nRead More\nAnti-Narcotic Cell\nAnti-Narcotic Cell is committed to creating and maintaining a campus environment that is free of alcohol and substance abuse. It is an active body comprising of teachers and student representatives aiming at making the institution a peaceful and progressive campus, free of any abuse of alcohol or other narcotic substance\nThe activities of anti-narcotic cell include organizing awareness programmes with the aid of government organizations, arranging campaigns, conducting seminars etc. The cell also monitors the entire campus to make sure its mission is executed in the right way.\nWe keep close contact with the excise and police departments and arrange programs to make the students aware of the strong legal force working against narcotics. The club supports the proactive interventions by Government, NGOs, De-addiction centres etc. for a drug free world.\nInstitute Innovation Council (IIC)\nRead More\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}