{
    "filename": "mbcet.ac.in_departments_electronics-communication-engineering_conferences-organized_.html",
    "content": "Conferences – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nDepartments\n>\nElectronics & Communication Engineering\n>\nConferences\nConferences\nIEEE INTERNATIONAL CONFERENCE ON SIGNAL PROCESSING, INFORMATICS, COMMUNICATION AND ENERGY SYSTEMS 2022 (IEEE SPICES 2022) 10 – 12 MARCH, 2022\nThe IEEE International Conference on ‘Signal Processing, Informatics, Communication and Energy Systems (IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology, Trivandrum and the IEEE Kerala Section in association with Bowie State University, USA and the College Alumni Association (MBCETAA) was held during 10-12 March, 2022. In association with the conference, a press meet was held at Trivandrum Press Club on 08 March, 2022. The theme of the conference was “Smart Systems for Sustainable Development and Social Welfare” and it provided a platform for technical exchange amongst researchers from academia, research laboratories, and industries in various emerging fields of Signal Processing, Communication, Computer Science, Energy Systems, Instrumentation & Control Systems, Robotics and Smart Cities and so on. The technical program included Tutorial Sessions by experts, keynote lectures, plenary talks, regular technical sessions, and special invited sessions.\nOn 10 March 2022, three tutorial sessions were conducted as part of this conference. First session was led by Dr. V. R. Jisha, Professor (Dept. of Electrical Engineering, College of Engineering, Trivandrum), and second session by Prof. (Dr.) Bhim Singh, CEA Chair Professor, Dept. of Electrical Engineering, IIT Delhi. Dr. Darsana P. Josyula, Professor, Dept. of Computer Science, Bowie state University, USA, delivered the third tutorial session.\ninaugUral function\nThe inaugural ceremony of the three-day Conference on SIGNAL PROCESSING, INFORMATICS, COMMUNICATION AND ENERGY SYSTEMS 2022 commenced with the lighting of lamp by a group of dignitaries. Dr, Rajasree M.S, Vice-Chancellor, APJ Abdul Kalam Technolgical University inaugurated the three-day Conference in the presence Mr. Sreekumar V (Centre Head, Tata Elxsi Limited, Technopark Campus, Trivandrum), Dr. Mini Ulanat, (Professor of CUSAT and Chair, IEEE Kerala Section.), Prof Dr Jijimon K Thomas, (Principal, Mar Ivanios College), Rev Fr John Vilayil, (College Bursar), Dr. Abraham T Mathew (General Chair, IEEE Spices 2022 and Principal, MBCET), Dr. S Viswanatha Rao(Vice Principal and Dean (Academic Affairs- UG), MBCET)and Dr. Jayakumari J (Organizing Chair, IEEE Spices 2022, Head of ECE, MBCET),\nDr.Jayakumari.J formally welcomed all the dignitaries present on the dais and participants from various parts of the country, colleagues & students. Dr. Abraham T Mathew briefed about the importance of the conference theme and the significance and impact of sustainability in today’s world.\nDr. Mini Ulanat gave the presidential address. She quoted on various opportunities provided by the IEEE kerala section. “Kerala section is known for its activities in the humanitarian sector. In fact, the special interest group for humanitarian activities had its start from Kerala, after the work done by the volunteers post tsunami.There are a lot of opportunities for volunteers and many of the volunteers are making use of it – we are giving back to society. This is the right time because we are the elite group who are having the facility to enjoy wgat higher education can give. Now is the time to give back to society. ”\nDr. Rajasree M. S. gave the inaugural address. She connected this year’s theme “Smart Systems for Sustainable Development and Social Welfare” with the acronym SPICES: “The speciality of spices is that the right combination of spices makes things precise and very accurate. We know that one of the main aspects of smart systems is cyber-physical systems, which over the years have transformed the way systems are engineered, as the internet has transformed our lives. They integrate sensing, computation, control and networking into physical systems and infrastructure, creating them and connecting them to the internet and also to one another. This has to be made a reality for a sustainable future.” She also mentioned “Sustainability is all about making systems engineered by integrating smartness into the system making them meaningful in the context in which they are, and enable them to achieve the quality parameters with which they should perform. This can be applied to transportation, energy systems, healthcare, also to address natural calamities.”\nMr. Sreekumar V lauded the initiatives of the college over the years in inculcating the right kind of engineering and technology aptitude among young engineers in the state. He spoke about how Tataelxsi has been associating with academia and pitching in to help students become more employable into the corporate world.  He added “I congratulate IEEE and the conference organisers for choosing this theme for this year’s conference event. Wishing the SPICES conference to be a huge success.”\nRev. Fr. John Vilayil, Bursar, MBCET honored the guests. Dr. S Viswanatha Rao and Prof Dr Jijimon K Thomas briefed about the importance of the topic and our esteemed resource persons. They wished for the success of the conference and inspired the everyone to actively participate in the conference to get benefited.\nDr. Bijoy A Jose, Secretary, IEEE Kerala Section extended the vote of thanks and expressed his gratitude to one and all for gracing the occasion.\nValedictory function\nThe IEEE SPICES 2022 came to an end in the evening of March 12, 2022. Altogether 104 papers were presented in this mega-event, of which 2 delegates were from outside India, 9 delegates are from industry and 94 are from academia including research scholars, faculty and UG/PG students. Arrangements were made for both ONLINE and OFFLINE presentations. The conference had eight technical sessions on 8 different themes along with project expo by the students. There were 3 plenary speakers and 5 keynote speakers.\nAs a gesture to mark the end of successful completion of three days international conference and to felicitate authors and participants for successful submission and presentation of their innovative ideas, the Valedictory function was held at Visvesvaraya Hall of the College.                        Dr. Abraham T Mathew (General Chair, IEEE Spices 2022 and Principal, MBCET), welcomed the august gathering. He also congratulated all the participants. Sir also appreciated the hard work done by individual staffs for the conference.\nDr. Jayakumari J (Organizing Chair, IEEE Spices 2022, Head of ECE, MBCET)) placed the technical report of the Conference. She summarized on the number of papers received, the review process,pre conference tutorials, keynote sessions and tracks  held from 10\nth\nto 12\nth\nMarch 2022. She also pointed out that the proceeding will be published as a permanent reference for authors in IEEE Xplore. Rev. Fr. John Vilayil, Bursar, MBCET honoured the guests.\nThe Chief Guest of the valedictory function was Rt. Rev. Msgr. Dr. Mathew Manakarakkavil Corepiscopo, Member, Governing Body, MBCET and Chief Vicar General, Major Archdiocese of Thriuvananthapuram, Malankara Catholic Church, he emphasized on the significance of signal processing, informatics, communication, robotics and energy systems in the modern era. . The function was presided over by Dr. Muhammed Kasim (Vice-Chair, IEEE Kerala Section), who in his address pointed out the opportunities that the students can explore through IEEE kerala section.\nDuring the valedictory speech, the guest of honour Shri V K. Mathews (Executive Chairman, The IBS Group, Thriuvananthapuram) congratulated all the researchers and students. Also, he congratulated the initiatives of IEEE Kerala Section and Mar Baselios College of Engineering for organising the conference in an impeccable manner. He delivered a thought-provoking speech on how the world is now in a peculiar situation, after coming out of the Covid 19 pandemic. Mr. Mathews highlighted four major changes that are felt across the community as a whole: accelerated technology adoption, the changing nature of jobs, the changing operating models in work and the current state of the digital economy that we have entered now. He spoke about the three current mega trends of the day: personalization, disintermediation and virtualization. Mr. Mathews’ parting words on the need for change to happen from within each one of us, and the importance of continual learning, provided food for thought.\nThe best paper award for each track were presented and the program ended with vote of thanks by Ms. Luxy Mathews, Program Chair, IEEE SPICES 2022, Associate Professor, Dept. of ECE, MBCET.\nSPRINGER INTERNATIONAL CONFERENCE ON COMMUNICATION SYSTEMS AND NETWORKS (ComNet 2019)\nThe two day Springer International Conference, “Communication Systems & Networks 2019” (COMNET 2019), was held on 12 and 13 December 2019. It was jointly organized by the Department of Electronics & Communication Engineering of Mar Baselios College of Engineering and Technology and University of Dayton, USA.\nThe conference was inaugurated by Dr. V. K. Dadhwal, Director, Indian Institute of Space Science and Technology (IIST). Speaking on the occasion, Dr. Dadhwal spoke of the\nevolution of communication systems from the era of postcards and plain old telephone systems (POTS) to the era of 5G and the much-anticipated 6G systems. With the advent of remote sensing and satellite communication, data handling and storage also pose challenges of their own. Issues like data security and privacy, e-governance and transparency are some of the areas that can be taken up by the next generation of researchers.\nThe first day of the conference featured keynote addresses by Dr. Sharul Kamal Bin Abdul Rahim (Universiti Teknologi, Malaysia), Dr. Varun Jeoti (Universiti Teknologi, Malaysia), and Dr. Sujesh Sreedharan (SCTIMST). “Communication Systems and Networks have played a significant role in the dissemination of information giving the users an enriching experience providing access to a world of integrated services.”, Principal Dr. T. M. George mentioned in his welcome address. He added that as the fifth industrial revolution, Industry 5.0, approaches, smooth communication between man and machines is the need of the hour. “Issues like data security and privacy, e-governance and transparency need to be taken up by the next generation of researchers”, Dr. Dadhwal added, as he welcomed young researchers to take up the challenges in making seamless communication a reality. The Souvenir of Springer ComNet 2019 was released by Rev. Fr. John Vilayil in the august presence of Chief Guest Dr. V. K. Dadhwal, Director, IIST.\nDr. Ajit Kumar Panda (NIST, Odisha), and Dr. T. Shanmuganantham (Pondicherry Central University) delivered the keynote sessions on the second day of the International Conference on “Communication Systems and Networks” on 13 December 2019. The conference concluded with a valedictory session presided by Dr. Ajit Kumar Panda. Eminent educationists, research scholars and representatives of the industry participated in the conference. The Conference provided an opportunity for budding researchers to gain exposure to the current trends in research and development in the areas of Communication Systems and Networks.\nIEEE INTERNATIONAL CONFERENCE ON CIRCUITS AND SYSTEMS (ICCS 2017)\nIEEE International Conference on Circuits and Systems (ICCS 2017) organized by IEEE Circuits and Systems Society (CASS) India chapter in association with IEEE India Council was conducted successfully at the Department of Electronics and Communication Engineering, Mar Baselios College of Engineering and Technology, Thiruvananthapuram during 20\nth\nand 21\nst\nDecember 2017.\nThe inaugural function was held on 20\nth\nDecember 2017 at 9: 30 am. Dr. Jayakumari J., Chair, IEEE CASS India chapter welcomed the gathering. The Conference was inaugurated by Dr. K. Giridhar, Professor, Department of Electrical Engineering. Indian Institute of Technology Madras. Dr. Rominus Valsalam, Former Director, Electronics Research and Development Centre of India Institute of Technology, Thiruvananthapuram delivered the Chief Guest address. Dr. T. M. George, Principal, Mar Baselios College of Engineering and Technology, Thiruvananthapuram released the ICCS 2017 Conference Proceedings.\nOn 20\nth\nDecember 2017, Dr. K. Giridhar, delivered a keynote address on the topic “How will 5G be useful to India” and Er. T. Ananthavelavan, Principal Engineer, Microchip, Chennai delivered a keynote address on the topic “Array Signal Processing – Adaptive Beamforming using array of MEMS microphones”. These keynote sessions were followed by technical paper presentations in 5 parallel sessions.\nAll the technical sessions were chaired by experts in the field. The conference received a good response from wide spectrum of scholars and there were four tracks-Communication & Networking, Signal Processing, VLSI & Embedded Systems and Power & Energy Systems. On 21\nst\nDecember 2017, Dr. Saman Halgamuge, Professor and Director of Research School of Engineering, ANU College of Engineering and Computer Science, Australian National University delivered a keynote address on “Smart Mini Grids: Exploring Near Off-Grid Solutions” and Er. Sudalaimani C., Scientist D, Health and Software Technology Group, CDAC, Trivandrum delivered a keynote address on the topic “Brain Signal Processing and it’s applications”. These keynote sessions were followed by Technical paper presentations in 5 parallel sessions. Best paper Awards were constituted to recognize the best paper contributions received in various tracks for this event. The awards were based on general quality, originality, contributions, subject matter and timeliness.  Totally four best papers were chosen for the award. The conference concluded with a valedictory function on 21\nst\nDecember 2017 at 3: 00 pm. Dr. Saman Halgamuge, delivered the valedictory address and distributed the Best Paper awards and certificates.\nIEEE INTERNATIONAL CONFERENCE ON COMMUNICATION SYSTEMS AND NETWORKS (ComNeT2016)\nThe Department of Electronics and Communication Engineering organized 2016 International Conference on Communication Systems and Networks (ComNeT2016) during 21-23 July 2016 jointly with University of Dayton, USA, and was technically sponsored by IEEE.\nThe Conference was inaugurated on 21st July 2016 by Dr K Sivan, Director VSSC. This was followed by motivating addresses by Dr K Kesavasamy, Head, Academic Interface, TCS and Dr K Suresh Nair, Chair, IEEE Kerala Section.The Keynote Address was delivered by Dr. Vijayan K. Asari, Senior Member IEEE and Professor in Electrical and Computer Engineering, University of Dayton on 22nd July 2016. In addition to the Keynote, there were four technical presentations by eminent personalities, Dr S. Raghavan, Professor, Dept. of ECE, NIT Trichy; Dr. Sriram N. Kizhakkemadam, Senior Chief Engineer, Samsung R&D Institute, Bangalore; Dr. Krishnaraj M. Varma, Senior Hardware Engineer, Qualcomm, USA, ​and Mr Raja Duraisamy, Solutions Architect, Telecommunications, Singapore.\nThe conference included a technical program with three parallel tracks in the areas of Communication Systems, Signal Processing & Networks. It attracted over 162 papers, which were meticulously reviewed and 47 papers were finally chosen for presentation in the conference. There were 14 sessions under 8 different themes.\nIEEE INTERNATIONAL CONFERENCE ON GREEN TECHNOLOGIES (ICGT12)\nInternational Conference on Green Technologies (ICGT12) was organized by Mar Baselios College of Engineering and Technology, Trivandrum, jointly with University of Dayton, USA during 18-20 December 2012 at Mar Baselios College of Engineering and Technology, Trivandrum. The Conference was technically sponsored by IEEE EDS India Chapter and IEEE Kerala Section. The Conference was inaugurated by Honorable Minister for Education Sri. P. K. Abdu Rabb and was presided by His Excellency Most Rev. Dr. Samuel Mar Irenios, Auxiliary Bishop, Archdiocese of Trivandrum. During the three days of the Conference, the Research and Development activities in all Engineering fields viz. Civil, Computer Science and IT, Electrical, Electronic and Mechanical Engineering related to Green Technologies were discussed. The Keynote Address ‘Alternative Energy Sources: A Practical Perspective” was delivered by Dr. R. Unnikrishnan, Dean, California State University, Fullerton, USA.\nAbout 200 papers were received and about 69 papers were finally chosen for presentation in the Conference on 19\nth\nand 20\nth\nDecember. The Conference concluded with a panel discussion involving experts in the relevant areas. The discussion was moderated by Prof. V. K. Damodaran, International Energy Consultant to UNIDO. This was followed by a valedictory function presided by His Beatitude Moran Mor Baselios Cardinal Cleemis Catholicos, the Major Archbishop of the Malankara Catholic Church.\nNATIONAL CONFERENCE ON COMMUNICATION SYSTEMS AND NETWORKS (ComNeT2010)\nMar Baselios College of Engineering and Technology, Thiruvananthapuram, one of the premier engineering colleges in Kerala in association with IEEE Kerala Section, CSI Trivandrum Chapter and IETE Trivandrum Centre organized a National Conference on Communication Systems and Networks during 21-22 December, 2010 – CoMNeT 2010.  The Conference aimed at bringing academicians, researchers and professional engineers together on a common platform to share their views, research pursuits and experiences through paper presentations and tutorials.\nDr. Surendra Pal\n, the Distinguished Scientist, Prof. Satish Dhawan Professor & Senior Adviser, Satellite Navigation, ISRO Satellite Centre, Bangalore inaugurated the conference and delivered an invited lecture.\nTechnical Keynote Address “Spatiotemporal Analysis of Brain Signals for the Identification of Emotional States of Mind” was delivered by Dr. Vijayan K. Asari, Professor in Electrical Engineering and Ohio Research Scholars Chair in Wide Area Surveillance, University of Dayton, Ohio, USA. The pre-conference tutorial sessions had presentations by Dr. Lillykutty Jacob, Professor, NIT – Calicut, Dr. S. Raghavan, Professor, NIT- Trichy, Mr. Balamuralidhar P., Head, TCS Innovation Lab, Bangalore and Dr. M. K. Radhakrishnan, Director, NanoRel, Singapore.\nNATIONAL CONFERENCE ON BROADBAND TECHNOLOGIES (BROADBAND ‘08)\nMar Baselios College of Engineering and Technology, Trivandrum, in association with IEEE Kerala Section and CSI Trivandrum Chapter organized a National Conference on Broadband Technologies during 27-28, March 2008. The Conference aims to bring academicians, researchers and professional engineers together on a common platform to share their views, researches and experiences through paper presentations, invited talks and industrial exhibitions. Mr. Kris Gopalakrishnan, CEO and MD of Infosys Technologies Pvt. Ltd. inaugurated the conference and delivered the keynote address. Dr. Ajay Kumar IAS, Secretary, Dept. of Information Technology, Govt. of Kerala presided over the function. The National Conference assumed a lot of significance at a time innovative technologies and solutions were being sought after to cope with the customer demand for access to information at high bandwidth anytime, anywhere. The demand for high bandwidth communications continued to explode, with a need to access ever-increasing amounts of data, video and voice. This had been vindicated by the boom in Broadband Technologies both in the wired and wireless domain. A Pre-Conference Seminar was also organized. A host of technical experts had been invited to deliver talks on state-of-the-art as well as futuristic topics related to Broadband technology.\nAbout 200 delegates from all over the nation attended the conference. The conference provided a great opportunity to listen to the experts in the field and share views with the researchers who presented their research work. Dr. M. K. Ramachandran Nair, Vice-Chancellor, University of Kerala will be the chief guest for the valedictory function. Mr. G. Vijayaraghavan, President, V M A Consultants Pvt. Ltd., and Former CEO, Technopark will preside over the function.\nBoS\nThe People\nDepartment Advisory Board\nFacilities\nNews and Events\nActivities\nConferences\nResearch and Consultancy\nWorkshops & Seminars\nPlacements\nB. Tech PEOs POs & PSOs\nSyllabus\nVideo Lectures\nTime Table\nFormer HoDs\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}