{
    "filename": "mbcet.ac.in_faculty_dr-shinu-asmy-v-s_.html",
    "content": "Dr. Shinu Asmy V S – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nScience & Humanities\n>\nDr. Shinu Asmy V S\nEmployee Code / ID No.\n10725069\nQualifications\nPhD in English language Teaching\nOrcid ID\n——\nIndustry / R & D Experience\n3\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n7540008853\nAreas of Interest / Current Research\nEnglish Language Teaching, Gender studies\nResearch,  Consultancy, Publication\nShinu Asmy VS എൻ്റെ സ്വാതന്ത്ര്യം, എൻ്റെ ഇഷ്ടങ്ങൾ… ഞാൻ പഠിക്കട്ടെ. Moolyashruthi, 2018, 13(4), 30-33.\nShinu Asmy VS, Nagaraj P, Preliminary problems faced in educating the third gender community, Asia Pacific Journal of Research 2015; 1 (27), 20-24.\nShinu Asmy VS, Nagaraj P, Possibilities and Difficulties in Documenting Oral Literature with Reference To “Vaai Pattu” By Kunnam Kulam Kunjalavi, International Journal Of Scientific Research 2015; 4(9), ISSN No 2277 – 8179.\nShinu Asmy VS, Nagaraj P, Evaluating the Problems Faced in Communicative Competence by Second Level Students – With Specific Reference to Indian Context, Online International Interdisciplinary Research Journal 2015, 5(5), 524-528.\nShinu Asmy VS. Marginalizing through Language in “The Kite Runner. Social and Cultural Impact on Post Modernism” in the book “Social and Cultural Impact on Post Modern Literature”. 2013, pp 560\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNil\nAcademic / Professional Outreach Activities\nCoordinated a three-day offline Faculty Development Program (FDP) on the theme “Mentoring Matters: Strategies for Effective Academic Counselling,” conducted by the Department of Science and Humanities from 19/05/2025 to 21/05/2025.\nParticipated in a five-day online Faculty Development Program (FDP) on the theme “Inculcating Universal Human Values (UHV) in Technical Education,” organized by AICTE from 10/03/2025 to 14/03/2025.\nMembership in Professional bodies/ organizations\n—–\nCommunity Outreach Activities\n—–\nAwards / Distinctions / Rank / Other Achievements if any\nAwarded Moulana Azad National Fellowship from University Grants Commission, Government of India in the year 2012.\nAwarded 2nd Rank for MA English Literature at the University level in the year 2012.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}