{
    "filename": "mbcet.ac.in_faculty_ms-shini-renjith_.html",
    "content": "Dr. Shini Renjith – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nComputer Science & Engineering\n>\nDr. Shini Renjith\nEmployee Code / ID No.\n10217029\nQualifications\nMTech, PhD, UGC NET\nOrcid ID\nhttps://orcid.org/0000-0003-1088-0825\nIndustry / R & D Experience\nTeaching: 10 + Years\nIndustry: 2 Years 3months\nResearch: 5 Years 8 months\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9446846123\nAreas of Interest / Current Research\nData Analytics\nArtificiaI Intelligence, Machine Learning, Deep Learning\nInformation Retrieval – Recommender Systems\nNatural Language Processing\nResearch,  Consultancy, Publication\nPublications\nJournals\nShini Renjith\n, Sreekumar A. and Jathavedan M. have the paper titled “An Empirical Research and Comparative Analysis of Clustering Performance for Processing Categorical and Numerical Data Extracts from Social Media” selected for publication in\nUEM Acta Scientiarum. Technology\n(ISSN: 1807-8664,\nSCIE\n,\nScopus\n), Jan 2022.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have published the paper titled “SemRec – An Efficient Ensemble Recommender with Sentiment based Clustering for Social Media Text Corpus” in\nWiley Concurrency and Computation: Practice and Experience\n(ISSN: 1532-0634,\nSCIE\n,\nScopus, Impact factor: 1.536 (2020)\n), May 2021.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have published the paper titled “Performance Evaluation of Clustering Algorithms for Varying Cardinality and Dimensionality of Data Sets” in\nElsevier Materials Today: Proceedings\n(ISSN: 2214-7853,\nScopus\n), Vol. 27 Issue 1, Jan 2020.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have published the paper titled “An Extensive Study on the Evolution of Context-Aware Personalized Travel Recommender Systems” in\nElsevier Information Processing and Management\n(ISSN: 0306-4573,\nSCIE, Scopus, Impact Factor: 6.222 (2020)\n), Vol. 57 Issue 1, Jul 2019.\nShini Renjith\nhas published the paper titled “Detection of Fraudulent Sellers in Online Marketplaces using Support Vector Machine Approach” in\nInternational Journal of Engineering Trends and Technology (IJETT)\n(ISSN: 2231-5381), Vol. 57 Issue 1, Mar 2018.\nShini Renjith\nhas published the paper titled “B2C E-Commerce Customer Churn Management: Churn Detection using Support Vector Machine and Personalized Retention using Hybrid Recommendations” in\nInternational Journal on Future Revolution in Computer Science & Communication Engineering (IJFRCSCE)\n(ISSN: 2454-4248), Vol. 3 Issue 11, Nov 2017.\nShini Renjith\n, Alpana Gopi, Divya P R, LittyRajan and Surya Rajan have published the paper titled “Accident Tracking and Visual Sharing Using RFID and SDN” in\nInternational Journal of Computer Engineering In Research Trends (IJCERT)\n(ISSN: 2349-7084), Vol. 3 Issue 10, Oct 2016.\nShini Renjith\nand Dhanya Sudhakaran have published the paper titled “Context Aware Community Detection Scheme for Identification of Community in Multi-dimensional Networks” in\nInternational Journal of ICTAK (Convergence)\n(ISSN: 2454-5848), Vol. 2 Issue 1, Jun 2016.\nShini Renjith\nand Dhanya Sudhakaran have published the paper titled “Multi Comm_Plus: A Community Detection System for Identification of Community in Multi-Dimensional Networks” in\nInternational Journal of Innovative Research in Computer and Communication Engineering (IJIRCCE)\n(ISSN: 2320-9801), Vol. 4 Issue 5, May 2016.\nShini Renjith\nand Dhanya Sudhakaran have published the paper titled “Survey of Community Detection Algorithms to Identify the Best Community in Real-Time Networks” in\nInternational Journal of Scientific Engineering and Applied Science (IJSEAS)\n(ISSN: 2395-3470), Vol. 2 Issue 1, Jan 2016.\nShini Renjith\nand Dhanya Sudhakaran have published the paper titled “Phase based Resource Aware Scheduler with Job Profiling for MapReduce” in\nInternational Journal of Latest Trends in Engineering and Technology (IJLTET)\n(ISSN: 2278-621X), Vol. 6 Issue 2, Nov 2015.\nShini Renjith\nhas published the paper titled “An Integrated Framework to Recommend Personalized Retention Actions to Control B2C E-Commerce Customer Churn” in\nInternational Journal of Engineering Trends and Technology (IJETT)\n(ISSN: 2231-5381), Vol. 27 Issue 3, Sep 2015.\nShini Renjith\nand K.G. Jijimol have published the paper titled “Load Balanced Optimal Client Server Assignment for Internet Distributed Systems” in\nInternational Journal of Applied Engineering Research (IJAER)\n(ISSN: 0973-9769,\nScopus\n), Vol. 10 Issue 69, Jul 2015.\nShini Renjith\nand Anjali C have published the paper titled “Fitness Function in Genetic Algorithm based Information Filtering – A Survey” in\nInternational Journal of Computer Science and Mobile Computing (IJCSMC)\n, ICMIC13 (ISSN: 2320-088X), Dec 2013.\nShini Renjith\nand Anjali C have published the paper titled “A Personalized Travel Recommender Model Based on Content-based Prediction and Collaborative Recommendation” in\nInternational Journal of Computer Science and Mobile Computing (IJCSMC)\n, ICMIC13 (ISSN: 2320-088X), Dec 2013.\nBook Chapters\nShini Renjith\n, Rohit R.V., Aiswarya D.R., Athulya Roy and Vighnesh M. have the paper titled “A Novel Approach to Predict Success of Online Games Using Random Forest Regressor for Time Series Data” selected for publication in\nLecture Notes in Electrical Engineering\n(ISSN: 1876-1119).\nShini Renjith\n, Rahul Sunil, Kesia M. Joies, Abhijeet C. and Bharath T.U. have the paper titled “BitMedi: An Application to Store Medical Records Efficiently and Securely” selected for publication in\nLecture Notes on Data Engineering and Communications Technologies\n(ISSN: 2367-4520).\nShini Renjith\nand Merlin S. David have the paper titled “Comparison of Word Embeddings in Text Classification Based on RNN and CNN” selected for publication in\nIOP: Materials Science and Engineering\n(ISSN: 1757-899X).\nShini Renjith\n, Sreekumar A. and Jathavedan M. have published the paper titled “SMaRT: Social Media based Recommender for Tourism” in\nSpringer Transactions on Computational Science and Computational Intelligence\n(ISBN: 9783030495008, ISSN: 2569-7072), Vol. 5, Feb 2021.\nShini Renjith\n, Mable Biju and Monica Merin Mathew have published the paper titled “A Sentiment-Based Recommender System Framework for Social Media Big Data Using Open-Source Tech Stack” in\nSpringer Advances in Intelligent Systems and Computing\n(ISBN: 9789811535147, ISSN: 2194-5357,\nScopus, Impact Factor: 0.570\n), Vol. 1245, Oct 2020.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have published the paper titled “Pragmatic Evaluation of the Impact of Dimensionality Reduction in the Performance of Clustering Algorithms” in\nSpringer Lecture Notes in Electrical Engineering\n(ISBN: 9789811555589, ISSN: 1876-1100,\nScopus, Impact Factor: 0.340\n), Vol. 672, Sep 2020.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have published the paper titled “A Comparative Analysis of Clustering Quality Based on Internal Validation Indices for Dimensionally Reduced Social Media Data” in\nSpringer Advances in Intelligent Systems and Computing\n(ISBN: 9789811535147, ISSN: 2194-5357,\nScopus, Impact Factor: 0.570\n), Vol. 1133, Aug 2020.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have published the paper “Evaluation of Partitioning Clustering Algorithms for Processing Social Media Data in Tourism Domain” in\nIEEE Xplore,\nProceedings of RAICS 2018\n(ISBN: 9781538673362,\nScopus\n), Dec 2018.\nShini Renjith\nand Anjali C. have published the paper titled “A Personalized Mobile Travel Recommender System using Hybrid Algorithm” in\nIEEE Xplore, Proceedings of ICCSC 2014\n(ISBN: 9781479960132,\nScopus\n), Dec 2014.\nConferences\nShini Renjith\n, Rohit R.V., Aiswarya D.R., Athulya Roy and Vighnesh M. have the paper titled “A Novel Approach to Predict Success of Online Games Using Random Forest Regressor for Time Series Data” selected for presentation at\n2021 International Conference on Advances in Electrical and Computer Technologies (ICAECT 2021)\n, Oct 2021.\nShini Renjith\n, Rahul Sunil, Kesia M. Joies, Abhijeet C. and Bharath T.U. have the paper titled “BitMedi: An Application to Store Medical Records Efficiently and Securely” selected for presentation at\n2021\nInternational Conference on Evolutionary Computing and Mobile Sustainable Networks (ICECMSN 2021)\n, Sep 2021.\nShini Renjith\nand Merlin S. David have presented the paper titled “Comparison of Word Embeddings in Text Classification Based on RNN and CNN” at\n2021 Global Conference on Recent Developments in Computer and Communication Technologies (GC-RDCT 2021)\n, Jul 2021.\nShini Renjith\n, Mable Biju and Monica Merin Mathew have presented the paper titled “A Sentiment-Based Recommender System Framework for Social Media Big Data Using Open-Source Tech Stack” at\n2020 International Conference on Recent Trends in Machine Learning, IOT, Smart Cities & Applications (ICMISC 2020)\n, Mar 2020.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have presented the paper titled “SMaRT: Social Media based Recommender for Tourism” at\n2019 International Conference on Networks & Advances in Computational Technologies (NetACT 2019)\n, Jul 2019.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have presented the paper titled “A Comparative Analysis of Clustering Quality Based on Internal Validation Indices for Dimensionally Reduced Social Media Data” at\n2019 International Conference on Artificial Intelligence and Data Engineering 2019 (AIDE 2019)\n, May 2019.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have presented the paper titled “Pragmatic Evaluation of the Impact of Dimensionality Reduction in the Performance of Clustering Algorithms” at\n2019 International Conference on Advances in Electrical and Computer Technologies (ICAECT 2019)\n, Apr 2019.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have presented the paper “Performance Evaluation of Clustering Algorithms for Varying Cardinality and Dimensionality of Data Sets” at\n2019 International Conference on Advances in Electrical and Computer Technologies (ICAECT 2019)\n, Apr 2019.\nShini Renjith\n, Sreekumar A. and Jathavedan M. have presented the paper titled “Evaluation of Partitioning Clustering Algorithms for Processing Social Media Data in Tourism Domain” at\n2018 IEEE Recent Advances in Intelligent Computational Systems (RAICS 2018)\n, Dec 2018.\nShini Renjith\nand Dhanya Sudhakaran have presented the paper titled “Context Aware Community Detection Scheme for Identification of Community in Multi-dimensional Networks” in\n2016 International Conclave on Skills, Engineering & Technology (ICSET 2016)\n, Jun 2016.\nShini Renjith\nand K.G. Jijimol have presented the paper titled “Load Balanced Optimal Client Server Assignment for Internet Distributed Systems” in\n2015 International Conference on Computing Paradigms (ICCP 2015)\n, Jul 2015.\nShini Renjith\nand Anjali C. have presented the paper titled “A Personalized Mobile Travel Recommender System using Hybrid Algorithm” in\n2014 International Conference on Computational Systems and Communications (ICCSC 2014)\n, Dec 2014.\nShini Renjith\nand Anjali C have presented the paper titled “Fitness Function in Genetic Algorithm based Information Filtering – A Survey” in\n2013 International Conference on Mobility in Computing (ICMiC 2013)\n, Dec 2013.\nShini Renjith\nand Anjali C have presented the paper titled “A Personalized Travel Recommender Model Based on Content-based Prediction and Collaborative Recommendation” in\n2013 International Conference on Mobility in Computing (ICMiC 2013)\n, Dec 2013. This paper has also secured the\nBest Paper Award in ICMIC13\n.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\nIBM Skills Academy Overall Program Coordinator and Data Science Instructor\nsince 2020.\nComputer Society of India (CSI) Student Branch Coordinator/Counselor\nsince 2020\nAI Research Club  and Openlabs.ai coordinator\nsince 2020\n.\nResource Person\non “\nPython for Machine Learning\n” in the 5 day\nWorkshop\nat University College of Engineering, Thodupuzha, Kerala (Jul 2021).\nInvited Speaker\nin\nKaleidoscope IT Talks”\nconducted by Computer Society of India (CSI) Trivandrum Chapter, Thiruvananthapuram, Kerala (Mar 2021).\nResource Person\nfor the\nAICTE sponsored FDP on ” Role of Machine Learning in IOT Applications”\nconducted by Marian Engineering College, Thiruvananthapuram, Kerala (Dec 2019).\nResource Person\nfor the\nTalk Series by Data Analytics Group\nat Dept. of CSE, MBCET (Dec 2019).\nCoordinator and Resource Person\nof 4 day\nWorkshop with hands-on sessions\nfor students on\nMachine Learning and Deep Learning\nat Dept. of CSE, MBCET (Sep and Nov 2019).\nResource Person\non “\nMachine Learning\n” in the 3 day\nResidential Camp of Gender & Technology Programme\nof International Centre for Free and Open Source Software (ICFOSS), Thiruvananthapuram, Kerala (Oct 2019).\nResource Person\nfor 2 week\nInternship on Deep Learning\nat Dept. of CSE, MBCET during (Nov 2019).\nStaff Coordinator\nof the\nFirst Edition of TEDx Event\nheld at MBCET\nStaff Coordinator\nof the\nMaiden Inter-Collegiate Tech Fest,\nHash 2018\nand\n22 Hour Hackathon Event\n, organized by Department of CSE, MBCET\nCoordinator\nfor the\nBaselian Computing Workshop 2017\nOrganizer\nfor\nCareer Guidance Talk\non” What After B.Tech” on behalf of ACM Chapter, MBCET\nStaff Coordinator\nof\nAssociation of Computer Engineers (ACE)\nat MBCET during 2017-2019\nStudent Branch Coordinator and Faculty Advisor\nof\nAssociation for Computing Machinery (ACM) Chapter\nat MBCET during 2017-2019\nMembership in Professional bodies/ organizations\nLife Member of Computer Society of India (CSI)\nLife Member of Indian Society for Technical Education (ISTE)\nMember of Institute of Electrical and Electronics Engineers (IEEE)\nMember of IEEE Computer Society\nMember of Association for Computing Machinery (ACM)\nCommunity Outreach Activities\nRecognized Reviewer\nin\nElsevier Information Processing and Management\nJournal (SCIE, Scopus)\nInvited Reviewer\nin following journals:\nElsevier Materials Today: Proceedings\n(Scopus)\nSpringer Artificial Intelligence Review\n(SCIE, Scopus)\nTaylor & Francis Journal of Spatial Science\n(SCIE, Scopus)\nTaylor & Francis Applied Artificial Intelligence\n(SCIE, Scopus)\nTaylor & Francis Connection Science\n(SCIE, Scopus)\nIEEE Access\n(SCIE, Scopus)\nUEM Acta Scientiarum. Technology\n(SCIE, Scopus)\nWorld Scientific International Journal of Information Technology & Decision Making\n(SCIE, Scopus)\nIndonesian Journal of Electrical Engineering and Computer Science\nEditorial Team Member\nof the following journals\nInternational Journal of Management and Data Analytics\nAdvances in Wireless and Mobile Communications\nDesignated Reviewer on the Technical Program Committee\nfor the Fourth\nInternational Conference on Advances in Computing, Communications and Informatics (ICACCI)\nheld at SCMS School of Engineering and Technology, Aluva, Kochi, Kerala.\nTechnical Program Committee Member and Reviewer\nfor\nISTE Convention, 2021\nheld at MBCET.\nMember of the Organizing Committee\nfor two editions of the\nNational Conference on Indian Language Computing (NCILC-2018 & NCILC 2019)\nheld at Cochin University of Science and Technology (CUSAT), Kochi, Kerala.\nMember of the Organizing Committee\nfor two editions of the International Conference on Networks & Advances in Computational Technologies (NetACT17 & NetACT19) held at MBCET\nAwards / Distinctions / Rank / Other Achievements if any\nUGC NET Qualified in Dec 2014\nBest Paper Award in ICMIC13\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}