{
    "filename": "mbcet.ac.in_category_uncategorized_.html",
    "content": "Uncategorized – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nDr Shobha Teresa Panicker MBCET College student counselor and consultant Psychotherapist, gave an informative talk on ‘\nSmart Phone Addiction and Mental Health Challenges\n‘ in All India Radio Air Malayalam on friday 14th February 2025.\nConference Website\nhttps://www.icameo2025.com/\nIX-DAYS FDP on “AI Applications in Modern Research: A Hands-on Approach” (17-22 Feb 2025)\nWe are delighted to invite you to a six-day Faculty Development Programme (FDP) on “AI Applications in Modern Research: A Hands-on Approach,” scheduled from 17 – 22 February 2025 in offline mode at Mar Baselios College of Engineering and Technology, Thiruvananthapuram.\nThis FDP aims to enhance research capabilities by leveraging AI tools for literature surveys, data analysis, thesis writing, ethical research practices, funding opportunities, and effective dissemination through high-quality publications and presentations.\nThe programme is open to faculty members and research scholars from Engineering, Science, and Humanities disciplines. Please find the attached brochure for details on topics, fees, and registration procedures.\nRegistration Link:\nhttps://forms.gle/\nYHXF99RtMQU2kq4n9\nThe FDP will feature expert speakers from leading institutions and industries, providing valuable insights into AI-driven research methodologies. We encourage you to register and share this opportunity with your colleagues.\nFor any queries, please feel free to contact:\nCoordinator:\nMs. Nimisha Anna Jacob\nAssistant Professor, Department of Civil Engineering\nMar Baselios College of Engineering and Technology, Thiruvananthapuram\n+91 9895086764 |\n[email protected]\nLooking forward to your participation!\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nfdpredited\nInternational day of Yoga celebration at MBCET -21st June\nhttps://mbcet.ac.in/wp-content/uploads/2024/06/VIDEO-2024-06-23-09-19-15.mp4\n*“Don’t buy upgrades, ride up grades”*\n– Eddy Merckx.\nAs a part of _National Safety Week_, *NSS MBCET UNIT 230 and 706 and Department of Physical Education* is proudly presenting a *_Cycle Rally_* in collaboration with *Waste Management Cell MBCET* on _07th March 2024_\n.\nInaugurated by:\n*Smt. Veena George*, Minister of Health, Women and Child Development.\nTime: *5:30 PM Join us on this very special occasion!\nICID 2024\nSecond International Conference on Infrastructure Development, Conducted by the Department of Civil Engineering MBCET, from\nSeptember\n25\nth\nto 27\nth\n, 2024\nfocuses on resilience, sustainability and transformation adaptation in infrastructure. It will be held at Mar Baselios College of Engineering and Technology (MBCET) in Thiruvananthapuram, Kerala.\nICID 2024 aims to address the challenges and opportunities in infrastructure development, considering its crucial role in societal progress and sustainable development goals (SDGs). The conference provides a platform for stakeholders, academicians, practitioners and students to come together to seek solutions and innovations.\nJoin us for three days of insightful discussions, keynote sessions, technical presentations, workshops and networking opportunities.\nFor more details, visit the website:\nhttps://www.icid24.in/\nContact:\nThe Organizers,\nICID 2024,\nMar Baselios College of Engineering and Technology,\nThiruvananthapuram, Kerala, India.\nDr. Jaya S Pillai\n+91 96332 65828\n[email protected]\nDr. Amal Raj\n+91 77366 06107\n[email protected]\nMr. Nitin S\n+91 99957 35762\n[email protected]\nConference Brochure\nFDP on “LIDAR Applications in Advanced Surveying”\nDepartment of Civil Engineering, Mar Baselios College of Engineering and Technology, is conducting a Five day Faculty Development Programme on  “LIDAR Applications in Advanced Surveying” from 8-12 January 2024. The link for registration is\nhttps://forms.gle/\noAjWaeFvLV8DGx43A\n. Coordinators of the program are\nMs. Akhila A.M, AP, CE Department (9544627512) and Mr. Nitin S., AP, CE Department  (9995735762).\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nIndian Geotechnical Society Students Chapter and the one day National Seminar.\nDepartment of Civil Engineering, Mar Baselios College of Engineering and Technology, Trivandrum (MBCET) is pleased to invite you to the inauguration of IGS Students Chapter at MBCET and a One Day National Seminar on the topic “\nModern Geotechnical Engineering Practices\n” on\n29/11/2023 from 9.30 am to 5.00 pm.\nThe technical session includes eminent speakers with wide experience in field applications. Check the brochure for a detailed schedule.\nVenue for the event is: Laurie Baker Hall, Department of Civil Engineering.\nNational Seminar Brochure\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}