{
    "filename": "mbcet.ac.in_faculty_dr-neethu-roy_.html",
    "content": "Dr. Neethu Roy – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nCivil Engineering\n>\nDr. Neethu Roy\nEmployee Code / ID No.\n10102004\nQualifications\nPh.D\nOrcid ID\n0000-0002-6051-2230\nIndustry / R & D Experience\n–\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\nMobile: 9567169399 / Intercom : 314\nAreas of Interest / Current Research\nPavement material characterization, pavement analysis and design, pavement management system\nResearch, Consultancy, Publication\nPeer Reviewed Science cited International Journals :\nR. Nivitha, R. Devika, J. Murali Krishnan, Neethu Roy, Influence of bitumen type and polymer dosage on the relaxation spectrum of styrene-butadiene-styrene (SBS)/styrene-butadiene (SB) modified bitumen, Mechanics of Time-Dependent Materials,\nhttps://doi.org/10.1007/s11043-021-09531-y\n(2021).\nM R Nivitha, Neethu Roy & J Murali Krishnan, Influence of refinery processing methods on ageing of bitumen,\nSadhana – Academy Proceedings in Engineering Sciences\n, 44, 128 (2019).\nNeethu Roy, A. Veeraragavan and J. Murali Krishnan, Influence of Confinement Pressure and Air Voids on the Repeated Creep and Recovery of Asphalt Concrete Mixtures,\nInternational Journal of Pavement Engineering\n, July 2014.\nNeethu Roy, A. Veeraragavan and J. Murali Krishnan, Interpretation of Flow Number Test Data for Asphalt Mixtures,\nInstitute of Civil Engineers – Transport\n, UK, May 2014.\nNeethu Roy, A. Veeraragavan, Pankaj Jain and J. Murali Krishnan, A Re-look at the Asphalt Mixture Performance Test Protocols and Computational Algorithms,\nASTM Journal of Testing and Evaluation\n, Vol. 41, No. 5, 2013, pp. 1- 16.\nPeer Reviewed Science cited International Conferences:\nN.Roy, V.Chowdary, U. Saravanan, J. M. Krishnan, Non-linear modeling of the influence of rest period on healing behavior of asphalt concrete mixtures, Green and Intelligent Technologies for Sustainable and Smart Asphalt Pavements – Liu et al. (Eds) : Proceedings of the 5th International Symposium on Frontiers of Road and Airport Engineering, 12-14 July, 2021, Delft, Netherlands (IFRAE). ISBN: 978-1-032-16954-5.\nLakshmi Roja, Neethu Roy and J. Murali Krishnan, Influence of Aging on the Rheological Behavior of Warm Mix Asphalt Binders,\n8\nth\nRILEM International Symposium on Testing and Characterization of Sustainable and Innovative Bituminous Materials\n, Francesco Canestrari and Manfred N. Partl (\nEditors),\nRilem Book Series, Springer, London, Volume 11, Oct.2015, 497.\nNeethu Roy, Issues Related to Evaluating Rutting of Asphalt Concrete Mixtures in the Laboratory,\nInternational Journal of Scientific and Engineering Research\n(2\nnd\nInternational Conference on Materials, Mechanics & Management), Dec.2014.\nNeethu Roy, Venkaiah Chowdary and J. Murali Krishnan, Influence of Rest Periods on the Creep and Recovery of Asphalt Concrete Mixtures,\nColloquium on Transportation Systems Engineering and Management CTR, CED, NIT Calicut, India, May 12-13, 2014.\nNeethu Roy, J. Murali Krishnan and A. Veeraragavan, Effect of Confinement Pressure on Creep and Recovery Response of Asphalt Concrete Mixtures,\nProceedings of International Conference on Maintenance and Rehabilitation of Pavements and Technological Control\n(MAIREPAV7), Auckland – New Zealand, August 2012.\nNeethu Roy, A. Veeraragavan, J. Murali Krishnan, Influence of Air Voids of Hot Mix Asphalt on Rutting Within the Framework of Mechanistic-Empirical Pavement Design, 2nd Conference of Transportation Research Group of India (2nd CTRG),\nProcedia – Social and Behavioral Sciences\n104 (2013) 99 – 108.\nPeer Reviewed National Journals:\nNeethu Roy, J. Murali Krishnan and A. Veeraragavan, Mechanical Characterization of Bituminous Concrete Mixtures using Asphalt Mixture Performance Tester (AMPT\n), Indian Highways\n, June 2012, pp. 61-68.\nNeethu Roy, Kuncheria P. Isaac and A. Veeraragavan, Sensitivity Analysis of Input Parameters for Application of HDM-4 for Investment Decisions,\nIndian Highways\n, Vol. 34, No.1, 2006.\nNeethu Roy, Kuncheria P. Isaac and A. Veeraragavan, HDM-4: Calibration to Indian Conditions and its Applications – Case Study,\nHighway Research Bulletin\n, IRC No. 69, 2003.\nNational Conference:\nDevika R., Roy, Neethu and Krishnan, J. M., Influence of Polymer Dosage on the Creep and Recovery of Polymer Modified Bitumen, 7\nth\nConference on Transportation Systems Engineering and Management, KSCSTE-NATPAC &CET, Kerala, Dec., 2020.\nNiranjana J. S., Feba Paul, Hridya D Nambiar, Ashly Joy and Neethu Roy, Flood Risk Assessment of Thiruvananthapuram City, Kerala,\nProceedings of International Web Conference in Civil Engineering for a Sustainable Planet (ICCESP 2021)\n. DOI: 10.21467/proceedings.112; Series: AIJR Proceedings; ISSN: 2582-3922; ISBN: 978-81-947843-x-x, March 2021.\nPh.D Research Guidance  (Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nResearch Supervisor, “Economic Models to Optimize Life Cycle Cost of Bituminous Pavements”, Mr. Sunil Kumar K (email:\n[email protected]\n), Registered under APJ Abdul Kalam Technological University; Co- Supervisor: Dr. Praveen Sal C J., Principal, SCMS School of Engineering and Technology.\nAcademic / Professional Outreach Activities\nTechnical advisor to Rebuilt Kerala Initiative, Govt. of Kerala.\nMember, Project Advisory Group, KSCSTE – National Transportation Planning and Research Centre (NATPAC)\nMembership in Professional bodies/ organizations\nASCE – ASCE 10452418 (Faculty Advisor, MBCET Student Chapter of ASCE); ISTE-Life Member\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nShree Gaayathree Devi Award for the female scholar in Civil Engineering with highest CGPA for the year 2013, Indian Institute of Technology Madras, Chennai.\nProf. C. E. G. Justo Endowment Award for the year 2002 for being the best outgoing M.Tech student in Traffic and Transportation Engineering, College of Engineering Trivandrum.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}