{
    "filename": "mbcet.ac.in_faculty_dr-nisha-g-k_.html",
    "content": "Dr. Nisha G. K. – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nDr. Nisha G. K.\nEmployee Code / ID No.\n10306003\nQualifications\nM.Tech ( Electrical Machines), Ph. D\nVidwan ID\nhttps://vidwan.inflibnet.ac.in/profile/193120\nOrcid ID\nhttps://orcid.org/0000-0002-7798-906X\nGoogle Scholar\nhttps://scholar.google.com/citations?user=mYI16RoAAAAJ&hl=en\nIndustry / R & D Experience\nNil\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n404\nAreas of Interest / Current Research\nElectric Vehicles, Industrial Drives, Power Electronics, Electrical Machines.\nResearch,  Consultancy, Publication\nCompleted PhD in 2015 and have more than 66 publications with Google Scholar Citations 294, h index 11, i-10 index 12.\nMr. Chinmay Krishna S.,Dr. Nisha G K  , “Artificial Intelligence:Revolutionising Electrical and Electronics Engineering”in the AICTE sponsored International Conference on Recent Trends in Energy, Environment , Science and Technology (CREEST- 2025) held @ UKF College of Engineering and Technology from 7th- 9th May 2025.\nDr. Nisha G K, Ms. Sandhya P, Ms. Aiswarya S S, ” Mitigating Risks in EV Wireless Power Transmission through Foreign Object Detection”in the AICTE sponsored International Conference on Recent Trends in Energy, Environment , Science and Technology (CREEST- 2025) held @ UKF College of Engineering and Technology from 7th- 9th May 2025.\nDr. Nisha G K,  Ms. Rinku R S, Dr. Sheryl Arulini A,” Review on Torque Ripple Mitigation Strategies and Fault Tolerant Control Techniques for Switched Reluctance Motor Drives”in the AICTE sponsored International Conference on Recent Trends in Energy, Environment , Science and Technology (CREEST- 2025) held @ UKF College of Engineering and Technology from 7th- 9th May 2025.\nSandhya P, Dr. Nisha G.K, Aiswarya S S,” Charging Up the Future: Capacitive and Inductive Wireless Power Transfer“, IEEE International Conference on E-Mobility, Power Control and Smart systems (ICEMPS), 18-20 April 2024, DOI:\n10.1109/ICEMPS60684.2024.10559277\n.\nMayoorika Venu, Dr. Nisha G. K, P.Sandhya, Vaishnav Dev B, Vivin John Thomas, J S Tomin,” Industrial Automation and Implementation of Coconut Breaking System “, IEEE International Conference on E-Mobility, Power Control and Smart systems (ICEMPS), 18-20 April 2024, DOI:\n10.1109/ICEMPS60684.2024.10559325\n.\nChinmay Krishna S, Dr. Nisha G.K.,” Review of Autonomous Mobile Robots,”\n2024 International Conference on E-mobility, Power Control and Smart Systems (ICEMPS)\n, 18-20 April 2024, DOI:\n10.1109/ICEMPS60684.2024.10559359\n.\nPraveen O, Dr. Nisha G. K., “Closed Loop Control of Three Level NPC Induction Motor Drive for Water Pumping Application”,\n2024 International Conference on E-mobility, Power Control and Smart Systems (ICEMPS)\n, 18-20 April 2024, DOI:\n10.1109/ICEMPS60684.2024.10559252\n.\nSandhya P, Dr. Nisha G.K“ Analysing Various Compensation Schemes for Inductive Wireless Power Transfer,” 2023 IEEE Pune Section International Conference (Pune Con), Pune, India, 2023, pp. 1-6, December 2023, DOI:\n10.1109/PuneCon58714.2023.10450092\n.\nA P Aishwarya and Dr. Nisha G.K, ” Electric Vehicle Charger Performance from Grid to Vehicle and Vehicle to Grid “, 2023 IEEE International Conference on Power Electronics, Smart Grid, and Renewable Energy (PESGRE), pp. 1-5, December 2023, DOI:\n10.1109/PESGRE58662.2023.10405221\n.\nP. Sandhya and Dr. Nisha G.K, “Performance Analysis of Various Compensation Topologies in Wireless Power Transfer,” 2022 IEEE International Power and Renewable Energy Conference (IPRECON), Kollam, India, 2022, pp. 1-6, 10059510. December 2022, DOI:10.1109/IPRECON55716.2022.\nSandhya P, Dr. Nisha G.K. “Review of Battery Charging Methods for Electric Vehicle”, IEEE International Conference on Signal Processing, Informatics, Communication and Energy Systems (SPICES), March 2022, pp. 395-400,  May 2022.\nDr. Nisha G.K, Lekshmi P. Nair, “Torque Ripple Reduction And Speed Control of PMSM Using Fuzzy Logic For Propulsion Application”, Proceedings of  the International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022, March 2022, pp: 180 – 186.\nDr. Nisha G.K., Praveen O., “Performance study of Capacitor Clamped Multilevel Inverter fed Induction Motor Drive for Electric Vehicle Application”, Proceedings of  the International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022, March 2022, pp: 7-11.\nDr. Nisha G.K., Stella Kurien, “Current Control with Hysteresis Controller and Sliding mode Controller in SRM”, Proceedings of the International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022, March 2022.\nDr. Nisha G.K., Z. V. Lakaparampil, “Induction Machine Characteristics Control in Field Weakening Region for Propulsion Application”, International Conference on Smart Grid Energy Systems and Control (SGESC-2021), NIT Kurukshetra, 19-21 March 2021, Springer Lecture notes in Electrical Engineering Book Series.\nJeneena Babu, Dr. Nisha G K, “Comparative study of Closed Loop Controlled Parallel Connected Converter Methods for Minimization of Circulating Current”, International Conference on Smart Grid Energy Systems and Control (SGESC-2021), NIT Kurukshetra, 19-21 March 2021, Springer Lecture notes in Electrical Engineering Book Series.\nStella Kurian, Dr. Nisha G K, “Torque Ripple Minimization of SRM Using Sliding mode Current Controller and Torque Sharing Function”, International Conference on Smart Grid Energy Systems and Control (SGESC-2021), NIT Kurukshetra, 19-21 March 2021, Springer Lecture notes in Electrical Engineering Book Series.\nDr. Nisha G.K., Aswin R B “Creating an online virtual environment for Electrical Engineers”, 31st Annual State Convention of the ISTE Kerala Section, January 2021.\nShinoj Philip John, Ajay Sreekumar, Dr. Nisha G.K., “Automatic Engine Start-Stop and Automatic Headlight Dimming Modular System, International Journal of Engineering Research & Technology (IJERT)Vol. 9 Issue 07, July-2020.\nMerin Elsa Zachariah, Dr. Nisha G.K., “Synchrnonous and Asynchronous Switching of Parallel Connected Converters”, International Journal of Information Technology and Electrical Engineering, Vol. 9, No. 3 June 2020.\nMerin Elsa Zachariah, Dr. Nisha G.K., “Circulating Current Control of Parallel Connected Converters”, IEEE 2020 Fourth International Conference on Inventive Systems and Control (ICISC).8-10 Jan. 2020.\nVarsha M, Dr. Nisha G.K., “Book picking robot for Library Assistance”, International Conference on Electrical Engineering and Control Technologies (ICEECT) 2019.\nAkhilraj, Dr. Nisha G.K., “Arduino Based PWM Output Voltage Control of a DC-DC Converter”, 2nd International Conference on Research Trends in Engineering, Applied Science and Management, 2018.\nArya S, Dr. Nisha G K, “Direct and Indirect Space Vector Modulated Matrix Converter”, in the proceedings of IEEE 4th International Conference for Convergence in Technology (12CT), Oct. 2018.\nAkhilraj, Dr. Nisha G.K., “Analysis on speed control of Brushless DC Motor”, International Journal of Research in Electronics and Computer Engineering (IJRECE), Vol. 6, No.3, Sept.2018.\nArya S, Dr. Nisha G K, “Open Loop Control of Matrix Converter fed Permanent Magnet Synchronous Motor”, in the proceedings of IEEE International Conference on New Trends in Engineering And Technology – ICNTET Sept, 2018.\nArya S, Dr. Nisha G K, “Indirect Space Vector Modulation Based Three Phase Matrix Converter”, in the proceedings of IEEE International Conference on Control, Communication and Computing-IC4-2018, July 05 – 07, 2018.\nArya S, Dr. Nisha G K, “Indirect Space Vector Modulated Matrix Converter”, International Journal of Power Systems and Power Electronics- ICRAET-2k18, Vol. 1 No. 1 May, 2018.\nArya S, Dr. Nisha G K, “Direct Torque Control of Matrix Converter Fed PMSM”, in the proceedings of IEEE International Conference on Trends in Electronics and Informatics 2018- ICOEI, May, 2018.\nArya S, Dr. Nisha G K, “Direct Space Vector Modulated Matrix Converter”, in the proceedings of 4th International Conference on Energy Efficient Technologies for Sustainability–ICEETS’18, April, 2018.\nPraveen O, Dr. Nisha G. K., “Analysis of DTC-SVM Neutral Clamped Multilevel Inverter Fed Induction Motor for Water Pumping Application”, in the proceedings of 4th International Conference on New Frontiers of Engineering, Science, Management and Humanities (ICNFESMH-2017), ISSN 2348-117X, vol. 6, Issue 8, August 2017.\nPraveen O, Dr. Nisha G K, “SVM DTC Scheme for Multilevel Inverter fed Induction Motor Drive”, International Journal of Electronics, Electrical and Computational System IJEECS, ISSN 2348-117X, vol. 6, Issue 8, August 2017.\nPraveen O, Dr. Nisha G K, presented paper on “Direct Torque Control of Space Vector Modulated Neutral Point Clamped Three Level Inverter Fed Induction Machine for Fuel Cell Powered Electric Vehicle Applications” in NIT Calicut for MTECH COLLOQUIUM event conducted on 24th 26th May 2017.\nPraveen O, Dr. Nisha G K, presented a paper on “Direct Torque Control of Induction Motor Using Three Level Space Vector Modulation for Electric Vehicle Application” at CET Trivandrum for Present Around the World, IET event conducted on March as part of Drishti 17.\nPraveen O, Dr. Nisha G K, “Open Loop Control of Three Level Space Vector Pulse Width Modulation of Neutral Clamped Multilevel Inverter Fed Induction Motor”, International Journal for Innovative Research in Science & Technology, Volume 3, Issue 11 April 2017.\nPraveen O, Dr. Nisha G K, “Capacitor Clamped Multilevel Inverter Using SVM Induction Motor Drive for Electric Vehicle Application”, in the proceedings of International Conference on Applied Science Engineering and Technology (ICASET) May 2017.\nPraveen O, Dr. Nisha G K, “Comparative Analysis of Capacitor Clamped Multilevel Inverter With and Without Filter Using Three Level Space Vector Pulse Width Modulation”, in the proceedings of 29th International Conference on Instrumentation, Electrical and Electronics Engineering, vol.3, no.1, April 2017.\nPraveen O, Dr. Nisha G. K., “Open Loop Control of NPC Multilevel Inverter Using SVPWM Induction Motor Drive for Electric Vehicle Application”, International Journal of Industrial Electronics and Electrical Engineering, Advance Research Journal of Multidisciplinary Discoveries, vol. 10, no. 1, pp.34-38, Feb 2017.\nPraveen O, Dr. Nisha G K, “Analysis of Neutral Clamped Multilevel Inverter with and without Filter Using Three Level Space Vector Pulse Width Modulation”, in the proceedings of IEEE Sponsered International Conference on Engineering and Technology, pp. 277-283, 16-17 December 2016.\nDr. Nisha G.K. , Z. V. Lakaparampil and S. Ushakumari, “Effect of Power factor on Torque Capability of FOC Induction Machine in Field Weakening Region for Propulsion Systems,” Journal of Electrical Engineering Institution of Engineers (India) Series–B: Springer, pp.1-8, November 2016.\nDr. Nisha G K, Z. V. Lakaparampil and S. Ushakumari, “Torque Capability Improvement of Sensorless FOC Induction Machine in Field Weakening Region for Propulsion Purposes,” Journal of Electrical and Information Engineering: Elsievier, November 2016.\nAkhila .M, Dr. Nisha G K , Ms. Manju Ann Mathews, “Comparative Analysis of Flying Capacitor and Diode Clamped Multilevel Inverters Using SPWM”, International Journal of innovative science Engineering Technology, vol. 3, no. 8, pp. 387-393, August 2016.\nParvathi M.S, Dr. Nisha G K, “Implementation of a Three Phase Inverter with a Front End Diode Rectifier using Average Model”,  International Journal of Advanced Engineering, Management and Science (IJAEMS), vol. 2, issue 8, August 2016.\nPriji P.J, Dr. Nisha G K, Mr. Rejish Babu, “State of the art of three phase to three phase matrix converter for motor drive”, International Journal for scientific research and development,  vol. 4, no. 4, pp. 677-68,August 2016.\nAkhila M, Lekshmi, Dr. Nisha G K, “Analysis and comparison of flying capacitor and modulator multilevel converter using SPWM”, International Journal of innovative Research and Advanced studies (IJIRAS),  vol. 3, no. 8 ,pp. 352-357, July 2016.\nParvathi M.S, Dr. Nisha G K, “Various Modeling methods for the analysis of three phase diode bridge rectifier and three phase inverter”, International Journal for scientific research and Engineering studies,  vol. 3, no. 7, pp. 21-28 , July 2016.\nParvathi M.S, Dr. Nisha G K, “Comparison on the Average Model of a Three Phase Inverter with its Modified Nodal Analysis Method”, International Journal of Current Engineering and Scientific Research (IJCESR), ISSN (Print): 2393-8374, (Online): 2394-0697, Volume-3, Issue-7,  DoI:10.21276,  July 2016.\nParvathi M.S, Dr. Nisha G K, “Modeling of Interior Permanent Magnet Synchronous Motor using Transient Simulation Techniques”, IJISET- International Journal of Innovative Science, Engineering & Technology, Vol. 3 Issue 7, ISSN (Online) 2348 – 7968, July 2016.\nAkhila M, Dr. Nisha G K, “Total Harmonic Distortion Analysis of Diode Clamped Multilevel Inverter with resistive and Inductive Load”, International Journal for Scientific Research and developement, vol. 4, Issue 04, ISSN (online): 2321-0613, June 2016.\nParvathi M.S, Dr. Nisha G K, “State of Art of PMSM Speed Control Using DTC and FOC Techniques”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, Vol. 5, Issue 6, June 2016.\nStella Kurian, Dr. Nisha G K , “Torque Ripple Minimization of SRM using Torque Sharing Function and Hysteresis Current Controller”, in the proceedings of 2015 International Conference on Control, Communication and Computing India (ICCC) at College of Engineering, Trivandrum on 19th to 21st November 2015.\nStella Kurian, Dr. Nisha G K, “Closed Loop Operation of Switched Reluctance Motor with Hysteresis Controller”, International Journal of Applied Engineering Research, Vol. 10, Nov. 17, pp 37645-37650, September 2015.\nDr. Nisha G K  and Ms. Stella Kurien published research paper titled “Closed loop operation of switched reluctance motor with Sliding Mode Current Controller”, International Journal of Applied Engineering Research, ISSN 2348-7968, Vol. 10, Issue 3, pp. 43407–43411, July 2015.\nDr. Nisha G K and Ms. Stella Kurien published research paper titled “Open Loop Operation of Switched Reluctance Motor With R Dump Converter”, International Journal of Electrical and Electronics Engineering Research, ISSN 2348-7968, Vol. 5, Issue 3, pp. 51-60, June 2015.\nDr. Nisha G K and Ms. Stella Kurien published research paper titled “Open Loop Control of Switched Reluctance Motor Using Theta Position Sensing”, International Journal of Innovative Science, Engineering and Technology, ISSN 2348-7968, Vol. 2, Issue 3, March 2015.\nDr. Nisha G.K, Mr. Z V Lakaparampil and Ms. S Ushakumari published a paper entitled “Effect of Leakage Inductance in Torque capability of Field Oriented Controlled Induction Machine in field weakening region” in the proceedings of International Conference on Advances in Engineering and Technology, Singapore, March 2014.\nDr. Nisha G.K, Mr. Z V Lakaparampil and Ms. S Ushakumari published a paper entitled “Four quadrant operation of Field weakened FOC Induction motor drive using Sliding Mode Observer”, Transactions on Engineering Technologies: Special volume of world Congress on Engineering, Springer Publications 2014.\nDr. Nisha G.K, Z. V. Lakaparampil and S. Ushakumari, “Sensorless Field Oriented Control of SVM inverter fed Induction Machine in Field Weakening Region using Sliding Mode Observer”, in the proceedings of 7th World Congress on Engineering (WCE’2013), Imperial College, London, U.K., pp. 1174-1181, 3-5 July 2013.\nDr. Nisha G.K, Z. V. Lakaparampil and S. Ushakumari, “Performance Study of Field Oriented Controlled Induction Machine in Field Weakening using SPWM and SVM fed Inverters”, International Review of Modelling and Simulations, vol.6, no. 3, pp.741-752, June 2013.\nDr. Nisha G.K, Z. V. Lakaparampil and S. Ushakumari, “FFT Analysis for Field Oriented Control of  SPWM and SVPWM Inverter fed Induction Machine With and Without Sensor”, International journal of Advanced Electrical Engineering, vol.2, no.4, pp. 151-160, June 2013.\nDr. Nisha G.K, Z. V. Lakaparampil and S. Ushakumari, “FFT Analysis for Field Oriented Control of  SPWM and SVPWM Inverter fed Induction Machine With and Without Sensor”, in the proceedings of International conference on Advance Engineering Technology(ICAET’13), Mysore, India,  pp. 34-43, 27 January 2013.\nDr. Nisha G.K, Z. V. Lakaparampil and S. Ushakumari, “Sensorless Vector Control of SVPWM Inverter fed Induction Machine using Sliding Mode”, in the proceedings of IEEE International conference on Green Technology (ICGT’12), Thiruvananthapuram, India, pp. 29-36, 18-20 December 2012.\nDr. Nisha G.K, S. Ushakumari and Z. V. Lakaparampil “CFT Based Optimal PWM Strategy for Three Phase Inverter”, in the proceedings of IEEE International conference on Power, Control and Embedded Systems (ICPCES’12), Allahabad,India, pp. 1-6, 17-19 December 2012.\nDr. Nisha G.K, S. Ushakumari and Z. V. Lakaparampil “Harmonic Elimination of Space Vector Modulated Three Phase Inverter”, Lecture Notes in Engineering and Computer Science: in the Proceedings of the International Multi-conference of Engineers and Computer Scientists 2012, (IMECS 2012), Hong  Kong, pp.1109-1115, 14-16 March 2012.\nDr. Nisha G.K, S. Ushakumari  and Z. V. Lakaparampil “ Method to Eliminate Harmonics in PWM: A Study for Single Phase and Three Phase”, in the proceedings of International conference on Emerging Technology, Trends on Advanced Engineering Research, Kollam, India, pp. 598-604, 20-21 February 2012.\nDr. Nisha G.K, S. Ushakumari and Z. V. Lakaparampil “Online Harmonic Elimination of SVPWM for Three Phase Inverter and a Systematic Method for Practical Implementation”, IAENG International Journal of Computer Science, vol.39, no.2, pp.220-230, May 2012.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nOne PhD Scholar admitted in 2021.\nMs. Sandhya P.\n[email protected]\n,\nWireless Charging in EV\nAcademic / Professional Outreach Activities\nIQAC Coordinator (From 31.05.2024 onwards)\nTechnical Program Chair – IEEE International Conference on E-Mobility, Power Control and Smart Systems ICEMPS 2024, 18 – 20 April 2024 .\nAssistant IQAC Coordinator (2023-2024)\nKTU Valuation Camp Officer (From 2018 onwards)\nKTU Valuation Assistant Camp Officer (2017-2018)\nApproved KTU Research Supervisor\nAcademic Council Member\nCollege Council Member\nHead of the Department (14.10.2020 to 31.10.2023)\nAssistant HoD (2017 – 2020)\nDisciplinary Action Committee Chair Person (from 01.11.2023 onwards)\nSession Chair for Conferences and ISTE Faculty convention\nGREENROOM, Kerala’s biggest STARTUP-SME Conclave-Committee Member\nKTU B.Tech Curriculum Committee Member\nKTU- Internal Audit Coordinator (2015 -2018)\nPEDES 2016 International Conference – Main coordinator\nIEDC – Nodal officer 2014- 2016.\nContribution as Peer Reviewer\nIEEE Transaction on Industrial Electronics\nElsevier Journal Energy\nElectric Power Systems Research\nJournal of Institution of Engineers, IE\nPhysical Science International Journal\nIEEE International Electric Machines and Drives (IEMDC)\nNational Conference NCTT at CET and GEC\nInternational Conference on Applied Mechanics and Optimization\nInternational Conference on Communication Network (Com Net 2019)\n6th International Conference on Control, Communication and Computing\nInternational Conference on Emerging Technologies for Intelligent Systems (ETIS 2025)\n2024 IEEE International Conference on Power Electronics, Drives and Energy Systems\n2024 IEEE International Conference on Power Electronics, Drives and Energy Systems\nIEEE International Conference on Innovations in Science and Technology for Sustainable Development 2022\nContribution as\nResource Person\nRajadhani Institute of Engineering and Technology\nVisual Aids in E classroom\nMar Baselios College of Engineering and Technology\nPlug in Hybrid Electric Vehicle, V2G Technology, Electric Motor Control for E Vehicle\nFinite Element Method\nTechnical Journal Writing\nSpace Vector Modulation\nDC Armature winding – LAP\nSt Xavier’s Catholic College of Engineering\nSwitched Reluctance Motor Drives\nMarian Engineering College, Kazhakkuttam\nElectric and Hybrid Vehicles\nFuture Scope in Electrical Engineering\nThree Phase Transformer\nGovernment Engineering College Kannur\nElectric Vehicle Overview\nInstitute of Engineers\nPlug in Electric Vehicle\nASAP, and Dept of Higher Education, Kerala\nhttps://youtu.be/e8vK7inNZbA\nhttps://youtu.be/IDF10nVUpAU\nhttps://youtu.be/YhQ0l0_NGeU\nhttps://youtu.be/FO8VuKa2W1U\nhttps://www.youtube.com/watch?v=MHYBwS9NTl4\nMembership in Professional bodies/ organizations\nIEEE (Senior Member) , ISTE, IAENG,,WSSET\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\nHas been selected as one of the Core Committee Members in the IEEE India Council Industry Academia Young Professionals Committee (IAYPC) 2025.\nDistinguished Faculty award from Venus International Foundation at a function in Chennai on 15 July 2023.\nCertificate of Excellence in reviewing in recognition of her outstanding contribution to the quality of the Journal of Engineering Research and Reports, indexed in Ebsco, Proquest, Index Copernicus and Google Scholar.\nIEDC Nodal officer Award in 2016 (our college has been selected as one of the first 25 colleges from among 147 colleges)\nCompleted Ph D under Special Post Graduate Engineering Empowerment on IT Drive (SPEED- IT) scholarship Scheme from Kerala state IT Mission.\nBest Paper Award International Conference on Advanced Engineering and Technology held at Mysore, 27th January 2013.\nCertificate of Merit (Student) Award\nIAENG International Multi Conference Engineers and Computer Scientist (Electrical Engineering) held at Hong Kong, 14-16 March 2012).\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}