{
    "filename": "mbcet.ac.in_faculty_dr-priya-mariam-raju_.html",
    "content": "Dr. Priya Mariam Raju – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nComputer Science & Engineering\n>\nDr. Priya Mariam Raju\nEmployee Code / ID No.\n10223056\nQualifications\nPh.D.(Image Processing, Computer Vision, Machine Learning), M. Tech in CSE. B. Tech in CSE\nOrcid ID\n0000-0002-3203-0226\nIndustry / R & D Experience\nFull Time Research (5 years)\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9497327318\nAreas of Interest / Current Research\nImage Processing, Computer Vision, Machine Learning, Deep Learning\nResearch,  Consultancy, Publication\nPriya Mariam Raju, Deepak Mishra, and Prerana Mukherjee. “DA-SACOT: Domain-Adaptive Segmentation guided Attention for Correlation based Object Tracking” Image and Vision Computing, May 2021. (Impact Factor: 4.7, SCI Indexed)\nPriya Mariam Raju, Deepak Mishra, and Rama Krishna Sai S. Gorthi. “Detection based long term tracking in correlation filter trackers.” Pattern Recognition Letters 122 (2019): 79-85. (Impact Factor: 5.1, SCI Indexed)\nPriya Mariam Raju, and Madhu S. Nair. “Copy-move forgery detection using binary discriminant features.” Journal of King Saud University-Computer and Information Sciences (2022).(Impact factor: 6.9, SCIE Indexed)\nRout, L., Priya Mariam Raju., Mishra, D., Gorthi, R. K. S. S. (2018, December). Learning Rotation Adaptive Correlation Filters in Robust Visual Object Tracking. In Asian Conference on Computer Vision (pp. 646 – 661). Springer, Cham.\nPriya Mariam Raju, Mishra, D., and Subrahmanyam, G. R. K. S. (2018, December). Bag of Visual Words based Correlation Filter Tracker (BoVW-CFT). In Proceedings of the 11th Indian Conference on Computer Vision, Graphics, and Image Processing (pp. 1-9).\nKristan, Matej, et al. “The sixth visual object tracking VOT2018 challenge results.” Proceedings of the European Conference on Computer Vision (ECCV) Workshops (2018).\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}