{
    "filename": "mbcet.ac.in_departments_electrical-electronics-engineering_activities_.html",
    "content": "Activities – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nDepartments\n>\nElectrical and Electronics Engineering\n>\nActivities\nActivities\nDepartment Activities\nIllumina - The Department Association\n2024 – 2025\nIllumina Activities\nMAGAZINE RELEASE\nIllumina, the Association of Department of Electrical and Elctronics Engineering successfully published its magazine for the Odd Semester 2024–25. The magazine highlights various departmental activities, student achievements, and technical articles contributed by both students and faculty. It was officially released by Dr.S. Viswanatha Rao, Principal, during a special event held on 02 April 2025.\nILLUMINA ACADEMIC EXCELLENCE AWARD 2025 (EVEN SEM)\nIllumina Academic Excellence Award\nis presented to toppers of each semester who have secured highest SGPA in the previous semester. The award consists of a memento and e-certificate. This year, the event was conducted on 2\nnd\nApril 2025 at 12:30pm in Faraday Hall. Dr. S. Viswanatha Rao, Principal and Dr. Elizabeth Varghese, Head of the Department, distributed the awards to the toppers of each semester. The event was anchored by Mr. Adwaith of S4EL. Academic Excellence Award 2025 (Even Sem) winners: Akhil V., S8 EEE (S7 SGPA: 9.87), Thamanna Prasanth, S6 EL (S5 SGPA: 9.48), Aaron Joseph, S6 EEE (S5 SGPA: 9.09), Ryan Mathew Manual, S4 EL (S3 SGPA: 10), Ananthakrishnan H., S4 EE (S3 SGPA: 9.81), Ananthakrishnan A. A., S2 EEE (S1 SGPA: 9.67) and Adwaith A., S2 EL (S1 SGPA: 9.61). Ryan Mathew Manual was also given a cash prize of Rs500/- for securing SGPA 10. Following the prize distribution ceremony, the Principal warmly congratulated all the winners and inspired the students to strive for even greater accomplishments in the future. The HoD also commended Team Illumina for successfully organizing the event.\nS8 PROJECT EXPO\nThe Department of Electrical and Electronics Engineering, under its association Illumina, successfully hosted the much-anticipated\nProject Expo\non 28 March 2024. This exhibition of final-year projects provided students with a platform to present their innovative ideas and technological expertise. The exhibition was evaluated by\nMr. Mahesh P,\nSenior Manager – R&D at Hykon India Ltd and\nDr. Remil George\n, HoD, Department of Mechanical Engineering, MBCET.\nMINI PROJECT EXPO\nThe Department of Electrical and Electronics Engineering organized a Mini Project Expo on 24th April 2025 for the S6 EEE students, as part of the 2022 revised curriculum which introduced the Mini Project in the sixth semester. Students presented innovative hardware working models, showcasing their technical skills and creativity. The event witnessed enthusiastic participation, and two teams were jointly awarded the first prize, sponsored by Illumina. The expo was successfully coordinated by Mr. Midhun G.\nIllumina – Association of the Department of Electrical and Electronics Engineering has initiated a Mentorship Programme involving selected students from S3 and S5 to assist S1 students in improving their programming skills in C. This mentorship program is conducted after regular college hours from 4.30 pm to 5.30 pm.\nIllumina\n, Association of The Department of EEE organized a staff food fest. Three groups were formed and the members arranged lunch including home made dishes. This helped in team building and increasing the bond amongst all members of EEE department.\nThe Department actively engages in updating its technical skills and knowledge and foster Industry – Institution interaction through various technical activities of the Electrical Engineering Students association-‘ILLUMINA’. The technical association of Electrical and Electronics Engineering of MBCET, ‘ILLUMINA’ started its journey on 4\nth\nMarch 2005. Talks by experts from various organizations, debates, technical quizzes, paper presentations, etc. conducted by the Association ensure constant motivation and encouragement to the students for their overall development of personality and technical exposure. Apart from this, as a part of social commitment, the students voluntarily take part in charity programmes.\nFaculty in charge of ILLUMINA:\nMs. Manju Sreekumar and Ms. Shilpa Susan Peter\nACADEMIC AWARD\nIllumina, the Association of Electrical and Electronics Department felicitated the best academic performers of previous semester with\nAcademic Excellence Award 2024\n. Event was conducted at Faraday hall of Electrical and Electronics department on 7th October 2024. The award recipients were\nAkhil V\n. (S7 EEE, 10 SGPA),\nNandana Krishna\n(S5 EL, 9.64 SGPA),\nAaron Joseph\n(S5 EEE, 9.55 SGPA),\nPratyusha N. Nair\n(S3 EL, 9.18 SGPA),\nAnanthakrishnan\n(S3 EE, 9.33 SGPA), and\nRincy Reji\n(S3 EEE, 9.33 SGPA).\nDr APJ Abdul Kalam 7th Energy Quiz winners\nIn the\nDr. APJ Abdul Kalam 7\nth\nEnergy Quiz\norganized by the KSEB Engineers’ Association at Mar Baselios College of Engineering and Technology,\nAbhishek A\nfrom S5 EEE secured first place. The second prize was shared by\nAkarsh R\n(S5 EEE),\nArif A\n(S5 EEE), and\nDevadathan J Nair\n(S7 EEE). The event was coordinated by Illumina, the Association of the Department of Electrical and Electronics Engineering.\nPOWER QUIZ BY KSEB\nPreliminary Round of\nPower Quiz\nwas coordinated by\nIllumina\n, the Association of the Department of EEE on September 26th (Thursday) at 1pm in Faraday Hall. The quiz was organized by KSEB officers Association. A total of 49 students participated in the quiz. Basil Anil of S7 EE1 and Jason E of S7 EC2 were selected for the District level round.\nDr APJ Abdul Kalam 7th Energy Quiz\nCollege level competition of the Dr. APJ Abdul Kalam 7\nth\nEnergy Quiz was coordinated by Illumina, the Association of the Department of EEE on September 6th (Friday) at 1pm in Faraday Hall. Ms Sreelekshmi L, Assistant Engineer, and Ms Pushpalatha, Assistant Executive Engineer, KSEB  conducted the quiz. 26 students participated in the event.\ntalk on GATE 2025\nIllumina, Association of the Department of EEE, organized a\ntalk on GATE 2025\nfor S5EE students on 21/08/2024 at 3.30pm and for S5EL students on 04/09/2024 at 11.30am. Mr Jararaman V,  HR Head and Advisor, CGP Career Avenues, TVM was the resource person.\nSPACE WEEK CELEBRATION\nAs part of space week celebrations Illumina, the Association of Electrical and Electronics Engineering department organised 5 events (i) Knowhere (phase 1) (ii) Universe in a Nutshell (iii) Adhara (iv) Knowhere (phase 2) and (v) Literary review. All the events were centered on the theme “space”.\nEVENT 1 & 4 : KNOWHERE (Phase 1 and 2)\nKnowhere\nwas the first event which is a quiz competition based on space and its happenings. The event was jointly organised by Illumina, the Association of Department of Electrical and Electronics Engineering and E-Nix, the Association of Department of Electronics and Communication Engineering with Space Club, MBCET. The student coordinators of the event were\nAnn Santhosh\nand\nRohin Sabu\nof S7 ECE and\nArif A, Abhishek A\nand\nAdithya S\nof S5 EEE. The faculty coordinators were\nMs. Manju Sreekumar\nand\nMs. C. Sojy Rajan\n, EED and\nMs. Swapna PS\nand\nMs. Shiras S N\nECE. 1st prize was secured by\nMerlin Reji\nand\nJishnu EV\n, 2nd prize:\nElvis Mathews\nand\nBhavya R Biju\nand 3rd prize:\nAvin J.\nand\nUdith Krishna\nThe Knowhere team\nEVENT 2: UNIVERSE IN A NUTSHELL\nThe event was a lecture session handled by Mr. Adithya S., student of S5 EEE, MBCET. The event was organised by Illumina, Association of Electrical and Electronics Engineering along with the Space Club of MBCET. The co-ordinators of the event were\nAdithya S.\n, S5 EEE along with the faculty coordinators,\nMs. Manju Sreekumar\nand\nMs. C. Sojy Rajan\n, Dept. of EEE.\nEVENT 3: ADHARA\nAdhara was the second and most eye-catching event of the series including space model exhibitions of all the well renowned missions performed by space centres across the world, hosted by the students of S5 EEE. The event was inaugurated by Rev. Fr. John Varghese, Director, MBCET and Dr. S Viswanatha Rao, Principal, MBCET. The models were hand made by the students of S5 EEE with the help and support from the faculty coordinators,\nMs.Manju Sreekumar , Ms. C. Sojy Rajan\nand\nMs. Shilpa Susan Peter.\nThe students selected renowned space missions and created precise replicas of them within a time span of 3 days. The models included PSLV, GSLV, Starship, Falcon Heavy, S1 Block, Lander, Saturn V, Chandrayaan Rover, Aryabhata, etc. The Expo was open to all students and faculty at MBCET and featured two main attractions: the detailed models of various space missions and a digital showcase that included the sounds of different planets, a live trajectory view of satellites from NASA, and other informative videos about rocket science.\nThe event also had a special book exhibition which consisted of science-fictional books which also grabbed the attention of the spectators. The team was able to bring about a different atmosphere to the expo by setting the adequate lighting and sound systems.\nTeam Members: Rakesh R., Adithya S., Abhishek A.,  Abhinav S. B., Adil N., Adithyan Ganesh, Adithyan R. J., Amal Nazerudin, Gokul Krishna S. M., Prithvi M., Akarsh A., Harishankar A. S., Arif A. and Devika C.\nEVENT 5: LITERARY REVIEW\nThe event centred on students’ opinions about various space-related books and movies. It featured discussions on space-themed movies and literary reviews of books related to space. Faculty coordinators:\nMs. Manju Sreekumar, Ms. C. Sojy Rajan.\nBOOK DONATION CAMPAIGN\nIllumina, The Association of Department of Electrical and Electronics Engineering in association with NSS MBCET celebrated National Reading Day on June 19\nth\n, 2024. As an outreach activity, around 100 books were donated to the students of St. Goretti School, Nalanchira. The students were directed to read the books and write a short review on the same. The best review will be awarded cash prize.\n2023 – 2024\nIllumina displayed a motivational video on the life story of Steve Jobs as a part of promoting best practices in the Department on 15\nth\nMarch 2024.\nIllumina, the Association of Department of EEE in collaboration with IEEE PES SBC MBCET conducted an expert talk on the topic, “Renewable Energy Integration to Electric Grid with Battery Energy Storage” on 13 December 2023 for the final year EEE students. The resource person was\nSukumar Kamalasadan\n, Professor and Distinguished Scholar, Department of Electrical and Computer Engineering, The University of North Carolina, Charlotte.\nIllumina, the Association of Department of EEE along with NSS Units 230 and 706, Phoenix Trivandrum NGO organization and Enix, the department association of ECE, conducted blood donation camp on 30 November 2023. Sri Brahmanaykam Mahadevan inaugurated the session. More than 68 volunteers registered for the camp and 39 students have donated the blood in the camp.\nOUTREACH\nIllumina in association with NSS distributed 85 food packets at medical college on 15 September 2023.\nIllumina in association with EEE 2016-20 Alumni Batch sponsored the electrification works of a house at Mannanthala during August 2023.\n2022 – 2023\nAWARENESS TALK\nIllumina organized an awareness talk on “Drug abuse” for the first year students of the Department of Electrical and Electronics Engineering on\n31 May 2023\n. Mr. Sunil Kumar, Sub Inspector, Excise Department, Nalanchira was the speaker. Around 90 students attended the talk. The session was coordinated by\nMs. Manju Sreekumar and Mr. Anil J.\n, Assistant Professors, EED.\nIllumina organized an awareness talk on “Drug abuse” for the third year students of the Department of Electrical and Electronics Engineering on\n20 May 2023\n. Mr. Deepu S R, Excise Range Officer, Nalanchira was the speaker. Around 70 students attended the talk. The session was coordinated by\nMs. Manju Sreekumar and Ms. Shilpa George\n, Assistant Professors, EED.\nPROJECT EXPO\nIllumina organized a Project Expo – an exhibition of final year projects on 29 May 2023 in the Faraday Hall. Mr. Midhun M S, (Alumnus, 2016-2020 EEE batch), Engineer, Veli Research Centre, ISRO and Mr. Vishnu M. Nair, (Alumnus, 2017-2021 EEE batch), Data Scientist, Siemens were the guests for the day. Two best projects were awarded a cash prize of Rs. 3000/-.\nHANDS-ON SESSION\nIllumina, the Association of Department of EEE, organized a three-day hands-on session on Arduino and Robotics for school children of 10th, 11th and 12th standards from 24 to 26 May 2023. The sessions were handled by Mr. Anil Kumar, Project Engineer, MBCET and there were 22 participants from various schools in the city. The last day included a competition where each group had to interface the sensors to a robotic car and control it using a mobile app. A prize money of Rs. 5000/- was handed over by the Principal Dr. Abraham T. Mathew at the valedictory function.\nOUTREACH\nIllumina\nin association with Women Studies Unit distributed Stationery, caps and sweets to the students of Shalom special school on 9/3/2023.\nIllumina\ndistributed 200 lunch packets in the premises of Trivandrum Medical College on 3 April 2023. Faculty members also accompanied the team.\nEXPERT TALKS\nIllumina and IEEE PES MBCET in association with Global Study Link conducted a session on “\nHigher Education prospects in UK\n” for the students of Department of Electrical and Electronics Engineering on 23 January 2023.\nThe EV Research Group in association with Illumina, the Association of the Department of Electrical and Electronics Engineering, organized an Online Expert Talk on “\nOverview of EV environment and Opportunities\n” on 25/11/2022 from 10:30 am to 12:00 pm. The Resource person for the session was Mr. Ramesh G, Consultant, Manatec E-Drive. Around 40 participants attended the session.\nCoordinators\n: Mr. Aswin R B (94473 29628), Dr. Dishore S. V. (77087 57675), Assistant Professors, EED.\n2021 – 2022\nIllumina Execom Members\nBEST ACADEMIC PERFORMER AWARD\nIllumina organized a\nBest Academic Performer Award\nfor the students. The award is given to one student from each class of every semester who got the highest marks in the previous year University exams. The awards were distributed by Principal, Dr. Abraham T Mathew, on July 22, 2022 at 12:45 pm in Faraday Hall. The faculty and students of the department attended the function.\nThe following students received the award:\nMs. Alma Anna Babu (S8 EE1)\nMs. Riya Mary Jacob (S8 EE2)\nMr. Joshua Radeen (S6 EE1)\nMs. Bismi B A (S6 EE2)\nMs. Bhadra P (S4 EE1)\nMs. Leenu Elizabeth Jacob (S4 EE2)\nMr. Akhil V (S2EE)\nSocial service\nIllumina in collaboration with IEEE PES Student Chapter\nvisited Ananda Nilayam Orphanage and Widow’s Home on\n30 May, 2022\n. The partnership was successful in their endeavour to distribute stationery and other essential commodities required for school to the young students of the children’s home.\nIllumina\nprovided Mixer grinder, Diapers and basic essentials to ‘Care Home’ for the old aged who were mentally ill and later abandoned by the family. The members also had an interaction with the inmates.\nInteraction with Final year students\nAn Interaction with Final year students on Projects was organized by Illumina on March 9, 2022 from 10.30 am to 11.30 am.\nMr. Mohammad Aslam\n, CEO, InQbe innovations Pvt Ltd., Kaloor, Kochi was the resource person.\nSocial service\nIEEE PES Student Chapter in association with Illumina\ncontributed to a noble cause as a part of Social Service by reaching out to Balika Bhavan, Thiruvananthapuram on\n15 January 2022\n. The team comprising of faculty and student representatives from the department handed over daily essentials to the inmates\n2012-16 EEE Alumni batch in association with Illumina\ncontributed to a noble cause as a part of Social service by completing the Electrification work (Wiring and Installation) of a house at Mannamoola during December 2021\nOnline Symposium – Urja Pariraksh\nAssociation of Department of EEE, Illumina takes pride in associating with KSEB Ltd and Energy Management Centre to organize an online Symposium – Urja Pariraksh, an expert webinar series followed by a competition which is open to students from class 9\nth\n. The purpose of this event is to educate the participants the practice of electrical energy savings. This campaign is conducted as a series of short interactive sessions wrapped around a competition. The total prize money is worth Rs. 20,000/- sponsored by Vydyuti Energy Services (VES). 531 participants registered for the programme.\nFaculty coordinators:\nMs. Manju Sreekumar and Ms. Keerti S Nair\n.\nThe symposium was formally inaugurated by\nSri. N S Pillai\n, Chairman and Director of KSEB Ltd. on 3 July 2021 at 10:00 am.\nDr. R Harikumar\n, Director, Energy Management Centre was the invited guest. HoD of EEE Dept,\nDr. Nisha G K\ndelivered the presidential address.\nPrincipal Dr. Abraham T Mathew\n, and\nMr. Anooop Babu\n, Founder, Vydyuti Energy Services gave the felicitations.\nThe first Webinar of the series was handled by\nMr. F. R. Rejish Babu\n, Assistant Professor, EEE Department, MBCET on the topic  “General awareness on Energy consumption of Home appliances” on\n4 July 2021\nfrom 11:00 am to 11:45 am IST. The speaker gave an awareness on the different electricity tariff rates and also discussed the energy consumption of various devices used at home. The session was very informative and interactive.\nThe second webinar of the online Symposium Urja Pariraksh was held on 17 July 2021 on the topic “\nEnergy Efficient Domestic Appliances\n”. The session was handled by\nMr. Johnson Daniel, Head (NMEEE & DSM) Division, Energy Management Centre\n, on how to conserve electricity with better rating appliances. Many queries were raised by the participants. The webinar was streamed live on YouTube from 7 pm onwards. The session was followed by “Energy Shots 2”, a webinar quiz series and two winners were given cash prize.\nThe third webinar of the online Symposium was held on\n01 August 2021\non the topic “WSS Portal and its importance”. The session was handled by\nMr. Manoj Mathew Kuriakose, Assistant Executive Engineer (IT), IT (Computerisation Unit), KSEBL, Vydyuthi Bhavanam\n. The participants were introduced to the various services offered by the web self service and how they could view the energy consumption rate bi monthly. Many queries were raised by the participants. The webinar was streamed live on YouTube from 7 pm onwards.\nThe fourth webinar of the online Symposium was held on 15 August 2021 on the topic “Solar panel installation and feasibility for homes”.\nThe session was handled by Mr. Arun S Mathew, Assistant Professor, Department of Electrical and Electronics Engineering, LBS College of Engineering, Kasaragod (A Govt. of Kerala Undertaking), which was streamed live on YouTube from 7 pm onwards. The speaker explained about the installation process of PV panels and also discussed about its feasibility for the households.\nThe fifth webinar of Urja Pariraksh, an online symposium conducted by Illumina, the association of Electrical and Electronics department was held on 4 September 2021. The session was handled by\nMr. Adithya S\n, Lighting Designer (Specialised in architectural lighting design, MBCET EEE Alumni). The webinar was on the topic “How to Save Energy on Lighting”. The session focused on how to do proper lighting, comparison of different types of lights, provided tips on how to save energy. Many queries were raised by the participants. The webinar was streamed live on YouTube from 5pm onwards. The webinar was followed by  “Energy Shots 5”, a webinar quiz series with 64 participants\nThe sixth webinar of Urja Pariraksh, an online symposium conducted by Illumina, the Association of the Department of Electrical and Electronics Engineering, was streamed live in You Tube on 18 September 2021. The session was handled by\nDr. Nisha G. K\n, Professor and HoD of the Department of Electrical and Electronics Engineering, Mar Baselios College of Engineering and Technology, Trivandrum. The webinar was on the topic “Introduction to Electric Vehicle”. The session focussed on the working of electric vehicles explaining the different components and the type of batteries used in it. The talk also explained the various methods of charging an EV. The webinar was followed by “Energy Shots 6”, a webinar quiz series with 50+ participants. Overall, the session received a lot of positive feedback from the participants\nThe seventh and final webinar of Urja Pariraksh, an online symposium conducted by Illumina, the association of Department of Electrical and Electronics Engineering was streamed live in YouTube on 2 October 2021. The session was handled by Mr. Abraham Johnson, Managing Director at GIG Automation. The webinar was on the topic “Energy Efficiency by Automation”. The session focussed on home automation and the speaker explained how energy can be saved due to automation. The webinar was followed by “Energy Shots 7”, a webinar quiz series with 45 participants. Overall, the session received a lot of positive feedback from the participants.\nThe closing ceremony of the intensive 4 month online symposium ‘Urja Pariraksh’ organised by Illumina, the Association of the Department of Electrical and Electronics Engineering, was held on 8 November 2021 at 4 pm in Senatus hall which was aired live in Illumina Youtube channel. Bursar Fr. John Vilayil, Principal Dr. Abraham T Mathew, HoD Dr. Nisha G. K. and Mr. Akhil Dev, representative of our title sponsor Vydyuti Energy Services were the dignitaries. The winners of Energy shots (quiz) and the competition winners were awarded cash prize and certificates. Mr. Ullas Unnikrishnan, St Thomas College of Engineering and Technology, Chengannur bagged the first prize amount of Rs. 10,000/-. Ms. Aparna Raj, EED, MBCET was the first runner up winning a cash prize of Rs. 5000/- and Mr. Arun C. K., LBS College of Engineering, Kasargod bagged Rs. 3000/- as the second runner up. 31 Contestants were awarded Consolation prizes for saving. energy units.\nILLUMINA SCIONS\nIllumina, the Association of Department of Electrical and Electronics Engineering, decided to organize a series of Interactive sessions with the prolific EEE alumni of MBCET by the name ‘\nILLUMINA SCIONS\n’. The first session on Friday, 4\nth\nof December 2020 had overwhelming participation.\nRead More…\n2020-2021\nSocial service\nIllumina is contributed to a noble cause as a part of Social service by completing the Electrification work (Wiring and Installation) of a house of one of the members of our MBCET family with the support of the Faculty and the Technical staff during June 2021.\nSUSTAINABLE TOGETHER\nThe Department of EEE organized an online video competition of making creative/practical products from discarded objects. This event was open for the students of all Departments of MBCET. The valuation was based on the raw materials used, usefulness of the end product, and Prototype/Aesthetics of the product. Of all the entries received, first prize of Rs. 1000/- was bagged by Mayoorika Venu of S3 EE2. Arya A. of S3 EE1 secured the second prize of  Rs. 750/- and the third prize of Rs. 500/- was won by Amritha S. of S3 EC1.\nFaculty coordinator\n: Ms. Manju Sreekumar, Assistant Professor, EEE.\nStudent Coordinators\n: Ms. Gowri B K (S7 EE2) and Mr. Sai Kiran (S5 EE2).\nDEMONSTRATION AND TRAINING ON HANDLING FIRE EXTINGUISHERS\nThe Electrical Maintenance Cell of MBCET in association with Illumina, conducted a Demonstration and Training on Handling Fire Extinguishers for the entire staff of MBCET, as part of Safety Awareness measures, on 8 and 9 February 2021. The session was handled by\nMr. Aswin R. B.\n, Assistant Professor, EEE and the Technical staff of EEE.\nCoordinator\n: Mr. F. R. Rejish Babu, Assistant Professor, EEE\nWebinar on Introduction to Substation and Switchyards\nIllumina organized a Webinar on Introduction to Substation and Switchyards, an industrial topic dealing with Real time design and operations on 23 January 2021 from 11:00 AM to 12:15 PM (IST) in Google Meet. The event was open to S5 and S7 Students. The Resource Person was Mr. Abhinab Sahoo, Sr. Engineer Electrical Design, Chint India Energy Solutions.\nInteractive Session\nIllumina, the Association of Department of Electrical and Electronics Engineering organized an Interactive Session with Ms. Anjali Prasad, Consulting Psychologist and Clinical Hypnotherapist, for all the students of the department on\n9/1/2021 at 7 pm on WebEx platform.\nWebinar on\nWhat After B.Tech\nIllumina in association with the Department Placement Committee organized a Webinar on What After B.Tech on 8 January 2021 from 03:00 pm to 05:00 pm in Google Meet platform.\nCoordinator: Mr. Ajish Ashok (Assistant Professor, EEE)\n2019-2020\nWebinar on Rethink Your Future: Opportunities in Post – Covid’19 Kerala\nManju Sreekumar and Ms. Keerti S Nair coordinated a 1-day Webinar on\nRethink Your Future: Opportunities in Post – Covid’19 Kerala\non 07 April 2020. Resource Person: Mr. C Balagopal, Founder of Penpol Ltd\nWorkshop on Artificial Intelligence and Python\nILLUMINA organized a Workshop on Artificial Intelligence and Python by Robotix Institute on 29 February 2020 for the students of MBCET. The workshop was coordinated by Illumina Faculty coordinators Ms. Manju Sreekumar and Ms. Keerti S. Nair and student coordinators Mr. Jerin Sam James (S8 EE1) and Akhil (S8 EE2).\nTalks conducted\nILLUMINA organized a talk on “Effective use of IEI Engineering Advancement for Nation Building” by Er. Shaji Jacob MIE on 14 February 2020 for first, second and third year EEE students.\n2018-2019\nSession on “TLC Methodologies”\nA session on different “TLC methodologies” was conducted in the EEE department organized by ILLUMINA. The session was handled by Ms. Elizabeth Varghese for the department faculties on 2nd July 2018. The session gave all the faculties an idea on how to incorporate Active Collaborative Learning (ACL) in the coming semesters for various courses.\n2017-2018\nTalk on Career Opportunities and Higher Education Prospectus\nAs part of department initiated invited lecture series, Illumina organized a thought provoking lecture on ‘Career Opportunities and Higher Education Prospectus’ by Mr.  Rajesh, Manager HR & Admin, CGP career Avenues Final year students of Electrical and Electronics Engineering Department attended the lecture on 15/02/18.\nQUIZ Competition\nAn inter branch Quiz competition was organized. The preliminary round was attended by 50 teams of various branches on 28/10/17. Fifteen teams qualified for first round and five teams chosen for final round conducted on 10/11/17. The winners were given a cash prize of Rs 1000 and Second prize of Rs 500. Winning team were Pranav Balu and Nithin Shankar of S7 CS2 and Second prize winners were Adithya Krishan Menon and Jibin Joy of S3, ME1.\nCHERRY ON TOP\nA bake sale was organized on 24/10/17, both students and faculty of EEE department brought home made cakes and savouries. The sale was inaugurated by Prof. A. S. Shajilal, Head of EEE Department.\n2016-17\nOne day Workshop on Adobe Photoshop\nIllumina conducted one day workshop on Photoshop on 12 November 2016. The sessions were taken by Mr. Arun P Raj and Mr. Akshay S.P, S5 students of Electrical and Electronics Department. 48 students participated for the workshop.\n2014-15\nPoster Design Contest\nA Poster Design Contest was held on 4 February 2015. The topic under Electrical Engineering was announced on the spot and was Green Energy.\nTwo teams from each class (S8, S6, S4 and S1S2) participated and each team had two members.\nMathews K Chacko and Anju Johnson were the student coordinators. Assistants Professors Manju Ann Mathews and Aneesh K T judged the contest.\nFirst prize: Gayathri Gopal V (S1S2), Anjali Sasilekha Kumar (S1S2).\nSecond Prize: Vishnu V (S8), Vinayak Nair H (S8).\nThird Prize: Ganga M S (S4), Akshara M A (S4)\nPhotography Contest\nA photography contest was held on 25 January 20 15 for Electrical students under the theme-‘Emotions’. Only black and white photographs were permitted and a caption was to be given for each snap. Aswin R Nair and Gokul Sarath of S8 Electrical were the coordinators.\nAssistant Professor Sandeep S R of IT department was the judge.\nFirst prize (Rs. 1000/-) – Poornima H R S1S2\nSecond prize (Rs. 750/-) – Jongee Chandy S1S2\nThird prize (Rs. 500/-) – Greeshma Susan John S1S2\nFirst prize                                                 Second prize                                                        Third prize\nWorkshop on Electrical System Design\nGlobal Institute for Design Engineering along with Illumina organized an Industrial Electrical designing workshop (a two day programme) at MBCET on behalf of work skill development initiation for S8EE students. The workshop was conducted on 15 and 16 of January 2015, for which Rs. 1000/- was collected from each student. 25 students participated.\nTopics covered: Design of buildings (Low tension and High Tension).\nStudents were divided into groups and were asked to design as per the given guidelines. It was a very interactive session. Certificates and materials (handbook on Electrical Design) were distributed.\nLUMIÈRE – a new platform for Students\nLumière is a new event started by Illumina on December 2016, keeping in mind the difficulties faced by students during placement drives, especially during group discussion and debate rounds. On every 4th Friday of a month (during lunch break), the first 40 minutes is set aside for either group discussion or debate. The next 15 minutes is given for cultural programmes excluding dance. This platform will also help students to explore their talents by giving them the opportunity to excel in their zone of interest.\nLUMIERE 2018\nAn event where students can showcase their talents in both technical and cultural field. Group discussion and debate were conducted. Also, cultural events such as instrumental music, songs etc. where conducted by the students of S5 EE1 on 14/09/2018 and S5 EE2 on 02/11/2018.\nTRYDAN\nIllumina organizes a technical fest named TRYDAN every year. TRYDAN includes workshops, talks by eminent personalities on cutting edge technologies, and technical and non-technical events which are open to all engineering students all over Kerala.\nTRYDAN 2025\nThe Department of Electrical and Electronics Engineering at Mar Baselios College of Engineering and Technology (MBCET) hosted the much-awaited\nTRYDAN 2025 on 27 February 2025\n, celebrating technology and creativity. Inaugurated with a logo launch by\nDr. Elizabeth Varghese\n, Associate Professor and HoD, EED, the event featured exciting workshops, adrenaline-pumping competitions, and captivating exhibitions. Highlights included the AI-powered Gesture-Speak Project, thrilling RoboRace, immersive VR simulations, the innovative EV Expo, and the Adhara space exhibition. The fest attracted enthusiastic participation from schools and colleges across the region, leaving an inspiring and unforgettable mark on everyone who attended.\nTRYDAN ’22\nIllumina, the association of the Department of Electrical and Electronics Engineering, conducted technical fest TRYDAN ’22 on Saturday December 17 2022. The technical fest was officially inaugurated by Bursar Fr. John Varghese and Vice Principal Dr. S Viswanatha Rao by releasing the logo of TRYDAN and Illumina.\nThe technical fest included workshops, technical events, competitions and non-technical events. A workshop on Vega Processor was conducted by the resource persons from CDAC, Trivandrum. A workshop on EV was conducted by the EEE students followed by a competition. Another workshop on career opportunities in Animation, VFX, AR/VR and Gaming was conducted by MAAC Academy, Trivandrum.\nThe various technical events included Technophilia – an idea presentation, Machinery Mayhem – a machine assembling competition, Robosoccer and Maze runner – Arduino based competitions, Astral – a basic workshop on Arduino, and Electrohunt – a circuit debugging competition.\nThere was also a gaming room set apart for the gamers. The fun events gave a joyous experience to the participants.\nIn connection with the Technical Fest, an EV expo was conducted in the campus. Electric cars from Toyota, MG Motors, Tata and electric scooters from Ather, Kinetic Green, Benling Aura and Okinawa were displayed.\nTRYDAN ’22 was coordinated by the Illumina Core Team under the guidance of Staff Coordinators\nMs. Manju Sreekumar and Ms. Shilpa Susan Peter\n, Assistant Professors, EED.\nTRYDAN ’20\nThe logo of TRYDAN ’20 was officially released online by the renowned music director Sri. Shaan Rahman on 7 March 2020.\nTRYDAN ’19\nA logo release of the first technical fest of the Department of Electrical and Electronics Engineering,\nTRYDAN – Perceive the Transcience\nwas conducted on 19 March 2019, in association with Illumina. The logo was launched by Prof. A. S. Shajilal, Head of the Department and coordinated by Illumina Faculty coordinators Ms. Divya N.A. and Mr. Midhun G., Assistant Professors of the department.\nA Food Fest was conducted on 11 April 2019 in association with the technical fest, TRYDAN and Crossroads 2019. The fest was coordinated by Illumina faculty coordinators Ms. Divya N.A and Mr. Midhun G. with active participation from students of all semesters of the department and turned out to be a grant success.\nTRYDAN’19 was conducted from 26 to 28 April, 2019. The tech fest included both Technical and online events. A technical workshop was conducted on 26 April 2019. Four events namely, Technical debate (‘Challenge O Tech’), Water Rocket, Circuit Debugging (‘Error Hunters’) and Carteles Poster making were conducted on 27 April2019. Technical Treasure hunt (‘Cryptex’) and Robo Race (‘XLR8’) were conducted on 28 April2019. Three online events namely Technical Quiz (‘Unsung’), Macrophotography and Nano Narratives were conducted on 26 and 27 April 2019. The tech fest was coordinated by Illumina Faculty Coordinators Ms. Divya N. A. and Mr. Midhun G., Assistant Professors, EEE and supported by all faculty members and student coordinators of the Department and turned out to be a huge success.\nImpulse Lecture Series\nIMPULSE LECTURE SERIES\nDepartment of EEE started “Impulse Lecture series” in 2018. The following lectures were delivered:\nFaculty-in-charge:\nMs. Sheenu P and Ms. Soumya A V\n2021-2022\nImpulse Lecture Series\nCoordinators: Ms. Sheenu P. and Mr. Aswin R B (from 1 March 2022)\nApplication of Integration and Differentiation in Engineering Mathematics\nThe Department of Electrical and Electronics Engineering conducted a talk on the topic “Application of Integration and Differentiation in Engineering Mathematics ” on 17 June2022 at 04:30 pm in Faraday Hall, EED, for first year EEE students. The speaker for the session was Mr. Anish M S, Assistant Professor, S&H, MBCET.\nTechnical paper writing\nThe Department of Electrical and Electronics Engineering conducted a talk on the topic “Technical paper writing” on 23 March 2022 at 3 pm in Faraday Hall, EED, for final year EEE students. The speaker for the session was Dr. Nisha G K, Professor and HOD, EED, MBCET. Around 60 students attended the programme.\nCoordinators: Ms. Sheenu P. and Ms. Soumya A V (till 28 February 2022)\nHands-on Workshop\nThe Department of Electrical and Electronics Engineering conducted a Hands-on Workshop for faculty and staff of MBCET on the topic “Embedded Systems and IoT Application Development” from 1 to 10 November 2021, as part of the Impulse Lecture Series. The workshop was conducted in the IEDC lab from 2 to 4 pm\nThe Department of Electrical and Electronics Engineering is conducting a Hands-on Workshop for faculty and staff of MBCET on the topic “Embedded Systems and IoT Application Development” from 1 to 10 November 2021, as part of Impulse Lecture Series. The programme is coordinated by\nMs. Sheenu P.\nand\nMs. Soumya A. V\n, Assistant Professors, EED.\nThe Department of Electrical and Electronics Engineering conducted an online talk on the topic “Upgrade your Resume and LinkedIn Profile” on 4 October 2021 at 4 pm in Google Meet, as part of Impulse Lecture Series. The speaker for the session was\nMs. Smitha Nambisan\n, Software Architect, Enterprise Solutions, UST. 30 students registered for the programme. The speaker gave a detailed idea on how to upgrade and make your resume impressive and also create a professional LinkedIn profile.\n2020-2021\nHow to build a Stellar Resume\nThe Department of Electrical and Electronics Engineering conducted an online talk on the topic “How to build a Stellar Resume” on 19 July 2021 at 5 pm in Zoom. The speaker for the session was Ms. Smitha Nambisan, Software Architect, Enterprise Solutions, UST. Around 70 students registered for the programme. The speaker gave a detailed idea on the do’s and don’ts to be followed while preparing a resume, also about the structure of the resume and how to make it relevant.\nThe Department of Electrical and Electronics Engineering conducted an online talk on the topic “\nCovid’19: Back to College Safety\nMeasures\n” on 18 February 2021 from 6:00 PM to 07:00 PM, for the first semester students, as part of the Impulse Lecture Series. The speaker of the session is Dr. Sajina Shijin, Junior Consultant, Jothydev’s Diabetes and Research Centre.\nA one hour Webinar on ” Self-Dealing of Pandemic Stress”, a discussion on Stress Management in Students, was organised by the Department on 07 November 2020 from 11 am to 12 pm on Google Meet.\nA one hour Webinar on “Writing Research papers at Undergraduate level” was organized by the Department of EEE on 21 April 2020 for final year EEE students.\nRobin Joseph,\nAsst. Professor, Dept. of Computer Science and Engineering delivered a one hour talk on “\nPrecise Introduction to Python Programming\n” for the S3 EE students on 29/11/18.\nMs. Asha S.,\nAsst. Professor, Dept. of Computer Science and Engineering gave a two hour expert talk on Cloud Computing-Applications in Smart Grid for S7 EE students on 19/11/2018\nPWM Inverters:\nAn expert lecture by\nA. S. Shajilal\n, Professor, Dept. of EEE, MBCET was delivered for the fifth semester B.Tech Students.\nAutomatic Control Systems:\nAn expert lecture by\nElizabeth Varghese\n, Associate Professor, Dept. of EEE, MBCET was delivered for the fifth semester B.Tech Students.\nCareer Guidance – Opportunities in defence and banking sectors: Mr. A. Purushothaman\n, Managing Director, KSFE Pvt. Ltd. delivered a talk on 25/10/18 for the pre-final year B.Tech students.\nEmbedded Systems- Recent Developments:Mr. Rakesh M\n., Principal Engineer, BCG-I, CDACdelivered a talkfor the pre-final year students.\nApplication of 555 timer as multi-vibrator:\nAn expert lecture by\nSheenu P\nfor the third semester B.Tech Students.\nA Hands-on training on “ORCAD PSpice Simulation Software”\nwas given by\nAswin R.B.\nfor the third semester B.Tech students.\nCurrent Transformers and Potential Transformers: An expert talk by Mr. Arun S. Mathew, Assistant Professor, LBS College of Engineering, Kasargod was delivered for the fourth semester B.Tech Students.\nEnergy Management and Energy Audit: An Introduction by Mr. AneeshRajendran, EMC, Trivandrum on 9th March 2018 for final year B.Tech students.\n“Home PV System: An Overview”by Prof. M.K. Giridharan\non 9th March 2018 for final year B.Tech students.\n“Technical Journal Writing”\nby\nDr. G.K. Nisha\non 22nd March 2018 for Final years and P.G. students.\nWorkshops, Trainings and Internship Programmes/IVs for Students\nINDUSTRIAL VISIT\n108 students (S4 EL:56 & S5 EE:52) from Dept of EEE went for an Industrial Visit on 28-04-25 to Idamalayar Power Station, Eranakulam District. They were accompanied by Ms Sandhya P., Ms Surasmi N L, Dr. Anil J, Ms. Revathy K P, Mr. Ayush Vijayan, Ms. Neetha Chandra Assistant Professor/s, EED.\nEXPERT TALK\nThe Space Club, in association with the Department of Electrical and Electronics Engineering, organized a talk session on “\nElectric Propulsion in Space: The Future of Space Travel\n” on 07 April 2025. The session was conducted by\nDr. Manju S. Nair\n, Project Director of High Thrust Electric Propulsion at LPSC.\nHYKON -INVITED TALK ON ELECTRIC VEHICLE DESIGN\nThe Department of Electrical and Electronics Engineering hosted a one-day invited talk on “\nElectric Vehicle Design – Basics\n”, featuring expert speakers from Hykon India Ltd, a leading name in the field of electric vehicles and renewable energy solutions.\nThe session was conducted by:\nMr. Ajith M\n– Senior Engineer, R&D EV, Hykon India Ltd – Electric Vehicle Design\nMr. Mahesh P\n– Senior Manager, R&D, Hykon India Ltd – Power Electronics Applications\nThe talk offered students a practical understanding of Power Electronics, Battery Management Systems, and the core components of electric vehicles. Real-world case studies and insights from Hykon’s R&D work provided students with a unique glimpse into the rapidly evolving EV industry. 26 Students from S4 and S6 Electrical and Electronics & Electrical and Computer engineering streams attended the one-day workshop and interacted with the industry experts on their future projects and research works.\nINVITED TALK\nAn invited talk on\n“Introduction to Vega Processors”\nwas conducted for the second-year\nElectrical and Electronics (S4 EE)\nstudents.\nMs. Neetha Maria, Scientist E at CDAC, Thiruvananthapuram,\nwas the resource person. She explained the architecture and programming of the Vega processor, and the interactive session covered various application domains of the processor. This expert talk was organized as part of the course\nMicrocontroller and Applications\n.\nSTUDENTS TRAINING PROGRAM ON RESPONSIBLE AI\nThe Mozilla Responsible Computing Challenge (RCC) team, in association with Digital University Kerala, successfully conducted a Student Training Program on\n“Towards Responsible AI: Building Awareness & Promoting Responsible Usage of AI Tools”\nat Mar Baselios College of Engineering and Technology (Autonomous) on 28 March 2025.\nThe session was delivered by\nDr. Sanil J\n., Research & Development Engineer at Digital University Kerala. He provided valuable insights into the ethical and responsible use of AI tools, emphasizing the significance of transparency, fairness, and accountability in AI-driven solutions.\nThe interactive session engaged fourth-semester Electrical and Computer Engineering students, equipping them with foundational knowledge in responsible AI practices. The event was well-received, fostering discussions on AI’s impact and best practices for ethical AI development.\nThis initiative was part of the ongoing efforts to enhance students’ awareness of emerging technologies while ensuring their responsible application in academia and industry.\nTRAINING FOR STUDENTS\nA session “\nEmpowering Student researchers : Writing IEEE papers and securing project grants\n” was conducted for S6 EE and S6 EL on Monday, 10th February, 2025 from 10:30am to 12:00 pm. The session was expertly led by\nDr. Ajith Prabhu V\n., an experienced researcher and academician. Dr. Prabhu guided the students through the key elements of crafting strong and effective research proposals, with a focus on the essential ABCs of proposal writing\n.\nWEBINAR CONDUCTED\nWebinar on the\nGuidance opportunities after B Tech\nwas conducted for S6EE & EL and S8 on  13.02.2025 from 3:30 pm to 4:30 pm. The session was led by  Mr. Pradeep Raghu ,     from ACE academy, a renowned institute specializing in training students for higher studies and competitive exams. The session was exceptionally informative for the students who are aspiring for advanced studies and better job opportunities after B.Tech.\nEXPERT TALK\nThe Department of Electrical and Electronics Engineering organized an invited talk titled\n“Stronger Minds, Brighter Future: A Talk on Mental Health”\nfor fourth-semester students of Electrical and Electronics Engineering and Electrical and Computer Engineering on February 14, 2025, at Visvesvaraya Hall. The session was led by\nMs. Niranjana N. J., an alumna of MBCET\n(2010–2014 batch).\n2023-24\nINDUSTRIAL VISIT\n87 students (S5 EL:43 & S5 EE:44) from Dept of EEE went for an Industrial Visit on 28-09-24 to KEL, Eranakulam, they also visited Anna Aluminum Pvt Ltd. They were accompanied by Ms Sojy Rajan, Ms Manju Sreekumar, Ms Shilpa Susan Peter and Dr Sheryl Arulini A, assistant Professor, EED.\n42\nStudents of S6 EE\nand\nMr. Aswin R B\n, Assistant Professor, EED, visited Adani Vizhinjam Port Pvt Limited, on 4/5/24 as a part of their Industrial Visit.\nCIRCUITRIX\nThe Department of Electrical and Electronics Engineering in association with CDAC is organizing “Circuitrix”, a 30 hrs Online certification programme on Simulation of Power Electronic Circuits from Basics to Applications in MATLAB/Simulink.\nThe first session of this programme was conducted online in Google Meet platform on 16 October 2023. The resource person was\nDr. Dishore S V,\nAssistant Professor, EED. He handled a session on “From Basics to Applications: Navigating the world of Electronic devices”.\nThe second session of this programme was conducted in Hybrid mode on 26 October 2023. The resource person was\nMr. Ajeesh A\n, Scientist E, Joint Director, CDAC. He handled a session on “Design of Power Electronic Circuits: Concepts, Devices and Implementation”.\nEMC CERTIFICATION PROGRAMME\nThe Department of Electrical and Electronics Engineering in association with Energy Management Centre, Kerala organized an EMC Online Certification Programme on “Recent Trends in Sustainable Energy Management Practices” during September 2023. The programme was coordinated by Ms. Vandana P. and Mr. Aswin R B, Assistant Professors, EED.\nThe first session was conducted on 14 September 2023 on the topic “Energy Conservation” in Google meet platform. The resource person for the session was\nMr. Tomson Sebastian\n, Energy Technologist, EMC, Kerala.\nThe second session of this series was conducted on 18 September 2023 on the topic “Renewable Energy and Energy Efficient Technologies” in Google meet platform. The resource person for the session was\nEr. Anoop Surendran\n, Energy Technologist, EMC, Kerala.\nThe third and fourth sessions were conducted on 20 and 22 September 2023, on the topic “Energy Management and Energy Efficiency in Electrical Utilities”. The sessions were handled by\nEr. Abhijith M.R.\n, CEO, Esylys, TrEST Park, Thiruvananthapuram.\nThe fifth session was conducted on 23 September 2023, on the topic “E-mobility – Sustainable Transport”. The session was handled by\nDr. Nisha G K\n, Professor and HOD, EED.\nThe sixth session was conducted on 25 September 2023, on the topic “Energy Auditing”. The resource person was\nMr. Suresh Babu B V\n, Accredited Energy Auditor.\nThe seventh session was conducted on 27 September 2023, on the topic “Energy Auditing case studies”. The resource person was\nMr. Suresh Babu B V\n, Accredited Energy Auditor.\nThe eighth session was conducted on 29 September 2023, on the topic “Introduction to sustainability practices and building industry”. The resource person was Ms. Ashiqua Sulthana.\nThe nineth session was conducted on 2 October 2023, on the topic “Sun to Socket – Microgrid solar PV insights”. The resource person was\nDr. Dishore S. V\n, Assistant Professor, EED, MBCET.\nThe tenth session was conducted on 3 October 2023, on the topic “Green buildings”. The resource person was\nMs. Ashiqua Sulthana\n, Sustainability consultant, Wentech Ltd. England.\nThe last session of the programme was handled by\nMr. Aswin R B\n, Assistant Professor, EED, MBCET on the topic “Electrical design aspects in Domestic installations” on 30 October 2023.\n2022-23\nTalk on “Electrical Safety Aspects”\nThe Power Electronic Research Group, Department of Electrical and Electronics Engineering, MBCET organized an Expert talk for the final year students on Electrical Safety Aspects, on\n14 October 2022\nfrom 2:00 pm to 4:30 pm in Faraday Hall. The Resource person for the webinar was\nSri. Suresh Kumar S\n., Nodal Officer Litigation (AEE), KSEB, Electrical Circle, Kattakada. The session was coordinated by\nMs. Vandana P\n. and\nMr. Aswin R B\n, Assistant Professors, EED. Around 70 students attended the session.\n2021-22\nTraining Programme for Students\nThe Department of Electrical and Electronics Engineering, MBCET organized a hands-on session on MATLAB for the PG and final year UG students on\n07 December 2021\nin the Software lab, EED. The resource person was\nMr. Niyaz K Haneefa\n, Assistant Professor, ECED, MBCET.\nMs. Manju Ann Mathews\nand\nMs. Ashni Elisa George\n, Assistant Professors, EED coordinated the programme\n2020-2021\nOnline Training Programme for Students\nThe Department of Electrical and Electronics Engineering in association with IPCS – The Global Technology Service Provider conducted an Online Training Programme on Introduction to Industrial Automation on 29 and 30 April 2021 from 2 to 4 PM. The programme was organized by Power Electronics Research Group of the Department as a 2 day workshop, aimed at enhancing your practical knowledge in Industrial Automation. Final year and pre-final year B.Tech students (all branches) attended. The programme was coordinated by Ms. Surasmi N L and Ms. Jeneena Babu\n2019-2020\nRC Aircraft Workshop\nA\n2-day RC Aircraft Workshop\nwas conducted by the Department in association with Skyfi Labs on 3 and 4 January 2020 for school students studying in StdVII onwards. 17 students from different schools participated. The programme was coordinated by\nDr.Shalu George K. and Ms. Keerti S. Nair.\n2018-2019\nWorkshop on Raspberry Pi\nA one week evening workshop on Raspberry Pi from 11 to 17 March 2019 was conducted by the Department of EEE jointly with IEDC, MBCET. The workshop was co-ordinated by\nMs.Sheenu P. and Ms. Soumya A. V\nInternship Programme on LabVIEW\n: A 5 day internship programme on Motion Control using LabVIEW was conducted from 17/07/18 to 21/07/18. Mr. Shino G. Babu, TIERA Trivandrum was the resource person. 24 students successfully completed the programme. The programme was coordinated by Ms. C. SojyRajan., Assistant Professor.\n2016 – 2017\nOne day Workshop on Adobe Photoshop:\nIllumina, the Department association of Electrical and Electronics Department conducted one day workshop on Photoshop on 12th, November 2016. The sessions were taken by\nArun P Raj and Mr. Akshay S.P\n, S5 students of Electrical and Electronics Department. 48 students participated for the workshop.\n2014-2015\nPLC-SCADA Training\nA 5 day Industrial Automation Workshop was conducted for S8 Electrical students from 24\nth\nto 28\nth\nNovember 2014 for which 60 students participated. It was conducted by Automation and Control Systems, Pune. Each student paid Rs.700/- for the training. Certificates were issued at the end of the training programme.\nTopics covered: Training on PLCs of Mitsubishi, Messung and SCADA software with basics fundamentals of Robot.\nWorkshop on Electrical System Design\nGlobal Institute for Design Engineering along with Illumina organized an Industrial Electrical designing workshop (a two day programme) at MBCET on behalf of work skill development initiation for S8EE students.The workshop was conducted on 15th and 16th of January 2015, for which Rs. 1000/- was collected from each student. 25 students participated.\nTopics covered: Design of buildings (Low tension and High Tension). Students were divided into groups and were asked to design as per the given guidelines. It was a very interactive session.Certificates and materials (handbook on Electrical Design) were distributed.\n2013-2014\nWorkshop on LabVIEW\nA Workshop on LabVIEW with hands-on sessions was organized for third semester PG students from 1 to 4 September 2014, which was conducted by VI Systems, Bangalore in association with National Instruments Private Ltd., Bangalore. The workshop was coordinated by Ms. Shalu George K. Certificates of participation were distributed\nAutoCAD Training\nAssociation is conducting AutoCAD electrical training with Autodesk Certification for final year electrical students, which includes:\n– Software training using AutoCAD Electrical 2013 software.\n– Autodesk course completion certificate.\nCourse duration: 30 hrs30 students are attending the course from 15-01-14 (4:15 pm- 5:30 pm) on all working days.\n2012-2013\nA 40 hrs workshop on “\nElectrical CADD\n” for the 8\nth\nSemester students was organized in March 2013.\nA two day Workshop on “\nBasic Course on the use of Ansys- Maxwell Software\n” was organized on 17\nth\n& 18\nth\nJanuary 2013 for the PG students.\nA Workshop was organized on\nRobotics\nfor the 7\nth\nsemester students by Rhydo Technologies Pvt. Ltd., Cochin.\nA 40 Hrs training programme was conducted for the final year students on\nAuto CADD Electricalwith Autodesk Certification\n(Autocadd 2d, Electrical CADD) by Lines and Circles, Chettikulangara, Trivandrum on\nApril 2013.\nStudent Chapters\nINSTITUTION OF ENGINEERS INDIA (IEI)\nThe Institution of Engineers (India) [IEI] is the largest multi-disciplinary professional body of engineers, established in 1920 with its Headquarters located in Kolkata. It is administered by a National Council with the President as its Head.\nThe Institution has been serving the engineering fraternity for over a Century with its national and international presence through 125 Centres spread all over India, 6 Overseas Chapters, 7 Fora and an Organ namely Engineering Staff College of India (ESCI), Hyderabad. The Institution encompasses 15 (fifteen) engineering disciplines with a Corporate membership of over 2 lakhs.\nThe Institution of Engineers (India) is the first professional body to represent India in several International Bodies, such as the World Mining Congress (WMC), the World Federation of Engineering Organizations (WFEO), etc. It also has bilateral agreements with a number of professional societies across the globe. IEI has been recognized as Scientific and Industrial Research Organization (SIRO) by the Ministry of Science & Technology, Govt. of India and besides conducting its own research, provides Grant-in-Aid to UG/PG/ PhD students of Engineering Institutes & Universities.\nThe State / Local Centres of IEI spread across the country do organise technical activities and provide platform to the stakeholders, technocrats, policy makers and others to share their expertise to benefit the engineering fraternity.\nOur college is a student chapter of Institution of Engineers India from 2020 onwards. An awareness session on the largest multi-disciplinary professional body of engineers, The Institution of Engineers (India) [IEI] was given to EEE students of S1, S3 and S5 on\n16 November 2023\n. The resource speaker was\nEr. P. Balakrishnan Nair\n, Chairman, Institution of Engineers. The session was coordinated by Dr. Shalu George K, Associate Professor, EED.\nPOSTER MAKING COMPETITION\nIn observance with Energy Conservation Day on\n14 December 2023\n, IEI MBCET and NSS Units 230 and 706 of MBCET collaboratively organized a poster-making competition centered around the theme of ‘Save Energy’. The event drew participation from over 15 enthusiastic volunteers. Feba M Paul of S1 CE1 secured the first position, while A Samyuktha Syam of S7 EE1 claimed the second position in the competition.\nIEEE PES MBCET STUDENT CHAPTER\nIEEE Activities – Mar Baselios College of Engineering And Technology (mbcet.ac.in)\nIET MBCET STUDENT CHAPTER\nIET – Mar Baselios College of Engineering And Technology (mbcet.ac.in)\nSEPTECH MBCET CHAPTER\nSmart Energy Program (Technical), SEPTECH is one of the flagship projects of Energy Management Centre (EMC), which was formed to spark off an initiative for curbing energy wastage through active measures and also popularizing the importance of energy conservation and energy efficiency measures among students. The MBCET Chapter will provide our students and faculty with the insights and ideas they need to advance in energy management and renewable energy area and to work in multi-disciplinary projects encompassing all aspects of energy, with a focus on energy-environment-and development interactions.\nThe SEPTECH-MBCET Chapter was inaugurated on 30 July 2018 at 9.30 a.m. by\nDr A.M Narayanan\n, Head-Energy Efficiency, EMC in the presence of\nFr. John Vilayil\n, Bursar MBCET, Dr T M George, Principal MBCET and\nProf. A S Shajilal,\nHOD, Dept of EEE. The function was attended by Vice Principal, Heads of various departments, Senior Professors, Faculty members and student representatives.\nMr. Aneesh Rajendran\n, Energy Technologist, Energy Management Centre, Trivandrum also attended the function.\nMs. Divya N A\nand\nMs. C Sojy Rajan\n, Asst. Professors, Dept. of EEE are the faculty coordinators of SEPTECH-MBCET Chapter. To mark the beginning, a three day training programme on “Distributed Generation and Smart Grids” was organized in coordination with Illumina and Innovation and Entrepreneurship Development Centre from 30 June to 1 July 2018.\nStudent Chapter in MBCET for SEEM – Society of Energy Engineers and Managers (SEEM):\nThe Departments of EEE, ME and CE are jointly initiating to open a Student Chapter in MBCET for SEEM – Society of Energy Engineers and Managers (SEEM) India, which is the national professional body of Certified Energy Managers, Auditors and energy professionals in the country. SEEM has a network with International/national energy agencies; state designated/nodal agencies, energy efficiency and renewable energy equipment manufacturers, educational Institutions and non-government organizations.\nThe MBCET-SEEM chapter was officially inaugurated on 19th August 2017 in Senatus Hall, Mar Baselios College of Engineering & Technology, Trivandrum. The chapter is jointed formed by the Electrical & Electronics Department and the Civil Department, with 210 student members. The programme started at 10:30 am with the Welcome Address by the EEE Faculty Coordinator –\nMs. Jomole Joseph.\nShe formally introduced the Chief Guest of the Day – Mr. R Jayakumar, National Treasurer (SEEM) and Managing Director of Sustenergy- Athul and Mr. Sankeerth Santhosh, Assistant Manager (Projects), SEEM who had accompanied him.\nAfter commencing the program with an auspicious start by Lighting the Lamp, the Chief guest, Mr R Jayakumar then delivered the Keynote address on “How to be an Engineer”, followed by an interactive session with the students and faculty on varied topics in Energy Management & Environmental issues, and queries about SEEM.\nThe Vote of Thanks was proposed by the Student Secretary, Mr. Ridhwik Vinod (S6, EE1), and the  Principal,\nDr. T M George\nthen presented the Chief Guest with a memento, as a Token of Gratitude.\nAfter the Tea Break, Mr. Suresh Babu B V, Empanelled Accredited Energy Auditor of BEE, Govt. of India, delivered a Technical Session on “Energy Management & Career Opportunities”. He also gave an idea regarding various programs and opportunities open to SEEM student members, and through the interactive session, presented the basic idea on how energy consumption is calculated, and introduced the students to awareness of various fields related to Energy sector.\nMs. Nimisha Anna Jacob, CE Faculty Coordinator, then presented Mr. Suresh Babu with a memento, as a Token of Appreciation. The session came to an end by 12:45 noon.\nWorkshop on “Introduction to Field Practices in EEE”\nA two workshop on “Introduction to Field Practices in EEE (An Employability Enhancement Program)” is held at MBCET on 23rd and 24th February 2018 by SEEM-MBCET Chapter. The session was handled by\nShri. Sankeerth Santhosh\n, Asst. Manager – Projects, SEEM. The workshop focused on basics of EEE of Field Practice, Protection schemes earthing, safety clearances and work permit procedures, preparation of drawings, Electricity regulations and standards and energy conservation.\nTotal of 34 participants comprising 15 internal teaching faculty, 6 internal technical faculty and 12 B.Tech students successfully completed the course for the award of certificates.\nFaculty Coordinator: Ms Jomole Joseph\nStudent coordinator: Ms. Gayathri Gopal (S8, EE)\nIET – MBCET Chapter\nThe IET-MBCET chapter\ninauguration function was presided by\nProf. Viswanatha Rao\n(Vice Principal, MBCET),\nDr. M Marseline Beno\n,\nDr. V Christus Jeya Singh\nfrom KKLN,\nMr. S Raghavan\nfrom Bangalore Head Office and\nMs. Jomole Joseph\n, Faculty Advisor, IET-MBCET on 23rd August 2016.\nThe IET-MBCET chapter has 200 student members\nStudent Achievements\nACCOLADES WON BY STUDENTS:\n2024-25\nSTUDENTS’ ACHIEVEMENT\nENTE KERALAM EXPO AT KANAKAKKUNNU\nAs part of ”\nEnte Keralam\n” programme three projects of our final year students were selected by APJKTU for exhibition on 19-05-25.\nMr. Aswin R B\n, Assistant Professor, EED and\nDr. Soumya A. V\n, Associate Professor, EED attended the expo.\nGATE 2025 QUALIFIED\nAswani P. P and Siva Santhosh of S8 EE qualified for Gate 2025.\nIEEE AWARD\nMs. Sandra S. R\n., student of S8 EEE, has been recognized for her outstanding contributions to IEEE activities. She has been awarded the\nBest Student Volunteer and Best Chairperson of Student Branch Chapters\nby the IEEE Engineering in Medicine and Biology Society (EMBS) Kerala Chapter.\nSTUDENTS EXCEL AT MACE MUN 2025 WITH PRESTIGIOUS AWARDS\nOur students showcased exceptional diplomatic and public speaking skills at the\nMACE Model United Nations (MUN) 2025\n, held at MACE, Kothamangalam. Their outstanding performances earned them multiple accolades across various committees:\nAbhav Rajit Nair (S4 EL)\n–\nHigh Commendation\n(DISEC)\nNeil Philip Koshy (S4 EL)\n–\nVerbal Mention\n(UNHRC)\nJacob Cherian (S2 EE)\n–\nVerbal Mention\n(UNHRC)\nElviz Mathews Olickal (S4 EL)\n–\nHigh Commendation\n(ECOSOC)\nJithin Rajesh (S4 EL)\n–\nSpecial Mention\n(ECOSOC)\nA team of 4 students-\nYash Chhalotre , Aathish R Viswam , Vishnu B S\nfrom\nS6 EL\nand\nMidhun Eshwar\nfrom\nS4 EC 2\nparticipated in a\nhackathon\nconducted by Al ameen college, Aluva. The team bagged Rs 10,000 as\nfirst prize\nin the best video pitching category.\nJithin Rajesh\nof S4EL won Best Delegate Award ,\nNeil Philip Koshy\nand\nPrathyusha Nair\nof S4 EL won Special Mention and\nPridhvi S S\nwon High Commendation Award for photography in the Intra Model United Nations event held at our college on 1 and 2, February 2025.\nManuraj M S\nand\nHanok Samuel Boban\nof S4EL on placing third for the Sustainathon organised by IET and Aksharakootam on 22nd February, 2025.\nAbhav Rajit Nair\nof S4 EL won Special Mention as Delegate of USA in United Nations Human Rights Council at IIST MUN 2025 held in Indian Institute of Space Science and Technology, Valiamala\n2023-24\nSTUDENTS’ ACHIEVEMENT\nMalavika S, Merin Anna John, S. Meenakshi\nand\nAdvaith P S\npresented a paper on “\nSatellite Tumbling Control using Magnetorquers\n” in the 11th IEEE International Conference on Power and Energy Systems (\nPEDES 2024\n) held at National Institute of Technology Karnataka, Surathkal, India from 18 to 21 December 2024. The project was guided by\nDr. Nisha G.K.,\nProfessor, EED and\nMs. Vrinda Prasad\n, Assistant Professor, EED.\nRyan Mathew Manual\nof S4 EL scored\n10 SGPA\nfor the Third semester B Tech Degree (regular) Examination November 2024 (2023 Scheme)\nOn 26th-27th October 2024,\nAbhav R. Nair\n(S3EL) served as the Chairperson of the United Nations Human Rights Council at Kerala Model United Nations 2024 (KERMUN ’24), hosted by St. Thomas Central School, Mukkolakal, Thiruvananthapuram. In his role, he guided intense discussions on critical human rights issues regarding prisoners and detainees, fostering a diplomatic and collaborative environment among young delegates.\nMr. Arunesh J B\nand\nMr. Bharat Dharmendra\nTeam No. 2024-ASI-ROCKETRY-024 from Mar Baselios College of Engineering and Technology has successfully completed Workshop on “\nEssentials of Model Rocketry\n” Organized for participating teams of IN-SPACE Model Rocketry India Student Competition 2024-2025 under the skill development programme conducted by Indian National Space Promotion and Authorization Centre (IN-SPACE), in association with Indian Space Research Organisation (ISRO), organized by Astronautical Society of India (ASI) from November 09-15, 2024 at Air Force Station, Jalahalli (West), Bengaluru.\nIEEE PES\nIEEE PES membership Development Session\nIEEE PES Kerala Chapter organised an awareness session “\nIEEE PES membership Development Session\n” on 8th October 2024 in online mode. The session attracted approximately 30  participants who engaged in discussions about the benefits and opportunities  associated with IEEE PES membership.\nIEEE PES Quiz\nIEEE PES\nstudents branch of MBCET conducted a\nquiz\non 15\nth\nOctober 2024 as part of celebrating IEEE DAY. The quiz was hosted by IEEE PES Kerala Chapter and it was open to the first-            year students. 23 students from different branches participated in the quiz event.\nThe recent\nIdeathon on “Ethical AI,”\nhosted by Kerala University of Digital Science, Innovation and Technology in collaboration with the Mozilla Foundation, highlighted exceptional talent and innovation. Of the 26 teams competing, nine hailed from MBCET, underscoring the institution’s significant role and contribution to the event. The event attracted a diverse group of competitors, including postgraduate students and professionals from various fields. The\nsecond prize\nwas awarded to\nYash Chhalotre\n(S5 EL) and\nAnand Pillai\n(CS), while\nManuraj M S, Hanok Samuel Boban\nand\nNavin Tom Babu\n(S3 EL) earned the\nfourth prize\n.\nIn observance of\nAnti-Ragging Day\non 12 August, followed by Anti-Ragging Week from 12 to 18 August, the UGC and Centre for Youth (C4Y), the UGC National Anti-Ragging Monitoring Agency, suggested various events at college level and and organized National Contest 2024 for students: Contest 1 – Instagram Threads Digital Poster Making; Contest 2 – Instagram Reel Making; and Contest 3 – YouTube Video.\nMohammad Afroz A\nof S5 EL participated in Instagram Reel Making Contest and was selected as one among 23 finalists from 3290 entries from 23 States of India.\nAdithyan Ganesh\nfrom S5EE is selected as\nTrivandrum Regional Coordinator\nof the Natural Resource Protection Force (NRPF) NSS Cell of APJ Abdul Kalam Technological University for the AY 2024-25.\nAbhav R Nair,\nstudent, S3EL won High Commendation representing The United States of America in UNGA DISEC Committee at University College Model United Nations, Palayam.\nAbhav R Nair, Student, S3EL was selected as chair at TMUN 2024 (Tomorrow Model United Nations) in the committee ECOFIN.\nPROJECT PRESENTATION AT KSEB LTD.\nThe project “\nSmart Demand Response for Consumers\n” by\nArchit S Thampi, Muhammad Faris, Nevin Thomas John, and Sravan A R\nwas presented to Kerala State Electricity Board (KSEB) Ltd officials, who praised its innovative approach to optimizing energy consumption. Congratulations to the team and their guides, Assistant Professors\nMr. Ayush Vijayan\nand\nMs. Neetha Chandran\n, for their outstanding work.\nDr. Nisha G K\n, Professor, EED, also attended the session, representing the department and supporting this commendable effort.\nNATIONAL CONFERENCE\nStudents from the Department of Electrical and Electronics engineering actively participated in the\nNational Conference on Education, Environment, Economy 2030 – Focussing on the Marginalized\nfrom 14-15 March 2024 jointly organised by Mar Ivanios College (Autonomous), St John’s College, Anchal, Mar Theophilus Training College, Mar Baselios College of Engineering and Technology, Mar Gregorius College of Law, MCA Major Archdiocese of Trivandrum, Malankara Social Service Society in collaboration with Kerala State Higher Education Council, Govt. of Kerala.\nAathish R Viswam, Amal S\nand\nVishnu B S\nof S4 EL presented a paper on ‘Focus Minder – Enhancing Productivity and Collaboration\nYash T L Chhalotre\nof S4 EL presented a paper on a Dynamic Traffic light system with adaptive morphology.\nJenifer Alosious\nof S8 EE1 presented a paper on Smart charging on electric vehicles.\nPLACEMENTS\nAntony Josi, Aparna S, Arunima R, Darpan Yeswanth, Dhiya A J, Jenifer Alosious, Karthik G M, Negha S, Nevin Thomas John, Rohan U S, Ryan Harison and Sajitha of S8\ngot placed in\nSkill winner\nas Business Development Executive Intern.\nMUN Awards\nAbhav Rajit Nair\nand\nElvis Mathews Olickal\nof S2EL won\nMUN Award\nunder the category\nHonorable Mention\nYash T L Chhalotre\nof S4EL won\nMUN Award\nunder the category\nSpecial Mention.\nSMART INDIA HACKATHON 2023\nA team consisting of Aathish R Viswam (S3 EL), Yash Chhalotre (S3 EL), Varsha Rachel George (S3EL), Vishnu B S (S3 EL), Amal S (S3 EL), Nandana Krishna (S3 EL) got selected for the finalist of Smart India Hackathon 2023. They are one among the 5 teams shortlisted from Kerala. Congratulations to the team.\nINTERNSHIP\nAbhijith Anand and Adarsh Biju Thomas of S5 EE were selected by Hex20 for internship based on a test covering topics from Basic Electronics, Programming in C & SPACE.\nOther Achievements\nYash Chhalotre (S3 EL) participated and won award for UNODC conducted as a part of MACE  MUN 2023 held at Mar Athanasius College of Engineering held from 30 November to 04 December 2023.\nMBCET Volleyball Men team secured Third position in the A Zone Inter Collegiate Volleyball Championship held at VKCET, Paripally on 24 November 2023. Alan Aby and Cyril Chacko of S7 EE1 were members of the team.\nMBCET Yoga Men’s team bagged the second position in the APJ AKTU Inter Zone Intercollegiate Yogasana Competition held at Rajagiri School of Engineering and Technology, Ernakulam on 23 November 2023. Advaith Renjith and Manuraj M S of S1 EL were members of the team.\nThe Basketball team of MBCET became 2nd Runner-up in the Inter Zone Basketball Championship held on 3 November 2023. Joseph Cherian (S3EEE), Ryan Mathew Manuel (S1EL), and Aromal R Chandran (S1EL) were members of the team. Ryan Mathew Manuel (S1EL) got selected into the KTU University team going to participate in the South Zone Inter University.\nThe Shuttle badminton men team of MBCET became the second runner-up in the A zone Shuttle badminton championship held at Toss Academy, Manacaud on 2 November 2023. Alan Aby of S7 EE1 was a member of the team.\nMBCET Kabaddi Men team secured the third position in the A -Zone Inter Collegiate Kabaddi Championship held at VKCET, Paripally on 27 October 2023. Abhijith J of S3 EL was a member of the team.\n2022-23\nBEST PAPER AWARD\nVrinda S S, Shilpa Nair U S, Sai Krishnan A K, Aadhil Ansar and Sibin George, S8 students of EED bagged the Best paper award worth ₹10k, for their presentation on “Smart Ergonomic Office Chair” in the NABIOCON ’23 (National Conference on Biomedical Instrumentation and Signal Processing, 2023) organized by the Department of Biomedical Engineering, TKM Institute of Technology, in association with Telemedicine Society of India, SCTIMST-TIMed, EMBS Kerala Chapter and IEEE EMBS TKM IT during 26 and 27 June 2023. The conference was based on the theme “Revolutionizing Healthcare: Exploring Modern Medical Technology”. The project was guided by\nMs. Soumya A V and Dr. Shalu George K\n.\nBest Project Awards:\nS8 EE1\n:\nProject:\nBorewell Rescue System\nMembers: Anand Vijay, Abhishek R Krishnan, Sangeeth PB, Rohit VK\nGuides: Dr. Dishore SV, Ms. Revathy KP\nProject:\nImplementation of Multipurpose Fastag\nMembers: Rohith U Nair, Laby Mathew Ninan, Greeshma DG, Jeenu L Jose, Arya A\nGuide: Dr. Sheryl Arulini, Ms. Neetha R Chandran\nS8 EE2\n:\nProject:\nVertical Axis Wind Turbine using Axial Flux Generator\nMembers: Joana J John, Riya Rajesh, Sujin Reji, Sanjay J S\nGuides: Mr. Anil J, Dr. Dishore SV.\nProject:\nIndustrial automation and implementation of coconut breaking system\nMembers: Vaishnav Dev B, Tomin J S, Vivin John Thomas, Mayoorika Venu\nGuide: Dr. Nisha G K, Ms. Sandhya P\nMBCET Men Basketball team secured\nRunner up\nposition in the All Kerala Inter Zone Basketball Tournament held at Illahia Engineering College, Muvattupuzha on 06/12/2022.\nB Navaneetha Krishnan of S5 EE1\n, is a member of the team.\nMBCET Kho Kho Women team secured\nThird position\nin the APJ AKTU A-Zone Inter – Collegiate tournament held at CET, Trivandrum on 28 November 2022.\nJenifer Alosious of S5 EE1\n, is a member of the team.\n2021-22\nBest Project Awards:\nAn exhibition of the projects by the final year students of the Department of Electrical and Electronics Engineering was conducted at Faraday Hall on\n2 June, 2022\n. 18 projects were exhibited. Pisces Bot, Telecommunication based patient monitoring Rover, Early disease detection by Nail Image processing, ROV to aid fish farmers in agriculture, Public bus transport information system for Blind people, Fire extinguisher drone, were some of the projects. The best project from each class were awarded.\nS8EE1: Pisces Bot\nTeam members: Abhijith A, Ananth A J, Gautham B R, Rahul S Nair.\nGuide: Ms. Sandhya P.\nS8EE2: Ultrasonic Analyser for the measurement of water content in crude oil\nTeam Members: Amal Krishna, Gowtham Krishna and Gopeekrishnan.\nGuide: Ms. Soumya A. V.\nMALAYALI MANGA 2022\nMs. Remya Krishnan, Ms. A. Samyuktha Syam and Ms. Malavika S\nof S4 EE1 won the cash prizes of Rs. 5000/-, Rs. 3000/- and Rs. 2000/- respectively for the Malayali Manka contest sponsored by Malayala Manorama m4marry.com, conducted at MBCET during Onam celebrations.\nPATENT FILED\nThe invention titled\nGREEN ELECTRIC MASK ANNIHILATOR (GEMA)\nby a team of our\nS8 EEE\nhas been filed for the\nIndian Patent\nthrough the Provisional Patent Application (202241016658) on 24 March 2022 with a provisional Specification.\nThe Inventors are\nAbhijith A, Gautham B R, Ananth A J, Jalajith V M, Rahul S Nair and Mrs. C. Sojy Rajan\n.\nSmart India Hackathon 2022\nGourisankar S, Blessy Smitha Das, Basil Anil, Sarang G.S., S.D. Sandra Krishnan, A.R. Devanath of S2 EE\nbagged first prize for the Prelims of Smart India Hackathon 2022 conducted from 13 April 2022 8:00 PM to 14 April 2022 10:00 AM in online mode.\nAmy Rachal Robby of S\n6\nEE1\nsecured First position in Shuttle Badminton Doubles Tournament conducted in connection with the DHWANI cultural Fest on 17 May 2022 at CET, Trivandrum.\nRohan U. S. (S2 EE2)\nhas been selected as one of the top 5 Student Branch Associates for the flagship event of IEEE India Council, IEEE All India Student – Young Professional – Women In Engineering – Life Member Congress, AISYWLC 21 hosted by IEEE Kerala Section. This award is based on the activities he has participated and coordinated for the Student Branch.\nAmy Rachal Robby of S5 EE1\nhas been selected to participate in the South Zone Inter-University Shuttle Badminton Tournament to be held at Rayalaseema University, Andhra Pradesh from 14 to 18 December 2021.\nAakash Shivashankar of S1EE\nhas participated in the All Kerala promotion for cycling travel from Trivandrum to Kasargod organized by Trivandrum Cycling Association.\n2020-21\nASAP Hackathon Rebuild Kerala 2020 Grand finale\nTeam BLITZKRIEG\n(Vishnu M Nair, Abinshah Ameer, Amaze Anna Toms, Nanditha Sai Prasanth, Geoji George (S7 EE2) and Vaishnavi (S7 EE1))\nbagged 1st runner up position and won Rs. 2,00,000/-\nfor their idea under Home Affairs Theme in the\nASAP Hackathon Rebuild Kerala 2020 Grand finale.\nThe problem statement was about Development of Smart Patrolling for Virtual Patrolling System using IOT, AI powered Camera Vision etc.\nKSEB POWER QUIZ 2021\nKSEB Officers Association appreciated MBCET for the esteemed participation in the Online Power Quiz 2021.\nMr. Adarsh Y S and Ms. Annapoorna S of S7 EE2 secured the first place and second place respectively for the KSEB Online Power Quiz 2021 conducted at MBCET on 31 October 2021, organized by KSEB Officers Association\nKTU has published the result of the\nNO TO DOWRY competition\nand\nMs. Anakha Ajith\n(S4 EE1), whose poster we selected and shared as our official entry won\nsecond prize\n. Thanks to Dr. Deepak G Dilip, Assistant Professor, MED and Mr. F R Rejish Babu, Assistant Professor, EED, for conducting the College level selection.\nMs. Arunima R of S2 EE1 won first prize for the poster making competition, ‘Time for Nature’ conducted by ISTE MBCET student chapter.\nMr. Vishnu M Nair (MBT17EE082) of S8 EE2 handled a session at Department of Computational Biology and Bioinformatics, University of Kerala on 7 June 2021 in Google Meet.\nAnanthakrishnan (S6EE1) got third place for photography competition in Orion 2.0, a virtual technical extravaganza organized by Women in Power Community of IEEE PES Kerala Chapter.\nRohan U. S. (S2 EE2) got special appreciation from IEEE for actively participating in many events organized by other Student Branch Chapters and IEEE Kerala Chapter and was selected as Member of the month.\nSanjay S S (S2 EE2) bagged third prize for CRYPTIC, an Online Crossword puzzle conducted by IEEE PES MBCET on the occasion of PES DAY 2021, which was attended by 90+ participants, on 5 April 2021.\nA. Samyuktha Syam (S2 EE1) bagged second prize for Ingenious, Poster making competition conducted by IEEE PES MBCET based on the theme “Green Energy” from 21 – 27 April 2021.\nMr. Vishnu M Nair of S8 EE2 delivered a talk on “Energy Demand Forecasting using Deep Neural Networks” in the National Student Tech Talk Series on 22 April 2021, organized by the Department of Computer Science, MBCET, in association with CSI Trivandrum Chapter, CSI MBCET Student Chapter and KTU, in Google Meet.\nA. Samyuktha Syam (S1 EE1) bagged first prize for Poster making competition conducted by Prakruthi (Nature Club) MBCET as part of World Wetlands Day Poster Making Contest in February 2021.\nA. Samyuktha Syam (S1 EE1) bagged first prize for Poster making competition conducted by NSS as part of World AIDS Day in December 2020.\nN\namitha Jose of S1 EE2 has won second prize in the poster competition conducted by Water Management cell.\nJenifer Alosious of S1 EE1 won first prize for IRIDESCENT, a Photography Contest conducted by the IEEE Student Chapter, MBCET and Muhammad Faris of S1 EE2 won third prize.\nDaniel George (S7 EE1), Diya Jose, Vishnu M. Nair, Abinshah Ameer and Gayathri L. (S7 EE2) have cleared TCS interview and have been shortlisted for NINJA.\nA. K. Vineeth (S7 EE1), Abhiram A., Gayathri L. and Gowri B. K. (S7 EE2) have been offered job at Cognizant.\nAnn Elizabeth and Sruthi S. B. of S7EE1 are selected as the IEEE All Kerala Power and Energy Society Student Colloquium 2020 Campus Ambassador.\nDevika G.R. and Anupriya S. of S5 EE2 have been selected to participate in the District level Power Quiz competition conducted by KSEB Engineers Association.\nMr. Noel Mathew Jacob (S7 EEE) won the IET KKLN Gladiator Award.\nMr. Balu Bijubal (S7 EEE) won the IET KKLN Shining star Award.\nVaishnavi (S6 EE1), Abinshah Ameer (S6 EE2), Amaze Anna Toms (S6 EE2), Nanditha Sai Prasanth (S6 EE2) and Vishnu M Nair (S6 EE2) won Second Prize in the Reboot Kerala Hackathon organized by ASAP and Dept of Higher Education, Kerala held from 7 to 9 August 2020.\nLavina S. Vijay (S8 EE1) bagged the Proficiency award and Prof. R. V. Chitra Memorial Award of Mar Baselios College of Engineering and Technology Thiruvananthapuram.\nLavina S. Vijay (S8 EE1) bagged the Proficiency award and Prof. R. V. Chitra Memorial Award of Mar Baselios College of Engineering and Technology Thiruvananthapuram.\nLavina S. Vijay (S8 EE1) is the topper of S1-S8 KTU Examinations in 2016-20 EEE Batch.\n2019-20\nJerin Sam James, Joseph John Panicker, Midhun M. S. (S8 EE1), Jobby Johnson (S8 EE2), Gouri A. V. (S8 ECE) and Merin Jose (S8 CSE) won the Prelims of Smart India Hackathon 2020 in the Software Edition, held on 27 January 2020.\nNanditha Sai Prasanth, Vishnu M. Nair, Amaze Anna Toms, Abinshah Ameer, Geoji George, Vaishnavi Sreekumar (S6 EE2) won the Prelims of Smart India Hackathon 2020 in the Hardware Edition, held on 27 January 2020.\nThe team “Blitzkrieg” consisting of members Nanditha Sai Prasanth, Vishnu M Nair, Abinshah Ameer, Amaze Anna Toms, Vaishnavi Sreekumar (S6 EE1), Geoji George were qualified to the second round of “Reboot Kerala Hackathon” under “Energy” category. The topic chosen was “IoT device to analyze energy pattern of Domestic/Industrial appliances and equipment”.\nThe team “ENIGMA” consisting of members Vaishnavi R Nair, Joyal T John, Adarsh Vijayakumar, Karthik J., (S6 EE2) Dakshina V. and Balu Bijubal (S6 EE1) were qualified to the second round of “Reboot Kerala Hackathon” under “LSGD” category. The topic chosen was “Detection of illegal construction using data analytics tool”.\nAbhijith A, Ananth A J, Gautham B R, Rahul S Nair, S N Adithya and Vishnu J B (S3 EE1) secured first position in the prelims round of BMW Engine Diagnosis held at Heera College of Engineering & Technology in association with Elan & Nvision IIT, Hyderabad organized by Utkraanti (National Level Championship).\nJerin Sam James (S7 EE1) and Jobby Johnson (S7 EE2) participated in the event NASA Space Apps Challenge 2019 conducted at St. Joseph’s College of Engineering and Technology, Pala. Among 17 teams, 3 teams were selected for All India level NASA space app challenge, which was held on 18 October 2019 at Delhi.\nA team from S8 EEE consisting of Jerin Sam James (S8 EE1), Jobby Johnson (S8 EE2), Joseph John Panicker (S8 EE1) and Midhun M. S. (S8 EE1) got qualified for District level selection in Young Idea Presenter organized by KSUM and KDISC.\nJobby Johnson (S7 EE2) won the Regional Present Around The World (PATW) Competition, conducted by IET.\nFebi Shine B S (S7 EE2) won first prize for KSEB Power Quiz conducted in College level and second prize for LUCA Science Quiz.\nNavneeta Anil (S7 EE2) won Second prize for Paper presentation in LBS technical fest-PRAYAAG.\nMuraleekrishnan (S7 EE1) completed NPTEL online certification course on Introduction to Wireless and Cellular Communications.\nNarmada M. S. (S7 EE2) was the topper and won gold certificate for NPTEL online certification course on IOT by scoring 99%.\nGowri Gopal (S7 EE2) won gold certificate for NPTEL online certification course on IOT by scoring 90%.\nShinoj Philip John (S7 EE2) was selected as the Senate Vice Chairman.\nDiya Santa D. R. (S7 EE2) was selected as the Senate Joint Secretary.\nSajeevan (S7 EE2) was selected as the MBCET cricket team captain.\nAdithya S. Kumar (S7 EE1) was selected as the ISTE branch representative of EEE department.\nAleena Anna Mathew (S7 EE1) was selected as the IEEE EMBS Chairperson.\nChristy Alex (S7 EE2) was selected as the IEEE Chairperson.\nAthul Satheesh (S7 EE2) was selected as the IEEE Design head.\nDaniel John (S7 EE2) was selected as the IEEE representative.\nAneeth M. (S7 EE1) was appointed as the Block Chain Community Head, IEDC.\nJerin Sam James (S7 EE1) was appointed as the Head of Robotics, IEDC.\nJobby Johnson (S7 EE2) was appointed as the CEO of IEDC.\nJobby Johnson (S7 EE2) was appointed as the Chairman of RAS.\nJoseph John Panicker (S7 EE1) was appointed as the Chief Marketing Officer of IEDC.\nSanjna Pramod (S7 EE1) was appointed as the Executive Curator, IEDC.\nGautham K Sajith S7 EE2) was appointed as the Creative Curator, IEDC\nJerin Sam James (S7 EE1) was appointed as the General Secretary of Illumina.\nAdithya S. Kumar (S7 EE1) was selected as the Treasurer of Illumina.\nMidhun M. S. (S7 EE1) was appointed as the Technical Head of Illumina.\nAkhil Reji George (S7 EE2) was appointed as the Illumina programme convener.\nGautham K Sajith and Gowri Gopal (S7 EE2) were appointed as the Illumina Media Secretary.\nAjay Sreekumar (S7 EE2) was appointed as the Illumina Non technical head.\nSanjo Santhosh (S7 EE1) was selected as the Technical Member of Illumina.\nSherin Kochummen (S7 EE1) was appointed as the Illumina Non technical mmeber.\nAishwarya A. P. (S7 EE2) won first prize in the Doodle competition conducted by IET MBCET.\nAishwarya A. P. (S7 EE2) won third prize for Essay writing Malayalam in Baselian fest.\nSanjna Pramod (S7 EE1) won first prize for Extempor (English) and Debate (English) and second prize for English Versification in Baselian fest.\nDivya Nair (S4 EE1) participated in the item Indian Classical Dance (Mohiniyattam) in the APJ AKTU South Zone Youth Festival 2019-20.\nJ L Sreelakshmi (S7 EE2) won third prize for Pencil drawing competition held by Prakruthi, Nature club.\nJerin Sam James (S7 EE1) won first prize for Javelin and third prize for Shotput in the College Annual Athletic meet.\nAnas M. (S7 EE1) won third prize for Hammer throw and third prize for Discuss throw in the College Annual Athletic meet.\nAjay Sreekumar (S7 EE2) won bronze medal for 4×100m Relay in College Annual Athletic meet.\nSebin Sebastian (S7 EE2) won first prize for long jump and third prize for relay in the College Annual Athletic meet.\nMohammed Sidhan N (S5 EE1) won first prize in the All Kerala Lawn Tennis Tournament.\nMohammed Sidhan N (S5 EE1) participated in the South Zone Inter University Tennis Tournament.\nDakshinaV (S6 EE1) and Arjun U. (S6 EE2) won first prize in the All Kerala Netball Tournament.\nArjun U. (S6 EE2) participated in the All India Inter University Netball Tournament.\nArjun U. (S6 EE2) and Alan Das S. (S4 EE2) were runners up in the Trivandrum District Senior Netball Championship held at MBCET, Trivandrum.\nAmy Rachal Robby (S1 EE1), Archana Vijayakumar and Rithika Pradeep (S1 EE2) won third prize for A-zone Shuttle Badminton Tournament.\nAlan Das (S4 EE2) won 1st prize in Shot put for Baselian Tournament.\nHe was a member of the Netball team who became Champions for the KTU Sports tournament deep (S1 EE2) won third prize for A-zone Shuttle Badminton Tournament.\nAkhil Reji George (S8 EE2) was the second runner-up for Baselian premier league.\nAnnapoorna S. and Riya Mary Jacob (S3 EE2) won third prize for A-zone Table Tennis Tournament.\nDevika Dinesh (S3 EE1), Parvathy B. Ajit (S3 EE2) and Aswathy Sujith (S1 EE2) won first prize for A-zone Basketball Tournament.\nDevika Dinesh (S3 EE1), Parvathy B. Ajit (S3 EE2) and Aswathy Sujith (S1 EE2) won first prize for All Kerala Basketball Tournament.\nSruthi T. Nair (S5 EE1) and Vaishnavi R.Nair (S5 EE2) won second prize for A-Zone Chess Women Tournament.\nM.Abhijith (S1 EE1) and Kurien Koshy (S1EE2) won second prize for A-Zone Chess Tournament.\nM. Abhijith (S1 EE1) and Kurien Koshy (S1EE2) participated in the All Kerala Chess Tournament.\nHassain Hashim (S1 EE2) won third prize for A-Zone Handball Tournament.\nAbhinand S. (S1 EE2) and Naveen Sreenivas (S6EE1) participated in the All-Kerala Kho-Kho Tournament\n2018-2019\nAiswarya Ajay, Midhun M. S., Vrinda A. R. (S6 EE1) has actively participated in Workshop on DIALux and Lighting Design at MBCET on 31\nst\nMarch 2019.\nMidhun M. S. (S6 EE1) attended Mobile Photography workshop held as part of Ragam ’19 at National Institute of Technology Calicut from March 22 to 24, 2019.\nMathew Sibi (S6 EE1) attended an Interactive Session on MotorC by TORC on 10\nth\nMarch 2019 as part of Crossroads ’19.\nViswanth V. S. (S6 EE1) attended Virtual Reality Workshop conducted on 2\nnd\nMarch 2019 as part of Crossroads ’19 in association with Kerala Start up Mission and IEDC.\nJoseph John Panicker (S6 EE1) won first prize (cash prize) in Penta abilita (presentation in 5 mins) and also third prize in ‘talent de presentation’ (paper presentation) for Cogniz ’19, a techno-cultural fest of Bishop Jerome Institute of Engineering and Technology from 18\nth\nto 20\nth\nFebruary 2019.\nRahul S. (S6 EE1) attended Build with Virtual Reality Workshop conducted at GEC, Barton Hill in association with Aagneya ’19 on 16\nth\nand 17\nth\nFebruary 2019.\nRahna R. N., Reshma Susan John, RehnaIlliyas, Rahul S., Anas M. and Bibin Sam Varghese (S6 EE1) won second prize in DA VINCI, a workshop on plotters, conducted by TachlogPvt. Ltd on 2\nnd\nand 3\nrd\nFebruary 2019 as a part of Aagneya ’19, by Government Engineering College, Barton Hill, Trivandrum.\nJerin Sam James and Midhun M. S. (S6 EE1) attended STTP on E-Vehicle: A Green approach for Sustainable Development, organised by Dept. of EEE, MBCET, from 7\nth\nto 11\nth\nJanuary 2019.\nJerin Sam James (S5 EE1) has been appointed as Chief Technical Officer of Catalyst MBCET IEDC from 15\nth\nJanuary 2018 to 31\nst\nDecember 2018.\nReshma Susan John attended Artificial Intelligence & Deep Learning Workshop, organised by ISTE MBCET students’ chapter in association with Department of Computer Science & Engineering, MBCET during July 30\nth\n, 31\nst\nand November 10\nth\nand 11\nth\n, 2018.\nAleena Anna Mathew, Jerin Sam James, Joseph John Panicker, Mekha Nair M. I., Midhun M. S., Sanjna Pramod (S5 EE1) Aravind H, Ashwini A. Kammath, Vaishaki Ramesh (S5 EE2) attended the IOT congress held in Bangalore on October 9 and 10, 2018.\nMidhun M. S. (S5 EE1) underwent a five days long internship program on Motion controllers using LabVIEW from 17/7/2018 to 21/7/2018 by TIERA\nAdarsh Chandra Mohan, Adithya S. Kumar, Bibin Sam Varghese, Lavina S. Vijay, Souparnika V. M. attended the Short term training programme on Distributed Generation and Smart Grid in MBCET from 30 July 2018 to 1 August 2018.\nAiswaryaVijayan, Anna Sara George, GopikaChandralal, Neha Nataraj, Sangeetha G. S. (S5 EE1) completed Industrial Training conducted by KSEB at 110 KV substation Paruthippara from 28-7-18 to 02-8-18.\nAbhiram S, Drishya Raj, SherinKochummen, Teena Anna Mathew (S5 EE1) successfully completed the Internship training at KeltronKarakulam Trivandrum from 12-7-18 to 18-7-18.\nAleena Anna Mathew has successfully completed the Internship Training at KeltronKarakulam Trivandrum from 26-7-18 to 31-7-18.\nAdarsh Chandra Mohan, Akhil Mohan, Anatha Krishnan R, Anas M, Mathew Sibi, Rahul S., Sandeep M. S. (S5 EE1) completed Industrial Training at KSEB 66 KV substation Vattiyoorkavu from 9-7-18 to 13-7-2018.\nAdithya S. Kumar, Bhavana Suresh, Vishnuduth A. S. (S5 EE1) participated in the 5 day long Internship Programme in Tyrannus Innovative Engineering and Research Academy Private Limited from 17-7-18 to 21-7-18.\nAparna Srikanth (S5 EE1) has successfully completed the NPTEL course on Sustainability through green manufacturing systems.\nBhavana Suresh (S5 EE1) has successfully completed the NPTEL course on Innovation, Business Models and Entreprenurship.\nJosna Jose, Lavina S. Vijay, and Souparnika V. M. (S5 EE1) successfully completed the NPTEL course on Fundamentals of Electrical Engineering.\nAnakha L. V., Lavina S. Vijay, Parvathy Ajayan, Manisha Manoj and Souparnika V. M. (S5 EE1) completed 5 days Internship Programme at Poojappura substation.\nBibin Sam Varghese (S5 EE1) completed Industrial Training on Manufacturing of MCB from 7-7-18 to 25-7-18.\nShinoj Philip John, Sebin Sebastian, Jonathan Joseph Cleetus, Sanjo Santhosh, and Rohit Mathew Samuel (S5 EE1) participated in the Industrial Training conducted by KSEB at 110 KV substation TERLS from 4-7-18 to 9-7-18.\nJobby Johnson (S5 EE2) participated in Hovercraft competition & Aero Modelling competition held at IIT Madras as part of Shaastra 2018.\nAmal S, Navneeth M. S , Naveen Sreenivas, Prabhu Prakash, Ann Elizabeth Babu, Arjun Vinod, BaluBijubal,  LaluPremjith, Sherry M. Elias (S3 EE) participated in robotic workshop level 1 conducted by IEDC MBCET on 7\nth\nand 8\nth\nOct 2018.\nReshma Susan John, Vrinda A R (S5 EE1), Navya S. Warrier, Amritha P Anil, Sruthi S B, Sruthi T Nair, AnupamaS,Nandana S. Nair (S3 EE1) participated in Photoshop workshop by IEEE-WIE society at MBCET on 11-8-18.\nAleena Anna Mathew (S6 EE1) was selected as the Secretary of IEEE-MBCET EXECOM 2018-19.\nLavina Vijay, Rahul S. and Souparnika V. M. (S6 EE1)\nsecured first position\nin Fine Arts Marathon held as part of Ragam ’19 at National Institute of Technology Calicut from March 22 to 24, 2019.\nAkhil Mohan, Joseph John Panicker, Mekha Nair M. I., Midhun M. S., Neha Nataraj, Sanjna Pramod, Sanjo Santhosh, Sree Hari S. B., Vrinda A. R. (S6 EE1)\nsecured third position\nin Fine Arts Marathon held as part of Ragam ’19 at National Institute of Technology Calicut from March 22 to 24, 2019.\nAbhijithSyam, Eldose George (S6 EE2) secured first prize in Group Song for Baselian Fest 2019.\nAbhijithSyam, Eldose George (S6 EE2) secured first prize in Group Song for Ragam ’19 at National Institute of Technology Calicut from March 22 to 24, 2019.\nAbhijithSyam, Eldose George (S6 EE2) secured first prize in Group Song for Hestia ’19, held at TKM College of Engineering Kollam on 31\nst\nMarch 2019.\nAishwarya A. P. (S6 EE2) secured third prize in Essay writing for Baselian Fest 2019.\nAkhilReji George, Febi Shine (S6 EE2) secured first prize in Malayalam debate for Ragam ’19 at National Institute of Technology Calicut from March 22 to 24, 2019.\nAkhilReji George (S6 EE2) secured second prize in Malayalam debate at LBS Poojappura on March 3\nrd\n, 2019.\nAkhilReji George (S6 EE2) secured third prize in English debate at LBS Poojappura on March 3\nrd\n, 2019.\nAkhilReji George (S6 EE2) secured first prize in Malayalam debate for Baselian Fest 2019.\nAshwini Kammath got the IET Best Leadership Award.\nAleena Anna Mathew (S6 EE1) secured first prize in Short story writing for Baselian Fest 2019.\nFrijina A. (S6 EE2) secured third prize in Short story writing for Baselian Fest 2019.\nJobby Johnson got the IET Best Young Engineer Award.\nAkhilReji George, Febi Shine (S6 EE2) secured first prize in Malayalam debate for Ragam ’19 at National Institute of Technology Calicut from March 22 to 24, 2019.\nJonathan Joseph Cleetus, ManjimaManikandan (S6 EE2) secured third prize in Malayalam debate for Ragam ’19 at National Institute of Technology Calicut from March 22 to 24, 2019.\nShinoj Philip (S6 EE2) secured third prize in Malayalam debate at LBS Poojappura on March 3\nrd\n, 2019.\nJerin Sam James, Bibin Sam Varghese, Akash R. S., Drishya Raj, Manisha Manoj, AiswaryaVijayan (S5 EE1) volunteered in strengthening post flood relief work conducted by District Administration from 24\nth\nto 31\nst\nAugust 2018.\nAdithya S. Kumar, Joseph John Panicker, Mekha Nair, Bhavana Suresh, volunteered in strengthening post flood relief work conducted by Bhub.\nJobby Johnson (S5 EE2) had participated in expo in Adharva 2018.\nGeogi George and LinsonS of S4 EE2 represented MBCET in mime competition and secured first position in the fest of LBS Institute of Science and Technology.\nS. Sajeevan (S5 EE2) got selected in KTU university Cricket team.\nA total number of 6 students from S8, EE are placed in various companies namely IBS, Infosys and Sportshood.\n2017 – 2018\nJoyal T. John of S4 EE2 was one amongst the four members of MBCET e-yantra team who won second placeinAll India National Level Robotic Competition held in IIT Bombay.\nMs.Julie Elis Lagi of S4 EE2 represented KTU for All India Inter University Netball Tournament 2019.\nJerin Sam James, Joseph Panicker, Abhiram A P, Midhun M S of S4EE1 and Jobby Johnson (S4EE2) got their idea selected as\nBEST IDEA\nin the prestigious event IDEA FEST 2018 conducted by Kerala Startup Mission.\nProject Name:\nGreen Aqua Generator\nFablab support and mentoring with funding support:\nRs. 20,000/-\nSajeevan R S and Nikhil P Nair of S4EE2 participated in Autobots Workshop at MBCET on 24th & 25th March 2018.\nA total of 20 students (S6EE1, S6EE2, S4EE1 and S4EE2) completed TIERA internship on Labview at MBCET on 16th to 21st July 2018.\nSandra, Varsha and Allen J of S6EE1 participated in KAIZEN IOT Workshop conducted by IIT Madras during the month of June, 2018.\nAditya S Kumar, Bibin Sam Varghese an Adarsh Chandra Mohan of S4EE1 participated in “Think 10X” Workshop conducted by IEDC at MBCET on 24th February 2018.\n6 students of EEE department attended “Photography Workshop” conducted by ASCE-MBCET on 20th July 2018.\nAll the students of S2EE, S4EE and S6EE completed their internship at many places of KSEB Electrical section office, Milma plant, TELK Angamaly and Accubits Technologies during June – July 2018.\n4 students of S8, EE got placed in the companies Infosys and Travancore Analytics.\n20 students from S4 EE1 and EE2 attended the TEDX workshop on 26th August 2017.\nAll the students of S2, EE1 participated in Shrieeek, Introduction to IEEE organization conducted at MBCET at 13th January 2018.\nAshwini A Kammath, Aravind H, Diya Santha D R, Gautham K Sajith, John T P, Navneetha of S4, EE2  and Adithya S Kumar, Aparna and Bhavana of S4, EE1attended Workshop on sixth sense Robotics at IIT Madras on 10th January 2018.\nAsish A, Daniel, Yadhu (S4, EE2) Jerin Sam James, Abhiram S, Muraleekrishnan, Arjun and Joseph John Panicker of S4, EE1 participated in Drone Workshop held at IIT Madras on 6th January 2018.\nJobby (S4, EE2), Joseph John Panicker (S4, EE1) and Jerin Sam James (S4, EE1) participated in “Aero Modelling & hovercraft competition” at IIT Madras on 5th – 7th January 2018.\nMany students of S2, EE1 participated in mobile making workshop held at MBCET.\nMany students of S2EE1, S4EE2 attended Ethical Hacking Workshop on February 2018.\nJobby (S4, EE2) was elected as “IEDC Execom Member Creative Curator”, Joseph John Panicker (S4, EE1) was elected as “Creative Curator of IEDC” Jerin Sam James (S4, EE1) was elected as Chief Technical Officier of Catalyst MBCET IEDC from 15th January to 31st December 2018.\n2016-2017\nSemifinalist  – The Hyperloop One Global Challenge\nHyperloop One is a new way to move people and things at airline speeds for the price of a bus ticket. It is a futuristic concept of passenger and freight transportation using pod-like vehicles that propel through near vacuum tubes at speeds even more than airlines, around 760 miles per hour (approx 1220 km per hour). This concept of transportation was brought to the frontlines by none-other-than the legendary innovator Elon Musk.\nFounded in 2014 and headquartered in Los Angeles, the Hyperloop One company is led by CEO Rob Lloyd and co-founded by Executive Chairman Shervin Pishevar and President of Engineering Josh Giegel. In May 2016, Hyperloop One launched a Global Challenge as an open call to individuals, universities, companies and governments to develop comprehensive proposals for using Hyperloop. Out of the 35 semi-finalists worldwide, five locations are in India and one of the corridors for Hyperloop in the semi-finalist round was Bengaluru-Trivandrum, suggested by a 1st year MBCET student.\nThe Hyperloop One Vision for India, showcased the 5 Hyperloop One Global Challenge (HOGC) semifinalists teams from India, each of which proposed high-speed transportation routes that could improve the lives of millions of Indian citizens. The HOGC required the teams to develop regional proposals integrating Hyperloop One’s transport technology to move passengers and freight from point-to-point, swiftly, and on demand. India led the way with highest number of registrants and had the most vocal supporters of Hyperloop One on social media.\nMr. Joshua Biju Thomas\n(S2 EE2), the semifinalist who suggested the Bangalore-Trivandrum corridor and his team – Mr. Arun S Mathew (Asst. Prof, EEE Dept), Mr. Jerin Sam James (S2 EE1) showcased their proposal on February 28th, 2017 in Taj Mahal Hotel, New Delhi, at the Innovation Summit – The Hyperloop One Vision for India in New Delhi. The Backup team in the College, for Technical Guidance and Coordination includes Dr. M Satyakumar (HoD, CE), Ms. Jomole Joseph (Asst. Prof, EEE) and Ms. Soumya A V (Asst. Prof, EEE), and supported by Fr. Wilson Thattarathundil- Bursar, Dr. T M George- Principal and Prof. Shajilal A S (HoD, EEE).\nThe showcase event was graced by the presence of an esteemed panel of guests including Suresh Prabhu, Minister of Indian Railways and Amitabh Kant, CEO of NITI Aayog. And the primary point of focus for the government was that Hyperloop would further better their pace of urbanisation, leading to improvements and job creation in new cities. They were of the opinion that India is in need of very sustainable and transformational form of technology, and Hyperloop definitely presents a strong case.\nAiswaryaVijayan, Anna Sara George, Gopika Chandralal, Sangeetha G. S. of S3, EE1 participated in the Sphere Drone Design Workshop conducted by Aerotrix at Government Engineering College Barton Hill, Thiruvananthapuram under the banner of Aagneya ’17 on 4th& 5th February 2017.\n31 students of S3, EE1 participated in Shrieeek 2017, Introduction to IEEE organization conducted at MBCET on 11th February 2017.\nAbhiram A. P., Adithya S. Kumar, Bhavana Suresh, Jerin Sam James, Midhun M. S., of S3, EE1 participated in the Intel Innovator Activity held at MBCET on 18th February 2017.\nRohit Mathew Samuel (S3, EE1) participated in the NodeMCU Workshop conducted by RoboCET on 5th March 2017 as an initiative of Drishti 2017, technical fest of CET.\nAbhiram A. P., Jerin Sam James of S3, EE1 participated in Arduino Buzz held as a part of the National level Intercollegiate fest of LBS Institute of Technology for Women, Poojappura – Yagna Dhruva ‘17 on 12th and 13th March 2017.\nAbhiram A. P., Jerin Sam James of S3, EE1 participated in Tech Olympiad held as a part of the National level Intercollegiate fest of LBS Institute of Technology for Women, Poojappura – Yagna Dhruva ‘17 on 12th and 13th March 2017.\nLavina S. Vijay (S3, EE1), Aarathy B Mohan (S5, EE2), Akshara Jalasteen (S5, EE2), KrishnaKumar P S (S5, EE2) and Sachin Satheesh Kumar (S5, EE2) completed a two-day project based training programme on RC Aircraft Design conducted by Skyfilabs at MBCET on 19th March 2017.\nStudents of S7, EE completed their 4 days Industrial training at Sabarigiri Power House, Moozhiyar, Lower Periyar Power House, Kakkayam Power House, 110kV Substation Parutipara, 220kV Substation Pothencode and 110kV Substation Thirumala from 8th – 19th May 2017.\nJerin G Sam (S3, EE1) got first prize in Idea presentation competition conducted as a part of IEEE International Conference on Networks and Advances In Computational Technologies (NetACT17) conducted by Department of Computer Science and Engineering in association with IEEE computer society student chapter, MBCET from 20th – 22nd July 2017.\nAll the students of S3, EE1 completed their internship at many places of KSEB Electrical section office during June – July 2017.\nAll the students of S3, EE2 completed their internship at KSEB Electrical section office, Keltron and Bhub during June – July 2017.\nGreeshma Susan John and Neeraj of S7, EE completed their at NIISH from 3rd to 15th July 2017.\nAthul Nair, Arya S L, Fathima S, Greeshma Susan John, Neha, Lisna of S7, EE, Jerin G Sam (S3, EE1) and Jobby Johnson (S3, EE2) attended E-Yantra Workshop held at MBCET from 17th to 21st July 2017. They had an introduction and project session with Fire bird 5, Raspberry Pi, Aurdino and Serial Interfacing.\nJobby Johnson (S4, EE2) and Jerin Sam James (S4, EE1) were chofor doing internship with IoT team at EY, Trivandrum.\nA total number of 6 students from S8, EE are placed in various companies namely IBS, Infosys and Sportshood.\nShilpa Susan Peter (M.Tech, Power Control and Drives) secured Kerala University first rank in the year 2014 – 2016.\n3 students of S8, EE secured 1st prize in World Space Week- 2016 presentation competition conducted by ISRO on October 2016.\nStudents attended\n: Ann Mary Toms, Jaisal Jacob and Sreejith R\n5 students of S5, EE International Seminar on Power India: “Impacts of Climate Change and Imperatives for Rapid Transition” at Energy Management Center, Sreekaryam, Trivandrum from 14th to 15th November 2016.\nStudents attended\n: Ananthakrishnan P, Amal V, Greeshma Susan John, Anjali S K, Gayathri Gopal V and K Mano Chandran.\n30 students of S8, EE completed a one day Industrial Visit to Sabarigiri Hydroelectric Power Plant, Moozhiyar on 18th February 2017.\n2 students of S8, EE secured 3rd prize in paper presentation in KSEB Engineers Association on February 2017.\nStudents attended\n: Donna David and Sarreen Sara Solomon\nJongee Chandy and K Mano Chandran (S6, EE) secured 2nd position in the college level “Grandmaster’s Quiz” conducted by ISTE Chapter – MBCET on September 2016.\nAmal Praveen (S5, EEE) secured gold medal in junior and senior level District Weight Lifting competition held on 21st April 2016.\nAmal Praveen (S5, EEE) secured silver medal for junior level and bronze medal for senior level District Power Lifting competition held on 9th June 2016.\nSara John and Gayathri Gopal of S5, EEE secured 1st prize in Inter branch Caroms competition held on March 2016.\nKrishna Prasad S S (S5,EEE) banned 1st  prize for Orchestra and 2nd prize for Stringed Instrument (Eastern) in Kerala University Kalotsavam held on 17th April 2016.\nAkshara M A (S7, EEE) secured 2nd prize for Keralanadanam in Kerala Youth Festival held on 16th – 20th March 2016.\nSareen Sara Solemon banned 1st prize for the following events namely Ganamela, Percussion Solo Western and University Netball in Kerala Youth festival held on 16th – 20th March 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in Barton Hill Fest held on 6th March 2016.\nNandhakumar and Brahmanand M secured 1st prize for International Hip Hop Championship at NIT Calicut held on 4th April 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in Lourde Matha College of Engineering, Trivandrum held on 7th April 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in Kottayam Rajeev Gandhi College held on 8th April 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in SCT Fest Cult a Way at SCT, Trivandrum on 9th April 2016\n2015 – 2016\nAmal Praveen (S5, EEE) secured gold medal in junior and senior level District Weight Lifting competition held on 21st April 2016.\nAmal Praveen (S5, EEE) secured silver medal for junior level and bronze medal for senior level District Power Lifting competition held on 9th June 2016.\nSara John and Gayathri Gopal of S5, EEE secured 1st prize in Inter branch Caroms competition held on March 2016.\nKrishna Prasad S S (S5,EEE) banned 1st  prize for Orchestra and 2nd prize for Stringed Instrument (Eastern) in Kerala University Kalotsavam held on 17th April 2016.\nAkshara M A (S7, EEE) secured 2nd prize for Keralanadanam in Kerala Youth Festival held on 16th – 20th March 2016.\nSareen Sara Solemon banned 1st prize for the following events namely Ganamela, Percussion Solo Western and University Netball in Kerala Youth festival held on 16th – 20th March 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in Barton Hill Fest held on 6th March 2016.\nNandhakumar and Brahmanand M secured 1st prize for International Hip Hop Championship at NIT Calicut held on 4th April 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in Lourde Matha College of Engineering, Trivandrum held on 7th April 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in Kottayam Rajeev Gandhi College held on 8th April 2016.\nNandhakumar and Brahmanand M secured 1st prize for dance in SCT Fest Cult a Way at SCT, Trivandrum on 9th April 2016\nInternship Programmes and Activities\nJuly 2024 – February 2025\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\n(July 2024 – February 2025)\nSUMMARY SHEET\nSl No\nBatch & Class\nTotal number of students who attended internships during the AY 2022-’23\nTotal strength of the class\nPercentage\n1\n2024 -’28 Batch EE\n0\n58\n0.0\n2\n2024 – ’28 Batch EL\n0\n63\n0.0\n3\n2023 -’27 Batch EE\n30\n62\n48.4\n4\n2023 – ’27 Batch EL\n34\n62\n54.8\n5\n2022 -’26 Batch EE\n14\n48\n29.2\n6\n2022 – ’26 Batch EL\n17\n43\n39.5\n7\n2021-’25 Batch EE\n1\n50\n2.0\nOverall Percentage\n96\n386\n24.9\n2021-’25\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2021-’25\nCLASS:\nEE\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\nYBI Foundation\n6/6/2024-20/6/2024 & 15 days\nAdarsh H.\n1\n2022-’26\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2022-’26\nCLASS:\nEE\nSl No\nIndustry/Organisation\nDates of internship programme and no of days\nNames of the students attented\nTotal number of students attended\n1\nKSEB:- Transformer maintainance and repairing unit, Thirumala\n1/7/24 – 5/7/24 (5 days)\nMerlin Raji\n1\n2\nKSEB Substation,Paruthippara\n8/7/24 – 12/7/24 ( 5 days)\nRonn Koshy, Athul Krishna P, Madhav Madhusoodan,Aaron Joseph\n4\n3\nKSEB 110 KV Substation,\nThirumala, TVM\n01-07-2024 to 05-07-2024\n(5 days)\nJaish J S, Karthik K, Thejas Krishna A L,\nVaishnav K\n4\n4\nKSEB 110KV Substation,\nMedical College, TVM\n02-07-2024 to 06-07-2024\n(5 Days)\nDevika B A, Rohith Babu S, Sachith S Santhosh, Sriparvathi SP,  Suryanarayanan S\n5\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2022-’26\nCLASS:\nEL\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\nVSSC Thiruvananthapuram\n9/12/24 – 23/12/24 (11 days)\nRachel Antony P\n1\n2\nRevertech IT solutions\n4/01/2025 – 8/01/2025\nSrevya S Deep, Thamanna Prasanth, M S Manas,Mohammed Afroz,Tiya Mathew,Sourav V Nair, Ujwal Reji\n7\n3\nKeltron\n9/12/14-16/12/24\nAdithya S Pillai,Anand S Ganesh,Berni Albert,Dhanush Krishnan A U,Kurias Mathew,Nanda V S,Niranjan B,Philip B George,Vishak B Shrinivas\n9\n4\nLogicPlum\n4/12/2024-31/12/2024\nMilan S\n1\n2023-2027\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2023-2027\nCLASS:\nEE\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\n110KV Substation, Paruthippara\n27-11-24 to 02-12-2024                 (5 days)\nAkshitha Mohan R V,Bhagya R Nair , Arpitha R N, Anna Koshy,Anupama M , Shreya Ann Jacob\n6\n2\nKSEB 110kV SUB-STATION (PARUTHIPPARA)\n17/12/24 to 21/12/24 (5 Days)\nAadhikesh S, Deepak N.S.,Feba Maria Nelson, Gautham Krishna M, Lesin Lama Levan, Udit Krishna\n6\n3\nKSEB 110kV SUB-STATION (PARUTHIPPARA)\n6/12/24 to 11/12/24 (5 Days)\nJonath Vinamsi,Allen Anil,Alin Stanly,Nandana Priya P,Aromal P Nair,Meghna P ,Adith.M\n7\n4\nKSEB 110kV Substation, Medical College\n9/12/2024 to 13/12/2024 (5 Days)\nD Maheshwar, Dheeraj R.S, Festin Fleenton Pereira, Harisaran S.P\n4\n5\nSmart City Thiruvananthapuram Ltd\n26/12/24 – 4/1/25\nChristopher George, Adarshkumar, Pranav B, Anudeep Krishna, Jeevan B\n5\n6\nVizhinjam International Seaport Ltd\n17/12/24 to 21/12/24  (5 days)\nHiran H.       Niranjan B.\n2\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2023-2027\nCLASS:\nEL\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\nAT group at MBCET & IEEE EMBS Kerela Chapter\n1st to 12th July 2024 , 10 days\nSooraj R Pillai, Abhishek J, Hanok, Manuraj\n4\n2\nKeltron\n12th to 26td Dec 2024, 2 weeks\nAdithyan J, Saurav G Nair,\nSooraj R Pillai, Sreeram R Nair,\nAdvaith Renjith\n5\n3\nKeltron\n6th to 12th Dec 2024, 1 week\nPrathyusha N Nair\n1\n4\nKeltron\n10th to 16th Dec 2024, 1 week\nNiranjan Babu J\n1\n5\nEqugit Solutions Technopark\n19th Dec 2024 to 19th Jan 2025, 30 days\nAdithya S Krishna, Shibin S R, Gouri Nandhana\n3\n6\nICT ACADEMY,Technopark\n16th Dec 2024 to 12th Jan 2025,1 month\nAmal S Shafeek,Aneeta Sibi,Anna Susan George,Ardra S,Bhadra G Nair,Hanok Samuel Boban,Jayasree G Kalkura,Manuraj M S,Meenakshi M S,Namitha Mohan\nSabeeh Ahamed P S\n11\n7\n110 KV Substation Paruthippara\n30th Dec 2024 to 3rd Jan 2025,5 days\nAshtami Viswanath,V S Sivapriya\n2\n8\nKELTRON\n09-07-2024 TO 15-07-2024\nDhiya K., Deepthe S. ,Ryan Mathew Mannual,Aman Khan,Abraham Jacob\n5\n9\nALGOL SOFT TECH PRIVATE LIMITED\n2.12.24 to 14.12.24\nArdra S & Bhadhra G Nair\n2\nDEPARTMENT OF EEE\nINTERNSHIPS MORE THAN ONE WEEK FOR THE ACADEMIC YEAR 2024-’25  (July 2024 to February 2025)\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended and Semester\nTotal number of students attended\n1\nYBI Foundation\n6/6/2024-20/6/2024 & 15 days\nAdarsh H. – S7 EEE\n1\n2\nAMAZON WEB SERVICES\n8-07-2024 to 04 Sep 2024   & 1 month\nVarsha Rachel George,Rachel Antony,Sinta Maria Richard,Santra Anna Richard,Josna Jomon (S5 EL)\n5\n3\nAT group at MBCET & IEEE EMBS Kerela Chapter\n1st to 12th July 2024 , 10 days\nSooraj R Pillai, Abhishek J, Hanok, Manuraj,V.S Sivapriya,Ashtami Vishwanath (S3 EL)\n6\nInternship details of students\nAcademic Year\nTotal number of students who attended internships\n2021-22\n92\n2020-21\n88\n2019-20\n89\nInternship Programmes\nAn introductory webinar session on “Zero-Watt smart energy monitor” was conducted for EEE students by Mr. Ansha Naji, Senior Manager, Business Development, NTPC and Technical Head, Alpha Geek Enterprises on 12/02/2022 from 10:45 am – 11:30 am. This was held as a part of the internship program on “Zero-Watt Technology” to be offered by Alpha Geek for EEE students. The interns will get an extensive exposure to the technical, business and marketing aspects for a start-up. Ms C. Sojy Rajan, Assistant Professor, EED was the coordinator of the event.\nA 5-day internship programme on Motion Control using LabVIEW was conducted from 17/07/18 to 21/07/18. Mr. Shino G. Babu, TIERA Trivandrum was the resource person. 24 students successfully completed the programme. The programme was coordinated by Ms. C. Sojy Rajan, Assistant Professor.\nStudent Projects\n2023-24\nIEEE PES QUIZ\nThe result of the IEEE PES QUIZ conducted by IEEE PES students branch of MBCET on 15 October 2024 was announced. 1\nst\nposition was secured by\nArvind Vinod\n(S1 EC2)., 2\nnd\nposition by\nRoshan George Jim\n(S1 CT) and 3\nrd\nposition by\nArddish R\n(S1 EC2).\nThey participated in the final round at CET, representing MBCET, and secured 3rd prize in the\nAll Kerala IEEE Day PES Quiz 2024\n.\nieee pes\nThe IEEE Power and Energy Society (PES), in collaboration with the Space Club at Mar Baselios College of Engineering and Technology (MBCET), organized an exciting poster and painting competition titled\n“COSMOS CANVAS”\ncentered around the theme “Space” as part of the college’s Space Week celebrations. First Prize was awarded to\nMs. Diya Dileep\nfrom S3EC 2 and second prize to\nAneeta Sibi\nfrom S3EL. Student Coordinators were\nSavya Unnikrishnan\nand\nVinayak V Nair\n. Faculty Coordinators : Ms. Sandhya P and Mr. Anil J, Asst. Professor/s, EED\nFIRST PRIZE (Ms. Diya Dileep S3EC 2)\nSECOND PRIZE (Ms. ANEETA SIBI, S3 EL)\nA group of students from EED 2023 pass out batch, displayed their project work “Multi-Purpose RFID Tag (M-TAG)” in Navajeevan Bethany Vidyala, Nalanchira on 30 December 2023. The Group Members are Arya A, Greeshma D G, Jeenu L Jose, Rohith U Nair and Laby Mathew Ninan.\nThe same project was displayed on 2 November 2023 at the KTU exhibition stall for Keraleeyam 2023, organized by the Government of Kerala, to present Kerala’s progress, achievements, and cultural heritage to the world.\n2022-23\nIllumina organized a Project Expo – an exhibition of final year projects on\n29 May 2023\nin the Faraday Hall. Mr. Midhun M S, (Alumnus, 2016-2020 EEE batch), Engineer, Veli Research Centre, ISRO and Mr. Vishnu M. Nair, (Alumnus, 2017-2021 EEE batch), Data Scientist, Siemens were the guests for the day. Two best projects were awarded a cash prize of Rs. 3000/-.\nBest Project Awards:\nS8 EE1\n:\nProject:\nBorewell Rescue System\nMembers: Anand Vijay, Abhishek R Krishnan, Sangeeth PB, Rohit VK\nGuides: Dr. Dishore SV, Ms. Revathy KP\nProject:\nImplementation of Multipurpose Fastag\nMembers: Rohith U Nair, Laby Mathew Ninan, Greeshma DG, Jeenu L Jose, Arya A\nGuide: Dr. Sheryl Arulini, Ms. Neetha R Chandran\nS8 EE2\n:\nProject:\nVertical Axis Wind Turbine using Axial Flux Generator\nMembers: Joana J John, Riya Rajesh, Sujin Reji, Sanjay J S\nGuides: Mr. Anil J, Dr. Dishore SV.\nProject:\nIndustrial automation and implementation of coconut breaking system\nMembers: Vaishnav Dev B, Tomin J S, Vivin John Thomas, Mayoorika Venu\nGuide: Dr. Nisha G K, Ms. Sandhya P\n2021-22\nAn exhibition of the projects by the final year students of the Department of Electrical and Electronics Engineering was conducted at Faraday Hall on\n2 June, 2022\n. 18 projects were exhibited. Pisces Bot, Telecommunication based patient monitoring Rover, Early disease detection by Nail Image processing, ROV to aid fish farmers in agriculture, Public bus transport information system for Blind people, Fire extinguisher drone, were some of the projects. The best project from each class were awarded.\nBest project awards:\nS8EE1: Pisces Bot\nTeam members: Abhijith A, Ananth A J, Gautham B R, Rahul S Nair.\nGuide: Ms. Sandhya P.\nS8EE2: Ultrasonic Analyser for the measurement of water content in crude oil\nTeam Members: Amal Krishna, Gowtham Krishna and Gopeekrishnan.\nGuide: Ms. Soumya A. V.\n2018-19\nPROJECT EXHIBITION 2019\nFinal year project exhibition was conducted during April 2019. 24 projects were developed by the students in the department. Students and faculty of all branches visited the exhibition. The project models focused on topics on humanitarian value, social responsibility, advancement in the field of Electrical Engineering etc. and were well appreciated and applauded by the BURSAR, Principal and Vice-Principal.\n2017-18\nDESIGN AND ENGINEERING PROJECT EXHIBITION\nDesign and Engineering project Exhibition of S2EE1 and EE2 classes were conducted on the month of March 2018. Students and faculty of EEE Department visited the exhibition, conducted in the Faraday Hall. The students were divided into groups and they were asked to design and create innovative models made from “RUBBER TYRES”. Various products were there which includes chair, seat and some were based on IoT like musical light, intelligent plant, watering system etc. All the projects were well appreciated and applauded by\nProf. Shajilal A S\n(HOD, EE) and all senior faculties.\nFINAL YEAR PROJECT EXHIBITION 2018\nFinal year project exhibition was conducted on 16 April 2018. Students and faculty of all branches visited the expo, conducted in the Advance Control Systems Lab. The project models focused on topics on humanitarian value, advancement in the field of Electrical Engineering, smart education systems etc and was well appreciated and applauded by the BURSAR, Principal and Vice-Principal\nBest Projects\nThe following student projects of EEE Department were selected as best projects in the year 2017-2018.\nFirst Place\n: SMART CART: Govind S, Gopika G B, Siddarth Srikanth, Teena Jacob, Shilpa Julius.\nSecond Place\n: PASSWORD BASED CIRCUIT BREAKER WITH LINE BREAK DETECTION SYSTEM: Augustine B S, Aswajith R S, Sharath Mohan S L, Sara John, Sreelekshmi R.\nThird Place\n: SAFE GAS TRANSPORTATION SYSTEM: Akshay S P, Arun P Raj, Karthik Mohan Nair, Jongee Chandy\n2016-2017\nFinal year project exhibition was conducted on April 2017. Students and faculty of all branches visited the expo, conducted in the Advance Control Systems Lab. The project models focused on topics on humanitarian value, advancement in the field of Electrical Engineering, smart education systems etc. and was well appreciated and applauded by the BURSAR and Principal\nTECXPO ‘17\nThe following student projects of EEE Department were chosen for TECXPO ’17 held at Amenity Center, MBCET on 3 May 2017.\nSWORD (WOMEN PROTECTION SYSTEM) : Merin Elsa Zachariah, Rakhi J S, Sarreen Sara Solomon, Deepa Thomas, Natasha George\nSMART RYDER : Amaresh Gowrishankar, Jomin Mathew, Apreim Reji\nAUTOMATIC RAILWAY TRACK CRACK DETECTION SYSTEM: Aravind A, Govind R, Navanith S V, Prince Jobi.\nDRIVER’S LICENSE AUTHENTICATION: Bibin Abraham, Jijin Joe, Job George, Jovin John, Kevin Justin\n2015-16\nFinal year project exhibition was conducted on March 2016. Students and faculty of all branches visited the expo, conducted in the Power Electronics Lab. The project models focused on topics on humanitarian value, social responsibility, soldier’s value, smart education systems etc and was well appreciated and applauded by the Bursar and Principal.\nFaculty Achievements\nACCOLADES WON BY STAFF\n2024-25\nICONIC RESEARCHER AWARD\nDr. Dishore S.V,\nAssistant Professor, EED received the prestigious\nIconic Researcher Award\nin Scientific Laurels for his outstanding contributions to research, innovation, and academia.\nRESEARCH GRANT AWARDED UNDER KTU’S REASEARCH SEED MONEY SCHEME\nMs. Vrinda Prasad,\nAssistant Professor, EED has been awarded a grant of ₹90,000 by the KTU Research Section under the Research Seed Money scheme for her project proposal titled “\nDesign and Implementation of a Soft Switching Solid State Transformer for Grid Integration of Renewable Energy”\nin the academic year 2024-25. The project aims to contribute to advancements in renewable energy integration through innovative transformer design.\nPAPER PUBLICATION\nDr. Dishore S. V.,\nAsst. Prof., Dept.of EEE published a Scopus indexed paper entitled\n“SEZE Converter Based V2G and G2V Technologies in a Microgrid using PI Controller”\nin Green Industrial Electronics and Sustainable Technologies (GIEST), IEEE International Conference on 25-26 Oct 2024, indexed on 14 April 2025\nMs. Shyju Susan Mathew\n, Assistant Professor, EED published a paper titled\n“Analysis of Design Considerations for a 6 DoF Mobile Manipulator Based on Manipulability Measure\n” in Journal of Robotics and Control (JRC).\nDr. Sheryl Arulini,\nAssistant Professor, EED published a research paper entitled “\nMulti-purpose RFID TAG-M TAG\n” in AIP Proceedings.\n2023-24\nPAPER PUBLICATION\nDr.Dishore S V, Assistant Professor, EED published a Scopus indexed journal entitled “AI-Enhanced IoT Tool for Emotional and Social Development in Children with Autism.”in International Journal of High Speed Electronics and Systems, World Scientific Publishing\nPhD AWARDED\nMr. Anil J,\nAssistant Professor, Electrical and Electronics Engineering Department has been awarded the Doctor of Philosophy by Noorul Islam centre for Higher Education for his thesis entitled\n“A Novel Approach to Expression Independent Face Recognition Problem”\non 22\nnd\nNovember 2024.\nDr. Anil J\nreceived Degree certificate from Dr. A.P. Majeed Khan, Chancellor, NICHE on the 32\nnd\nConvocation day.\nPAPER PRESENTATION\nDr. Dishore S V\n, Assistant Professor, EED presented a paper titled “\nSEZE Converter based V2G and G2V Technology in a Microgrid using PI Controller\n” in the 2024 IEEE 1\nst\nInternational Conference on Green Industrial Electronics and Sustainable Technologies (\nGIEST-2024\n) organized by the Kolkata Section- Silchar Subsection IES Chapter in collaboration with the Department of Electrical Engineering, NIT Manipur and IEEE Student Branch, NIT, Manipur, held on 25 and 26 October 2024.\nRESEARCH SUPERVISOR\nDr. Sheryl Arulini. A\n, Assistant Professor, EED has been appointed as\nResearch Supervisor\nfor supervising and controlling the research work of Research Scholars, by the A P J Abdul Kalam Technological University.\nSPECIAL APPRECIATION AWARD\nDr. Soumya A. V.,\nAssistant Professor EED, has been honored with the\nISTE Kerala Section Award 2024 for Faculty Advisor: Special Appreciation\nin the Engineering College Stream. This award recognizes her outstanding dedication to student mentorship and academic excellence.\nPAPER PUBLICATION\nMs. Shyju Susan Mathew\n, Assistant Professor, EED published a paper entitled “\nModeling and Control of Mobile Manipulator System Using Simscape-Multi body Platform\n” in the Journal of Electrical Systems, (Scopus) 20-3 (2024): 6025-6035.\nMr. Anil J,\nAssistant Professor, EED published a paper titled\n“Literature Survey on Face Recognition of Occluded Faces\n” in the Proceedings of the International Conference on Circuit Power and Computing Technologies (ICCPCT)2024. (Scopus Indexed)\nMs. C Sojy Rajan,\nAssistant Professor, EED published a paper titled\n“Voltage Profile Improvement Techniques of Interconnected Microgrids\n” in Journal of Electrical Systems indexed by Scopus and Thomson Reuters.\nPAPER PRESENTATIONS\nMATLAB FOR ENGINEERS:\nAN EXPERIENTIAL LEARNING\n, a national  event organized by Department of Electrical & Electronics Engineering, Manipal  Institute of Technology in association with Mathworks selected four of our faculty members ,\nMs Sheenu P, Ms Shyju Susan Mathew, Ms Revathy K P\nand\nMs Neetha Chandran\n(Assistant Professor/s, EED) as best participants. They are among 25 best participants selected from the 230 online participants. The course was conducted in online mode from 18\nth\nJune to 20\nth\nJuly 2024.\nPOST Graduate programme (faculty)\nMr. Midhun G\n, Assistant Professor, EED, completed Post Graduate Program in association with Great Lakes Institute of learning on Topic “\nElectric Vehicle Technology”\nwith Excellent Grade.\nSCI JOURNAL PUBLICATION\nDr. Dishore S V\n, Assistant Professor, EED published a SCI journal entitled “\nA modular multiport Landsman converter-driven hybrid EV charging station with adaptive power management system.\n” in Computers and Electrical Engineering 118 (2024): 109422. Q1 journal impact factor:4\nPATENTS RECEIVED\nDr. Dishore S V\n, Assistant Professor, EED received design patent for\n“Banana Bunch Extraction Tool”\n. This is his 3\nrd\npatent.\nPAPER PUBLICATION\nMs. Revathy K P\n, Assistant Professor, EED published a paper entitled “\nPowering the Future: A Comprehensive Review on DC-DC Converters and Their Vital Role in Electric Vehicle Technology”\nin Springer Information Systems Engineering and Management as Proceedings of 4th International Conference on Artificial Intelligence and Smart Energy ICAIS 2024.\nDr. Nisha G K\n., Professor, EED,\nMs. Sandhya P.\nand\nMs. Surasmi N L\n,\nDr. Dishore S V\n, Assistant Professors, EED, presented papers in 2024 International Conference on E-Mobility, Power Control and Smart Systems (ICEMPS 2024) held at Mar Baselios College of Engineering and Technology from 18th to 20th April 2024.\nMr. Chinmay Krishna S and\nDr. Nisha G K\n, “Review of Autonomous Mobile Robots”\nMr. Praveen O and\nDr. Nisha G K\n,” Closed Loop Control of Three Level NPC Induction Motor Drive for Water Pumping Application”\nSandhya P, Dr. Nisha G K\nand Ms. Aiswarya S S, “Charging Up the Future: Capacitive and Inductive Wireless Power Transfer”\nVaishnav Dev B, Ms. Mayoorika Venu, Mr. Vivin John Thomas, Mr. Tomin J S,\nMs. Sandhya P\nand\nDr. Nisha G K\n, “Industrial Automation and Implementation of Coconut Breaking System”.\nSurasmi N L\n; Anjana S; Titto S Babu; Rahul R S; Vignesh S S, “Closed-loop Speed Control of BLDC Motor Using Flyback Converter for Electric Vehicle Applications”.\nSurasmi N L; Shiny G; Vinod B R, “Grid Integrated Hybrid Renewable Energy System for Power Quality Improvement Using Open End Winding Transformer”.\nSamat Iderus; Geno Peter; Vijayakumar Arun;\nDishore Shunmugham Vanaja\n; A.R.Gayathri; Albert Alexander Stonier, “Ferranti Effect on a pi model of an Overhead Transmission Line – A detailed Analysis”.\nSamat Iderus; Geno Peter; Vijayakumar Arun;\nDishore Shunmugham Vanaja\n; A.R.Gayathri; Albert Alexander Stonier, “Ferranti Effect on a T- Section model of an Overhead Transmission Line – A detailed Analysis “.\nSamat Iderus; Geno Peter; Vijayakumar Arun;\nDishore Shunmugham Vanaja\n; K.Ezhil Vignesh; Albert Alexander Stonier, “Performance Evolution of Switched Capacitor Boost Nine Level Inverter with Variable Frequency APOD Technique”.\nMs. Revathy K P\n, Assistant Professor, Dept. of EEE presented a paper titled “Powering the Future: A Comprehensive Review on DC-DC Converters and their Vital Role in Electric Vehicle Technology” in the 4th International Conference on Artificial Intelligence and Smart Energy (ICAIS 2024) 22 – 23 March (Springer), 2024, organized by JCT College of Engineering and Technology, Coimbatore.\nPhD AWARDED\nMs. Elizabeth Varghese\n, Associate Professor and Head of the Department of Electrical and Electronics Engineering has been awarded the Doctor of Philosophy by the University of Kerala for her thesis entitled “\nDesign of Fractional Order Controllers for Launch Vehicles\n” 28 November 2023.\nPh.D DEFENSE\nMs. Soumya A V\n, Assistant Professor, Department of Electrical and Electronics Engineering has successfully defended her Ph.D. thesis entitled “\nArtificial Intelligence based Signal Processing Approach for Islanding Detection in Microgrid\n” at Vellore Institute of Technology, Vellore, on 27 November 2023.\nFACULTY INVITED AS ACADEMIC COMMITTEE MEMBER TO AN INTERNATIONAL CONFERENCE\nDr. Sheryl Arulini\n, Assistant Professor, EED attended the IEEE sponsored 3\nrd\nInternational Conference on New Energy and Power Engineering as an Academic Committee Member held at Huzhou, China from 24 to 26 November 2023.\nPUBLICATIONS\nPraveen Raj R S,\nJoseph Sarojini Savier, “A Flexible Islanding Identification Technique for PV based Grid-tied Systems”,\nInternational Journal of Power Electronics and Drive Systems\n(IJPEDS), Vol. 15, No. 1, March 2024, pp. 180~191 ISSN: 2088-8694, DOI: 10.11591/ijpeds.v15.i1.pp180-191.\nDr. Dishore S. V.\n, Assistant Professor, EED published a Scopus Indexed book chapter entitled “Regulated and Deregulated Control of a Pseudo Pancreas Using an Inflated Ant Colony Optimization Technique” in the Springer Book series,\nLecture Notes in Electrical Engineering\n(LNEE, volume 1117), Electronic ISSN 1876-1119.\nAnil J\n, Assistant Professor, EED published a paper entitled “A novel fast hybrid face recognition approach using convolutional Kernel extreme learning machine with HOG feature extractor”, in the Scopus indexed Elsevier Journal, Measurement: Sensors, Volume 30, 2023, 100907, ISSN 2665-9174,\nhttps://doi.org/10.1016/j.measen.2023.100907\n.\nDishore S V\n, Assistant Professor, EED published a paper entitled “Battery Cell Balancing of V2G-Equipped Microgrid in the Presence of Energy Storage Aggregator” in the International Transactions on Electrical Energy Systems (Wiley Publication).\nDr. Dishore S V\n, Assistant Professor, EED published a paper titled “Design of a modular converter in hybrid EV charging station with efficient energy management system” in Electrical Engineering (Springer Publication). DOI:10.1007/s00202-023-01822-6 (SCI indexed, Impact Factor 1.8).\nSESSION CHAIR\nMr. Ayush Vijayan\n, Assistant Professor, EED served as the Session chair for paper presentation conducted as part of the event named “Symposium”, organized by the Department of Electronics and Communication Engineering, Heera College of Engineering and Technology on 10 November 2023.\nRESOURCE PERSON\nDr. Ushakumari S\n., Dean Corporate Relations and Professor, EED, MBCET was invited as resource person to deliver expert lecture in ‘Need for Value Education’ and ‘Holistic Transformation of Human being’, on 8 and 9 January 2024, as part of the Short Term Training Programme on “Recent Research Trends in Green Energy Technologies”, organized by Centre of Sustainable Development in collaboration with the Department of Mechanical Engineering and Department of Civil Engineering, College of Engineering Trivandrum.\nIn connection with the visiting faculty programme in the Dept. of Electrical Engineering, College of Engineering Trivandrum,\nDr. Elizabeth Varghese\n, Associate Professor and HoD, EED delivered lectures on “Modelling and Control of Fractional Order Systems” on 13, 18 and 19 December 2023.\nDr. S. Ushakumari\n, Dean, Corporate Relations and Professor, EED was invited as the Resource person for the Student induction program on Universal Human Values for Mechanical Engineering on 19, 21 and 31 October 2023 and for Electrical Engineering on 14 and 21 October 2023 at College of Engineering Trivandrum.\nMr. Aswin R B\n, Assistant Professor, EED, MBCET was invited as the Resource person for the EMC Online Certification Programme on “Recent Trends in Sustainable Energy Management Practices”, organised by the Department of Electrical and Electronics Engineering, MBCET in association with Energy Management Centre, Kerala. He handled a session on the topic “Electrical design aspects in Domestic installations” on 30 October 2023.\nDr. Dishore S V\n, Assistant Professor, EED, handled an online session on “From Basics to Applications: Navigating the world of Electronic devices” for the first session of the 30 hrs Online certification programme on Simulation of Power Electronic Circuits from Basics to Applications in MATLAB/Simulink, Circuitrix, on 16 October 2023, organized by the Department of Electrical and Electronics Engineering in association with CDAC.\nCOURSE COMPLETED\nDr. Dishore S. V.\n, Assistant Professor, EED completed a course in ‘Simulation of a Single-Phase Half Bridge and Full Bridge Inverter using MATLAB’ and got certified by Infosys Springboard.\nDr. Dishore S V\n, Assistant Professor, EED, successfully completed a 30 hrs Course on “Compendium of Electric Vehicle Engineering’’ organised by the Department of EEE & Centre for Continuing Education, Sri Ramakrishna Engineering College, Coimbatore, Tamilnadu.\nFACULTY AWARD\nDr. Nisha G K,\nProfessor & HOD, EED was awarded the Certificate of Excellence in reviewing in recognition of her outstanding contribution to the quality of the Journal of Engineering Research and Reports, indexed in Ebsco, Proquest, Index Copernicus and Google Scholar.\nDr. Nisha G K\nreceived the Distinguished Faculty award from Venus International Foundation at a function in Chennai on 14 July 2023.\n2022-23\nSELECTION FOR PhD\nVrinda Prasad\n, Assistant Professor, EED got selected for PhD programme of the Centre for Research in Nanotechnology and Science (CRNTS) at IIT Bombay.\nRevathy K P\n, Assistant Professor, EED secured admission for PhD in the area of Power Electronics at Kalasalingam Academy of Research and Education, Tamil Nadu.\nIN-HOUSE PROJECTS COMPLETED\nAbhishek R Krishnan, Anand Vijay, Rohit V K and Sangeeth P B, S8 students of EED, completed their final year project titled “Design and development of a Modular Rescue tool for saving the child from open bore well”. The project was guided by\nDr. Dishore S V\n, Assistant Professor, EED.\nJithin Joy, Krishna Sankar, Soorya Rethnakaran, K M Abhijith and Amy Rachel Robby, S8 students of EED, completed their final year project titled “Landslide detection and warning system”. The project was guided by\nMs. Surasmi N L\n, Assistant Professor, EED.\nPARTICIPATION IN ANERT EXPO\nDr. Dishore S V, Mr. Aswin R B and Mr. Anand B H\nof EED attended the RE and EV expo conducted by ANERT. The retrofitted EV autorickshaw developed by a team of faculty members from EED consisting of Dr. S. Ushakumari, Dr. Nisha G K, Dr. Dishore S V, Mr. Aswin R B and Mr. Anand B H of EED in the EV laboratory was displayed in this expo during 30/05/2023 to 01/06/2023.\nPATENT RECEIVED\nDr. Dishore S V\n, Assistant Professor, EED has successfully obtained a design patent on “Modular Coconut Scrapper”. The design patent, bearing the Design Number: 374689-001, has been registered under the Intellectual Property Rights (IPR) system, recognizing the uniqueness and originality of designed tool.\nPAPER PRESENTATION\nMs. Surasmi N. L\n., Assistant Professor, EED presented two papers titled “Hybrid Multilevel Inverter Control for Harmonic Mitigation” and “Grid-integrated Solar Photovoltaic Converter Control for Power Quality Enhancement”, in IEEE International Conference on Control, Communication and Computing (ICCC 2023) organized by College of Engineering Trivandrum from 19 to 21 May 2023.\nBEST PAPER AWARD\nMs. Surasmi N. L\n., Assistant Professor, EED received the best paper award for the paper titled “Hybrid Multilevel Inverter Control for Harmonic Mitigation” in IEEE International Conference on Control, Communication and Computing (ICCC 2023) organized by College of Engineering Trivandrum from 19 to 21 May 2023.\nVrinda S S, Shilpa Nair U S, Sai Krishnan A K, Aadhil Ansar and Sibin George, S8 students of EED bagged the Best paper award worth ₹10k, for their presentation on “Smart Ergonomic Office Chair” in the NABIOCON ’23 (National Conference on Biomedical Instrumentation and Signal Processing, 2023) organized by the Department of Biomedical Engineering, TKM Institute of Technology, in association with Telemedicine Society of India, SCTIMST-TIMed, EMBS Kerala Chapter and IEEE EMBS TKM IT during 26 and 27 June 2023. The conference was based on the theme “Revolutionizing Healthcare: Exploring Modern Medical Technology”. The project was guided by\nMs. Soumya A V and Dr. Shalu George K\n.\nEXPERT TALK\nDr. Nisha G K\n, Professor and HOD, EED delivered a technical talk on the topic “Plug in Electric Vehicle and Grid Integration” on 10 May 2023 for the National Conference at the Visvesvaraya Bhavan, Trivandrum, conducted by The Institution of Engineers (India) Kerala State Centre on 10th and 11th May 2023.\nSESSION CHAIR\nDr. Nisha G K\n, Professor and HOD, EED chair a session on 6 May 2023 in the 2\nnd\nInternational Conference on Modern Trends in Engineering Technology and Management (ICMEM 2023) at Sree Narayana Institute of Technology Adoor, which was held during 4 to 6 May 2023.\nPublications\nDr. Dishore S V\n, Assistant Professor, EED published an article entitled “System Design, analysis and experimental investigations on Linear Switched Reluctance Motor with double mover configuration” in the Journal of Vibration and Control (SAGE Publication) with an impact factor 2.63 (Q1-journal).\nJasmine Gnanamalar, R. Bhavani,\nSheryl Arulini. A,\nSai Veerraju. M, “CNN-SVM Based Fault Detection, Classification and Location of Multi-terminal VSC-HVDC System”,\nJournal of Electrical Engineering and Technology\n, Springer, 2023 (SCI indexed).\nRaj, Devesh, Thiyagarajan Venkatraman, Muthuselvan Balasubramanian, and\nDishore Shunmugham Vanaja\n, “Design and Development of a B-Type Inverter for Harmonic Mitigation in a Grid Integrated System Using Whale Optimization Algorithm”\nElectric Power Components and Systems\n(2022),\nTaylor and Francis Group\n, pp: 1-20. (SCIE Journal with IF 1.27)\nConference\nDr. Dishore S V\n, Assistant Professor, EED attended and\npresented a paper\ntitled “Regulated and Deregulated Control of a Pseudo Pancreas using an Inflated Ant Colony Optimization technique” at the\nInternational Conference on Sustainable Technology and Advanced Computing in Electrical Engineering\nheld on 19 and 20 January 2023, hosted by the Department of Electrical Engineering, Sardar Vallabhbhai National Institute of Technology, Surat, Gujarat.\nBook Published\nDr. Dishore S V\n, Assistant Professor, EED published a textbook “Electric Vehicle Architecture” with ISBN 978-81-961898-6-0, published by Lakshmi Publications.\nDr. Dishore S V\npublished a textbook “Learning Logic Circuits and Logic Design with VHDL (2023)” in association with Dr. A Pandian, 978-93-5673-100-4, Book Published by Evincepub Publishing.\nIET Future Tech Congress\nMs. Soumya A V\n, Assistant Professor, EED along with 15 volunteers attended the IET Future Tech Congress on 22 and 23 November 2022 at The Lalit, Bangalore. The 2-day conference, attended by over 500 attendees (in-person and virtual), 70+ speakers, 13 partners, 10 supporting associations and 15 exhibitors, featured 40+ engaging and stimulating sessions.\nPhD ADMISSION\nMr. Rejish Babu F R\n, Assistant Professor, EED, got selected for PhD admission under APJ Abdul Kalam Kerala Technological University and joined as Research Scholar in MBCET under the guidance of Dr. Shalu George K, Associate Professor, EED on 15/11/2022.\nPATENT RECEIVED\nDr. Ushakumari S. received Patent on High Power Geared Electric Vehicle.\nIET CONFERENCE AT UNITED KINGDOM\nMs. Soumya A V\n, Assistant Professor, EED attended the IET Young Professionals Summit 2022 at London recently. Her travel was fully supported by the Institution of Engineering and Technology (IET), inclusive of travel and stay at London. This Summit was a global offline meet up event sponsored by the IET (https://www.theiet.org/) and was held at their Headquarters in London. The main programme was on 12 November and the objective was to facilitate the Conference of more than 130 selected young professionals from across the world, who are volunteers of the IET. Ms. Soumya could meet a number of leading engineering professionals during the summit. IET MBCET On Campus Chapter is attached with the Kanyakumari Local Network of IET and has been very vibrant in the professional activities.\n2021-22\nMs. Manju Ann Mathews\n, Assistant Professor, EED was invited as a special guest for the IPR and the Engineering Profession Guest Seminar series, hosted by the Centre for Intellectual Property Rights, Mar Gregorios College of Law on 13 June 2022. She also delivered a session on “Engineering Profession and IPR” for the same.\nSandhya P\nsecured Best paper award for her paper entitled “Review of Battery Charging Methods for Electric Vehicle” in the Power and Energy Systems track in the International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022 (IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nAnu Gopinath\nsecured Best paper award for her paper entitled “Gain Scheduled LQR Control of a Two Wheeled Mobile Robot with Heavy Payloads” in the Instrumentation and Control track in the International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022 (IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram and IEEE Kerala Section from March 10-12, 2022.\nS. Usha Kumari\n, Professor, EED was invited as an Advisor in the P. T. Board for assessing candidates who qualified in the Engineering Services Examinations 2021, from 28 February 2022 to 04 March 2022, at UPSC office, New Delhi.\nS. Usha Kumari\n, Professor, EED received a memento from the Y’s Men’s club of Kothamangalam, in recognition of her dedicated services towards Universal Human Values.\nMs. Manju Sreekumar\nand\nMs. Jomole Joseph P.\n, Assistant Professors, EED, secured admission for Ph.D at Amrita Vishwa Vidyapeetham, Amritapuri Campus, Kollam.\nAswin R B\n, Assistant Professor, EED, completed the Certificate course on Home Energy Assessment and qualified the examination of Category B Home Energy Assessor conducted by Energy Management Centre-Kerala. His name has been entered as HEA No. HEAB47 in the empanelled list of Home Energy Assessors. He is entitled to practice Home Energy Assessment in the state of Kerala.\nMs. Sandhya P\n, Assistant Professor, EED, secured admission for Ph.D at Mar Baselios College of Engineering and Technology, in the area of Electric Vehicles, under the guidance of Dr. Nisha G. K.\n2020-21\nMs. A. N. Archana\nwas ranked third for actively participating in the community at 12th IEEE Power and Energy Conference at Illinois (PECI 2021) organized by the IEEE PES/PELS/IAS Joint Student Chapter at the University of Illinois, Urbana–Champaign, USA on 1-2 April 2021. She also presented a paper entitled “EV Charging Station Allocation in a Distribution System based on Power Quality” in the conference.\nMr. Aswin R. B.\nhas been selected as one of the Evaluators for MHRD’s Toycathon 2021.\nMs. Jomole Joseph\nwon the Best On-Campus Faculty Advisor IET KKLN Award.\n2019-20\nAnu Gopinath, Ms. Ashni Elisa George, Mr. Aswin R. B., Ms. C. Sojy Rajan, and Ms. Shyju Susan Mathew\njoined as part-time Research Scholars in the Department of Electrical and Electronics Engineering, College of Engineering, Trivandrum in July 2019.\nShalu George K.,\nAssistant Professor was awarded the degree of Doctor of Philosophy for her work titled, “On the Characterization and Modelling of Biosignals for the development of an Elbow Assistive Device” from the Department of Electrical Engineering, National Institute of Technology Calicut during July 2019.\nG. K. Nisha\ngot the Ph.D guideship in KTU.\nG. K. Nisha\nwas promoted as\nProfessor\nin the Department.\nElizabeth Varghese\ngot the\nBest paper award\nfor her presentation entitled “Robust Fractional Order\nController for an Expendable Launch Vehicle” in the International Conference on Design, Automation and Control, ICDAC 2020, held on 6 to 8 January 2020 at Vellore Institute of Technology.\nF. R. Rejish Babu\ncleared KTU Ph.D Entrance examination, February 2020.\nShalu George K.\ngot the Ph.D guideship in KTU in March 2020.\n2018-19\nJomole Joseph P\n. received the IET KKLN Outstanding Volunteer Award for 2018 on 9\nth\nDecember 2018 during\nthe 4\nth\nAnnual General Meeting of IET KKLN, for her volunteering services extended to student members of IET for their professional growth.\nArchana A. N. and Ms. Manju Ann Mathews\nregistered for PhD under APJ Abdul Kalam Technological University, under the guidance of Dr. Rajeev T., Assistant Professor, EEE Dept., College of Engineering, Trivandrum.\nAswin R. B.\nhas been elected as the new Staff club President.\nMidhun G.\nparticipated in State Level Mr. Trivandrum 65Kg Body Building Senior Category organized by Trivandrum Body Building Association (TBBA) on Dec 2018.\nMidhun G.\nhas been selected as the new coordinator of MBCET Music Club.\nDr. Nisha G. K.\ngave an invited talk on\nElectric and Hybrid Vehicles\nat Marian Engineering College on 9 October 2018.\nDr. Nisha G K\nhandled a session on the area of Plug-in Hybrid Electric Vehicles and V2G Technology for the Short Term Training Programme (STTP) on “\nDistributed Generation and Smart Grids – DSG’18\n” organized by the Department of EEE, MBCET, from 30th July to 1st August 2018. This programme was sponsored by Innovation and Entrepreneurship Development Centre (IEDC), SEPTECH-MBCET Chapter, Energy Management Centre (EMC), Kerala.\n2017-18\nDr. Nisha G. K.\nreceived\nResearch Excellence Award\nfor her research work titled\n“Torque Capability Improvement of Sensorless FOC Induction Machine in Field Weakening for Propulsion Purpose”\nby the Institute for Exploring Advances in Engineering (IEAE).\nr. Nisha G K\nhandled a session on “SRM Drives and its Controllers” for the Faculty Development Programme (FDP) on “\nSpecial Electric Machines\n” organized by the department of EEE at St. Xavier’s Catholic College of Engineering, Nagercoil on 26 June 2018.\nJomole Joseph\n, YP Vice Chairman of IET KKLN attended as special guest and delivered Felicitation for the International Conference on Energy Efficient Technologies for Sustainability on 5 April, 2018 at St. Xavier’s Catholic College of Engineering, Nagercoil.\nJomole Joseph\n(Asst. Professor, EE), IET-MBCET Faculty Advisor, received the IET-KKLN (Kanyakumari Local Network) Achievement Award for\nIET KKLN Outstanding Woman Engineer 2017\n.\n2016-17\nMs. Manju Sreekumar\nwas awarded a certificate as a team member from Mar Baselios College of Engineering and Technology, Trivandrum for completing all the assigned tasks in “Task Based Training (TBT-2017)”, during 10 January – 5 April 2017 conducted as a part of Teacher Training through the e-Yantra Lab Setup Initiative (eLSI). The team has been awarded Class A in this training.\nDr. Nisha G K\nreceived\nResearch Excellence Award\nfor her research work titled\n“Torque Capability Improvement of Sensorless FOC Induction Machine in Field Weakening for Propulsion Purpose”\nby the Institute for Exploring Advances in Engineering (IEAE).\nJomole Joseph\n, YP Vice Chairman of IET KKLN attended as special guest and delivered Felicitation for the International Conference on Energy Efficient Technologies for Sustainability on 5th April, 2018 at St. Xavier’s Catholic College of Engineering, Nagercoil.\nMs. Jomole Joseph\n(Asst. Professor, EE), IET-MBCET Faculty Advisor, received the IET-KKLN (Kanyakumari Local Network) Achievement Award for\nIET KKLN Outstanding Woman Engineer 2017\n.\nChirag\nClick here\nBoS\nDepartment Advisory Board\nThe People\nFacilities\nNews and Events\nActivities\nConferences\nWorkshops & Seminars\nResearch & Consultancy\nPlacement\nB. Tech PEOs, POs & PSOs\nOpportunities\nCurriculum & Syllabus\nTime Table\nVideo Lectures\nFormer HODs\nDepartment Google Site\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}