{
    "filename": "mbcet.ac.in_departments_civil-engineering_research-consultancy_.html",
    "content": "Research & Consultancy – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nCivil Engineering\n>\nResearch & Consultancy\nResearch & Consultancy\nResearch\nPAPER PUBLICATION\nLekshmi Chandran M., faculty of CE Department, published the work, ‘Effect of Poisson’s Ratio of Developed Coir Latex Composite’ co-authored by Dr. Jaya V and Dr. K Balan  in the Material Circular Economy, July 2024,Volume 6, article number 42.\nhttps://doi.org/10.1007/s42824-024-00125-w\n.\nLekshmi Chandran, M., David Cicin Iraniose., Anna Angel Thankachan., Hima S. V. Kumar., S. S. Vaibhav., Jaya, V., Balan, K., published the work ‘Effect of Latex Content on Morphological Behaviour of Coir-Latex Composite’. Material Circular Economy, July 2024 Volume 6, article number 41.\nhttps://doi.org/10.1007/s42824-024-00126-9\nMs.\nJisa Jose\nfaculty of Civil Engineering Department, published a paper on “Optimizing chlorella vulgaris cultivation in an airlift photobioreactor using  coconut oil mill effluent (COME) for biodiesel production” co authored by Thomas J Kallupurackel, Shibin S P and Vishnu Manirethnam in the\nJournal of the Indian Chemical Society,\nFebruary 2024.\nMs. Lekshmi Chandran, faculty of CE Department, published the work “A Field Study Using Coir–Latex Composites as Wave Barriers for the Attenuation of Ground Vibration” in the\nIndian Geotechnical Journal (\nSCImago indexed), December 2023.\nPAPER PRESENTATION\nDr Alice Thomas, Assistant Professor of the CED, presented two conference papers at Hydro 2024 which was conducted by Central Water and  Power Research Station,  Pune from 18th to 20th December 2024. The paper entitled ” Land Use Land Cover Change Detection Using GIS to Determine the Variation in Hydrological Parameters of Thiruvananthapuram District”  was co authored by  Joel Shajee, Sidharth Babu, Simjesh S G, Snehal Sabu (S8 CE2, 2020-24 batch) and  Dr. Minu Ann Peter. The second paper entitled  ” Early Flood Monitoring and Forecasting using ANN and HEC-RAS in Meenachil River Basin” was co authored by Rahul Rajan, Libin D Santhosh,  Firdous  S, and Anwar Muhammed  A. (S8 CE1, 2020-24 batch)\nAnupama Krishna D, presented the paper titled ‘Behaviour of Reinforced Concrete Frames under Various Load Conditions with Pre-Applied Elevated Temperature’ in the 9th World Congress on Civil, Structural and Environmental Engineering (CSEE 2024), conducted in London, United Kingdom, from April 14-16, 2024 in online mode. Co authors: Dr. Priyadarsini R S (College of Engineering, Trivandrum ) and Dr. Narayana S, Marian Engineering College, Trivandrum.\nSonima A, Govind J B & Jisha S Vpresented a paper titled “Seismic Fragility Assessment of RCC Chimney Using Incremental Dynamic Analysis” in the first international conference on Recent Advances in Infrastructure Development, RAID 2024, held on 12th and 13th February, 2024 at NIT Calicut.\nLekshmi Chandran\nM faculty of CE Department presented a paper on ‘Effect of poisson’s ratio of developed coir latex composite’ co-authored by  Dr. Jaya V and Dr. K Balan, in the International Conference on Sustainable Materials for Engineering Applications, conducted from 1-3 February 2024 at IIT Madras.\nDavid Cicin Iraniose student of S8 CE presented a paper on ‘Effect of latex content on morphological behaviour of coir-latex composite’ co-authored by Anna Angel Thankachan, Hima S V Kumar, Vaibhav S. S and Lekshmi Chandran M, in the International Conference on Sustainable Materials for Engineering Applications, conducted from 1-3 February 2024 at IIT Madras.\nPhD Guideship\nAPJAKTU has approved the PhD guideship request of Dr. Jaya S Pillai and Dr. Alice Thomas of Civil Engineering Department.\nBEST PROJECT AWARDS FROM CE DEPARTMENT 2022-2023\nProject titled “Waste water treatment combined with CO\n2\nbio-fixation and bio-fuelproduction using indigenous micro-algae”. Group members are Devika Jose, Feba Ann Varghese, NavajithSasi, PallaviPremjith of S8 CE1, guided by Dr. Jaya S. Pillai\nProject titled “Electro-coagulation process for hospital waste water treatment”.Group members are Chikku Elsa Thomas, Nandana J., Susan Teji, Vaishnav J. of S8 CE2, guided byDr. Archana J. Satheesh.\nPAPER PRESENTATION\nMs. Lekshmi Chandran M,Liander George, Nauzzin D,Malavika R Nair, Shivani P S, Praveen P S, Ashik K Azad has participated and presented a paper titled  “Forced Gap Behaviour at Unsignalised Intersections : A Case Study” in the I\nst\nVision Zero Summit National road safety conference organized by Maulana Azad National Institute of Technology (MANIT), Bhopal.\nMs. Lekshmi Chandran M. of Civil Engineering Department, presented the paper “Sound absorption property of coir latex composite using impedance tube ” in 8th International conference on Engineering Research  and Innovations , Terna Engineering  College, Nerul, Mumbai  India on 22 September 2023 in Virtual mode.\nStudents of S8CE2 Savinaj V Santhosh, Safa Zohra S, Ardra V M, Varsha H Nayar and Dr. Anupama Krishna D Assistant Professor, Department of Civil Engineering, has participated and presented a paper titled “EFFECTIVE UTILIZATION OF HERBOCRETE AND PARTIAL REPLACEMENT OF CEMENT USING EGG SHELL POWDER” in the 5th International Conference on “Recent Innovations in Science & Technology (RIST 2023)” conducted on 07th & 08th April 2023, organized by Holy Grace Academy of Engineering, Thrissur, India in association with ISET Research, India.\nDr. M. Satyakumar Professor, Department of Civil Engineering, has participated and presented a paper titled “STUDY ON PEDESTRIAN VIOLATION BEHAVIOUR AT INTERSECTIONS” in the 5th International Conference on “Recent Innovations in Science & Technology (RIST 2023)” conducted on 07th & 08th April 2023, organized by Holy Grace Academy of Engineering, Thrissur, India in association with ISET Research, India.\nThe faculty members of the Department of Civil Engineering are undertaking research activities to bring the industry and the academics closer. The Department has been pioneering the research activities with the aid of funds received from various national and state level research institutions and funding agencies. The institution also funds the R&D projects internally for Departments in the form of in-house projects.\nSUSTAINABILITY HACKATHON CHALLENGE\nStudents of S8 CE  (Devika Jose, Feba Ann Varughese, NavajithSasi, PallaviPremjith)  guided by Dr. Jaya S Pillai got an entry to the Final Round of  Hackathon held at  Ahmedabad during 28-29 April, 2023.\nPAPER PUBLICATION\n1.\nMs. Lekshmi Chandran M, Dr Jaya V, Dr. K. Balanpublished a paper titled “Laboratory Study of Vibration Isolation Performance of Needle Felt Coir Latex Composite (NFCLC) Trench Type Wave Barriers” in SSRG International Journal of Civil Engineering (scopus indexed), Volume 10, Issue 7, July 2023 ISSN 2348-8352\n2. Ms. Lekshmi Chandran M, Dr Jaya V, Dr. K. Balanpublished a paper titled “Mitigation of Train-Induced Vibrations with Developed In-Filled Coir Composite Wave Barriers” in International Journal of Scientific & Engineering Research, Volume 14, Issue 7, July-2023ISSN 2229-5518\nExternally Funded Projects\nName of the Faculty\nProject Title\nFunding Agency and Date of Sanctioning\nStatus\nDuration\nJisha S V\nSeismic Performance of Post-Fire Retrofitted Reinforced Concrete Beam-Column Joints\nDST\nOngoing\n3 years\nDr. Jisha S V(PI)\nand\nDr. M. Satyakumar (Co- PI)\nPerformance Evaluation of Ultra-thin White Topping Overlays\nKerala State Council for Science Technology and Environment (KSCSTE),\nAugust 2020\nCompleted\n3 years\nDr. Jisha S. V. and Dr. M. Satyakumar was sanctioned an amount of Rs.3,00,000/- from the Kerala State Council For Science Technology and Environment, Govt. of Kerala, for the project titled ‘Performance Evaluation of Ultra-thin White Topping Overlays’. Duration of the project is two years starting from November 2018.\nDr. Jisha S. V. was sanctioned an amount of Rs. 63,000/- from the CERD, Govt. of Kerala, Research on the topic, ‘Seismic Soil Structure Interaction Response of Structures Subjected to Pounding’. Duration of the project is two years starting from December 2018.\nDr. Neethu Roy was sanctioned an amount of Rs.27,99,500/- for the project titled ‘Influence of Polymer Dosage and Nature of Bitumen on the Microstructural and Rheological Characteristics of Polymer Modified Binders’ from the Science and Engineering Research Board (SERB), DST, Govt. of India. Duration of the project is one year starting from May 2018.\nDr. Jayasree S. and Mr. Akhil Raj S. R. was sanctioned an amount of Rs.4,00,000/- for their project ‘Development of sustainable concrete using black liquor as admixtures’ from the Technology Development Adaptation Programme scheme of the Kerala State Council For Science Technology and Environment, Govt. of Kerala. Duration of the project is one year starting from February 2018.\nMs. P. Muthulakshmi was sanctioned a fund of Rs. 37,000/- for the project “Zero Waste Kitchen – A new method for Kitchen waste management” from CERD, Govt. of Kerala. Duration of the project is six months starting from March 2017.\nMs. Bindu Biju was sanctioned an amount of Rs.1,35,000/- from CERD, Govt. of Kerala, Research on the topic “Flexural Behaviour of RC beams retrofitted with ultra-high performance steel fibre reinforced concrete”. Duration of the project is three years, starting from March 2017.\nDr. Jayasree S. and Ms. Tisny D. B. was sanctioned an amount of Rs.12,05,387/- from Kerala State Council For Science Technology and Environment, Govt. of Kerala, for research work on “Corrosion Resistance of Blended Cement Concrete using Recycled Concrete Aggregates”. Duration of the project is one year starting from 2012.\nInternally Funded Projects\nPrincipal Investigator / Co-PI\nProject Title\nApproved budget\nStatus\nSijo M Saji, Ann George\nAn Experimental study to evaluate the performance of  Open Graded Friction Course Using Hot Mix And Warm Mix Technology\nRs. 96,500\nOngoing\nIn-House Projec\nt\nPrincipal Investigator / Co-PI\nProject Title\nApproved budget\nStatus\nSijo M Saji, Ann George\nAn Experimental study to evaluate the performance of  Open Graded Friction Course Using Hot Mix And Warm Mix Technology\nRs. 96,500\nOngoing\nFINANCIAL ASSISTANCE FOR INNOVATIVE STUDENT PROJECT BY APJAKTU\nThe following student projects were funded by APJAKTU for the academic year 2022-23\nProject by students of S8 CE (AswinAsok, N Thanzeer, Arun Raj A, Nirmal Sabu Isaac ) “Development of Cement Treated Subbase (CTSB) Mix having Partial Replacement of Coarse Aggregates with Construction Demolition Waste for Optimum permeability and strength” Guided by Dr. Neethu Roy\nProject by students of S8 CE (Arpitha R Nair, Asmidh N S, Ganga Gopan, Govind S P ) “Mitigation measures using Soil bioengineering in rainfall induced landslide prone areas” Guided by Dr. Jisha S V\nProject by students of S8 CE (Devika Jose, Feba Ann Varughese, Navajith Sasi, Pallavi Premjith)  “Wastewater treatment combined with CO2 biofixation and biofuel production using indigenous microalgae” guided by Dr Jaya S Pillai\nSponsored Student Projects\nName of the Students\nName of the guide\nProject Title\nDate of Sanctioning\nDuration\n1)      AswinAsok (MBT19CE035)\n2)      NThanzeer (MBT19CE090)\n3)      Arun Raj A (MBT19CE033)\n4)      NirmalSabu Isaac (MBT19CE088)\nDr. Neethu Roy\nDevelopment of Cement\nTreated Subbase (CTSB) Mix\nhaving Partial Replacement of\nCoarse Aggregates with\nConstruction Demolition\nWaste for Optimum permeability and strength\n18-03-2023\n1 Year\n1) Ganga Gopan\n2) Asmidh N S\n3) Arpita R Nair\n4) Govind S P\nDr. Jisha S V\nMitigation measures using Soil\nbioengineering in rainfall\ninduced  landslide prone areas\n18-03-2023\n1 Year\n1) Navajithsasi\n2) Feba Ann Varughese\n3) PallaviPremjith\n4)Devika Jose\nDr. Jaya S Pillai\nWastewater treatment\ncombined with CO2\nbio-fixation and biofuel\nproduction using\nindigenous microalgae\n18-03-2023\n1         Year\nSponsered Student Intership\n1) Aaron Johnson\n2) Adheene M R\n3) Alan A Vincent\n4) Athena S\n5) GovindSuraj Chand\n6) Kiran Sara Abey\n7) MeghanaSunil  Saritha\n8) RithinAlvito Anil\n9) Adithya Devan A\n10) AhammedSahil\n11) Aman K Anwar\n12) Arjun R Prem\n13) Arjun U\n14) Diya S\n15) Niranjana S\nDr. Elizabeth C .Kuruvila and    Dr. Jaya S Pillai\nRejuvenation of Kambiyilkulam Pond, Kollam\nMinistry of  Housing and Urban Affairs, Govt of  Kerala and AICTE, 7\nth\nJune 2022\n1/07/2022 to 5/08/2022\nMs. Parvathy U. was sanctioned an amount of RS. 70,000/- for the in-house project on ‘Mechanical Behaviour of ECC Encased Steel Composite Columns’. Duration of the project is one year starting from November 2018.\nMs. Rintu Johnson and Ms. Anita A. was sanctioned an amount of Rs. 75,000/- for the in-house project on ‘Characterization of Flood Sediments’. Duration of the project is one year starting from November 2018.\nAnn George and Ms. Athira I. C. was sanctioned an amount of Rs. 55,000/- for the in-house project Investigations on Coconut Shell Modified Interlocking Concrete Paver Blocks. (2017-2018). Duration of the project is 16 months, starting from November 2017.\nJisha S. V. was sanctioned an amount of Rs. 10,000/- for the in-house project on Dynamic Response on Buildings Considering the Flexibility of Soil. Duration of the project is 18 months, starting from November 2017.\nMs. Jaya S Pillai was sanctioned an amount of Rs. 90,000/- for the in-house project tilled ‘Decentralized Wastewater Treatment using Subsurface Flow Constructed Wetlands: An Eco-San Approach’. Duration of the project is 16 months, starting from November 2017.\nFaculty Pursuing Research\nMs. Lekshmi Chandran M is pursuing research in the topic “Study to Evaluate Performance of Coir Composites for Ground Vibration Isolation”\nMs. Ann George is pursuing research on the topic “Investigation on the effectiveness of incorporating  geosynthetics  in hybrid permeable pavement system”\nConsultancy\nCONSULTANCY WORKS 2024\nCONSULTANCY WORKS – SOIL INVESTIGATION\nSoil Investigation done at Poojappura Central Jail and Konchiravila U P School as part of the consultancy works of the Department of Civil Engineering for PWD.\nConsultancy – GPS Survey\nGPS Survey along Ashtamudi lake ongoing as part of the consultancy work for PWD.\nConsultancy –\nSoil investigation\nSoil investigation as part of the consultancy work “DPR preparation of Vazhimukku to Kaliyikkavila: Investigation for minor bridges and culvert” is ongoing from 24th January 2024.\nCONSULTANCY WORKS\nPreliminary site investigation was conducted at\nPathanamthitta\non 29/04/2023 and Thiruvananthapuram on 05/05/2023 for soil investigation as part for Sewerage Treatment plant construction for\nKerala Water Authority\nSoil investigation work was done for minor bridge construction at Kottarakkara\nfor PWD Kerala\nand sewerage treatment plant construction at\nKarunagappally, Pathanamthitta,\nand\nNedumangad.\nTitle of the collaborative activity\nName of the collaborating agency\nFaculty-in charge\nDate\nSoil Investigation: Pachaloor\nKWA\nMr. Sreeju Nair S B\nMarch 2023\nSoil Investigation: Madhupalam\nKWA\nDr. Jayasree S\nMarch 2023\nTopographic Survey: Alappuzha (Pallathuruthykizhakkan bypass)\nKIIFB\nMr. Nitin S,\nMr. Govind U P,\nMr. Sreeju Nair S B and Dr. Amal Raj\nNov 2022 and Dec 2022\nSoil Investigation at Pallipadam (Harippad)\nKIIFB\nMr. Nitin S and\nMr. Sreeju NairS B and Mr. Govind U P\nOct 2022 and Nov 2022\nSoil Investigation: Mukkad\nKIIFB\nDr. Jayasree S\nOct 2022 and Nov 2022\nSoil Investigation: Varkala\nKIIFB\nDr. Jayasree S\nNov 2022\nGPS Survey: Adoor Ring Road\nKIIFB\nMr. Nitin S,\nMr. Govind U P,\nMr. Sreeju Nair S B and Dr. Amal Raj\nNov 2022\nSoil Investigation: ChavaraBhavan to Mundakal bridge\nKIIFB\nDr. Jayasree S\nOctober 2022\nGPS Survey: ChavaraBhavan to Mundakal bridge\nKIIFB\nMr. Nitin S,Mr. Govind U P and\nDr. Amal Raj\nOctober 2022\nSoil Investigation: Kochuveli (Library Building)\nPWD\nDr. Jayasree S\nSeptember 2022\nSoil Investigation: Kizhvaipur (School Building)\nPWD\nDr. Jayasree S\nSeptember 2022\nSoil Investigation: Thiruvalla\n( Hospital Building)\nPWD\nDr. Praveen P S\nJuly 2022\nSoil Investigation: Ranni (ITI Building)\nPWD\nMr. Jobin Joy\nJuly 2022\nTechnical committee member of Project Management Team, Rebuild Kerala Initiative\nLSGD\nDr. Neethu Roy\nSince 19/06/2020\nMember of the project advisory group of NATPAC for the project titled “Experimental investigation on Porous Asphalt Mix” by Sri. Jegan Bharat Kumar A., Scientist NATPAC.\nNATPAC\nDr. Neethu Roy\nSince May 2020\nConsultancy Work\nProject Title\nName of Faculty\nFunding Agency\nAmount\n(Rs.)\nDuration\n(Dates)\nTesting of Steel\nDr. Anupama Krishna D\nUrban Scape Properties\n22,500\n23/04/2023\nProposed site for sewage disposal tank, in Pachalloor\nMs. Diana Alice Sugunan\nKWA, Govt. of Kerala\n123472.00\n23/03/2023-25/03/2023\nProposed site for sewage disposal tank, in Madhupalam\nMs. Diana Alice Sugunan\nKWA, Govt. of Kerala\n77355.00\n22/03/2023\nConcrete Paver Block\nDr. Anupama Krishna D\nKallara Grama Panchayath\n1500\n16/03/2023\nTesting of concrete cubes\nDr. Anupama Krishna D\nKallaraGramaPanchayath\n900\n15/03/2023\nConcrete Paver Block\nMs. Sherin Mathew\nKallara Grama Panchayath\n1500\n08/03/2023\nTesting of concrete cubes\nMs. Sherin Mathew\nKilimanoor Grama Panchayath\n900\n01/03/2023\nTesting of concrete cubes\nMs. Sherin Mathew\nFavourite Homes\n4,500\n19/12/2022, 07/01/2023, 10/01/2023, 16/02/2023\nTesting of concrete cubes\nMs. Sherin Mathew\nCreative   Structures\n1,500\n22/11/2022, 18/01/2023\nTesting of concrete cubes\nDr. Anupama Krishna D\nCreation Villas and Apartments\n4,800\n17/11/2022\nNew Building for Govt. VHSS, Keezhvaipur, Pathanamthitta\nMs. Diana Alice Sugunan\nPWD, Govt of Kerala\n116997.00\n23/09/2022-25/09/2022\nLibrary and Reading Room for Kochuveli St. Joseph Library\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\n51,968.00\n21/09/2023-22/09/2022\nGovernment ITI Building, Ranni\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\n64,705.00\n08/07/2022-14/07/2022\nTaluk Head Quarters Hospital Thiruvalla\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\n2,04,723.00\n01/07/2022-07/07/2022\nSchool Building GMHS, Kollakadavu\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\n1,46,045.00\n21/06/2022-28/06/2022\nEducational Complex, DIET, Kottarakara\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\n1,87,359.00\n13/06/2022-17/06/2022\nTaluk Hospital Santhivila, Thiruvananthapuaram\nMs. Jean Molly Simon\nPWD, Govt. of Kerala\n1,34,752.00\n06/04/2022-09/04/2022\nTesting of concrete cubes\nMs. Sherin Mathew\nCreation Villas and Apartments\n10,800\n11/07/2022, 04/08/2022, 08/08/2022,23/08/2022,11/11/2022,1/12/2022,15/12/2022,17/12/2022, 07/01/2023, 13/01/2023, 06/03/2023\nProposed Road at Harippad, Pallipad-Melpadam Stretch\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\nOn Going\nConstruction of Road from Mundackal Palam – Chavara Bhavan – C Block, Alapuzha District\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\nOn Going\nConstruction of new bridge connecting Mukkattukadavu – Fathima Island – Arulappanthuruthu in Chavara LAC Kollam District\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\nOn Going\nProposed Site for Retaining Wall Varkala – Nadayara- Muslim G.H.S\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\nOn Going\nProposed Site for Road in Pathanapuram\nMs. Diana Alice Sugunan\nPWD, Govt. of Kerala\nOn Going\nThe staff members of MBCET engage in various consultancy activities for both Government and Private agencies/organizations. The consultancy activities contribute in improved industrial collaborations, enhancement of practical knowledge and thereby help in achieving the department goals related to Research, Consultancy and Development.\nSTRENGTH OF THE DEPARTMENT\nStructural design of infrastructures\nDesign of HMA mixes\nWater quality testing\nSoil investigation study\nTopographic mapping using GNSS and Total station\nCONSULTANCY WORKS UNDERTAKEN DURING 2021-2022\n1.\nSoil Investigation work for PWD, Regional Investigation & Quality Control Laboratory, Thiruvananthapuram\na. Project 1: State Council for Open and Lifelong Education Kerala,Killipalam\nSoil investigation work for the State Council of Open and Lifelong Education Kerala was conducted under the guidance of Dr. Jayasree, Head of the Department of Civil Engineering from 31\nst\nMarch 2022 to 3\nrd\nApril 2022.\nStaff Members\n: Mr. akhil Raj S R (Assistant Professor), Mr. Sijo M Saji (Assistant Professor), Mr. Edvin Roy (Lab Instructor), Mr.Shijin Kumar (Lab Instructor)\nSoil investigation work at Killipalam\nb. Project 2: Taluk Hospital, Santhivila\nSoil investigation work of Hospital complex construction at Taluk Hospital, Santhivilawas conducted by Department of Civil Engineering, from 6\nth\nto 8\nth\nApril 2022.\nStaff Members\n: Dr. Jayasree S (HoD), Mr. Akhil Raj S R (Assistant Professor), Mr. Jomy Joseph (Assistant Professor), Mr. Vijin V J(Lab Instructor), Mr.Arun J (Lab Instructor)\nSoil investigation work at Taluk Hospital, Santhivila\nc. Project 3: Educational complex at DIET, Kottarakkara\nSoil Investigation work was conducted for Educational complex at DIET, Kottarakkara, Kollam from 13\nth\nJune – 15\nth\nJune 2022.\nStaff Members\n: Dr. Jayasree S (HoD), Mr. Jobin Joy (Assistant Professor), Mr. Shijin Kumar R V (Lab Instructor), Mr. Anand M. C (Lab Instructor)\nSoil investigation work at Educational complex at DIET, Kottarakkara\nd. Project 4: Government Muhammadin High School at Kollakadavu\nDepartment of Civil Engineering conducted a Soil Investigation study of Government Muhammadin High School at Kollakadavu from 21\nst\nto 28\nth\nJune 2022.\nStaff Members\n: Mr. Sijo M Saji (Assistant Professor), Mr. Anand M C (Lab Instructor), Mr. Sarath Kumar S (Lab Instructor)\nSoil investigation work at Government Muhammadin High School at Kollakadavu\ne.\nProject 5: Thiruvalla Hospital\nSoil Investigation study was conducted forThiruvalla Hospital from 1\nst\nJuly to 6\nth\nJuly 2022.\nStaff Members\n: Dr. Praveen P S,(Assistant Professor), Mr. Vijin V J(Lab Instructor)\nSoil investigation work at Thiruvalla Hospital\nf. Project 6: Government ITI Ranni\nSoil investigation study was conducted by Department of Civil Engineering for the construction of Government ITI Ranni from 8\nth\nJuly to 14\nth\nJuly 2022\nStaff\nMembers\n: Mr. JobinJoy(Assistant Professor), Mr. Anand M C( Lab Instructor), Mr. Arun J( Lab Instructor)\nSoil investigation work at Government ITI Ranni\ng. Project 7: Library and Reading room for KochuveliSt.Joseph Library\nSoil investigation study was conducted by department of Civil Engineering for Library andreading room for Kochuveli St. Joseph Library from 20\nth\nto 21\nth\nSeptember 2022.\nStaff Members:\nMs.Diana Alice Sugunan (Assistant Professor), Vijin V J (Lab Instructor) , Shijin Kumar R V (Lab Instructor)\nSoil investigation work at Library and Reading room for Kochuveli St.Joseph Library\nh. Project 8: Government V H S SKeezhvaipur\nSoil investigation study was conducted by department of Civil Engineering for Library andreading room for Government V H S SKeezhvaipur from 23\nrd\nSeptember to 26\nth\nSeptember 2022.\nStaff Members\n: Ms.Diana Alice Sugunan (Assistant Professor), Vijin V J(Lab Staff),Shijin Kumar R V(Lab Staff)\nSoil investigation work at Government V H S S Keezhvaipur\n2.\nSoil lnvestigation Study and Topographic Survey (DGPS) for KIIFB works in Alappuzha District\nDepartment of Civil Engineering conducted a soil investigation studyand topographical survey for the Construction of road from MundackalPalam- ChavaraBhavan- C Block in Alappuzha District from 11\nth\nto 13\nth\nOct 2022.\nStaff Members\n: Dr. Jayasree S (HoD), Shijin Kumar R V(Lab Staff), Edwin Roy (Lab Staff), Sarath Kumar (Lab Staff), Arun(Lab Staff)\nTopographic mapping and Soil investigation study at Alappuzha\nConsultancy works done so far\nThe Department of Civil Engineering with its strong and dedicated faculty group, takes up consultancy activities in the various streams of Civil engineering.  Over the years the Department has been instrumental in taking part in various prestigious projects through which the Department has built a strong rapport with the industry. Some of the major clients and consultancy works taken up by the Department are as follows.\nMaterial Testing\n2020-2021\nTitle\nFunding Agency\nAmount (Rs.)\nTest on concrete specimens\nKerala Police\n5,900\nTest on concrete specimens\nInkell Limited and other agencies\n8,100\nTest on steel specimens\nPublic Works Department and other Agencies\n6,000\nTotal Amount :\n20,000\n2021-2022\nTitle\nFunding Agency\nAmount(Rs.)\nTest on concrete and steel specimens\nInkell Limited\n10,200\nTest on concrete specimens\nCreations Villa’s and Apartments and other Agencies\n13,800\nTest on materials\nFavourite homes and other Agencies\n18,400\nTotal Amount :\n42,400\n2. Architectural and Structural Design of Men’s hostel of MBCET\nUnder the leadership of Prof. P S Abraham, Professor, Department of Civil Engineering,  the Architectural and structural consultancy works for the extension of Mar ApremMens Hostel of MBCET was executed by Dr. S Jayasree(HoD) and Mr. Akhil Raj(Assistant Professor).\n3. Structural Design of Ladies Hostel of MBCET\nThe Team including Mr. Akhil Raj S.R(Assistant Professor) and Mrs. Anita A(Assistant Professor)under the leadership of Dr. S Jayasree (HoD)carried out the Geotechnical investigations and structural design for the extension of the building,Alphonsa Ladies Hostel.\nStudent Projects\nSTUDENT PROJECTS 2023-2024\nFINANCIAL ASSISTANCE FOR STUDENT PROJECTS\nAPJ Abdul Kalam Technological University sanctioned financial assistance for the following student projects on 11.06.2024\nSl No.\nTitle of Project\nName of Students\nName of Supervisor\nAmount Sanctioned (Rs)\n1.\nSolar Still Desalination Systems for the\nDecentralized Treatment of Saline Water\nAlan A. vincent\nS. S. Anfas Mohammed\nGouri R.\nVaidehi Shajil\nDr. Jaya S. Pillai\n35000\n2.\nBehaviour and Performance of Concrete Column\nReinforced with Glass Fiber Reinforced Polymer\n(GFRP) Bars\nAaron Johnson\nAbhinav M. P.\nAmrita Sreeja\nBhadra Nair S.\nDr. Jisha S. V.\n50000\n“AAKRITI 2024”\nDepartment of Civil Engineering conducted the Project expo “Aakriti 2024” on 22/5/2024. The expo which showcased the innovative projects developed by the final year students was inaugurated by the Principal Dr. Abraham T Mathew. Dr. S. Viswanatha Rao, Vice Principal & Dean (Academic Affairs – UG), Dr. K  Muraleedharan Nair, Professor & Dean (Administration), and many other faculties and students from different departments came and interacted with the project teams. Er. Sreekumaran Nair, Former Chief engineer, Kerala water Authority and Dr. Gicy M Kovoor, Dean, Prof. (Retd), MIT, Karnataka and were the Guests of honour and evaluated the teams. Faculties Dr Jaya S Pillai and Ms. Jean molly Simon coordinated the event.\nSTUDENT PROJECTS 2022-2023\nAAKRITI ‘23\nDepartment of Civil Engineering conducted the Project expo Aakriti ‘23 on 22/5/2023. The expo was a showcasing of final year student projects. Many faculty and students from different departments came and interacted with the project teams.\nHanding over of 3D prototype of the Anakkampoyil-Kalladi-Meppadi Tunnel Road to Government of Kerala\nDepartment of Civil Engineering of MBCET has prepared the 3D prototype of the Anakkampoyil-Kalladi-Meppadi Tunnel Road under the guidance of the Officials from Konkan Railway Corporation Limited.  The model has handed over to the Konkan Railway Corporation on 22/05/2023 at 3 PM in a function  held at MBCET campus, in the presence of Sri Linto Joseph MLA Thiruvambady, Kozhikode, Sri Kadakampally Surendran MLA, Secretary Kerala PWD, Chief Engineer, Kerala PWD and other dignitaries.\nThe following student projects were funded by APJAKTU for the academic year 2022-23\nProject by students of S8 CE (Aswin Asok, N Thanzeer, Arun Raj A, Nirmal Sabu Isaac) “Development of Cement Treated Subbase (CTSB) Mix having Partial Replacement of Coarse Aggregates with Construction Demolition Waste for Optimum permeability and strength” Guided by Dr. Neethu Roy.\nProject by students of S8 CE (Arpitha R Nair, Asmidh N S, Ganga Gopan, Govind S P ) “Mitigation measures using Soil bioengineering in rainfall induced landslide prone areas” Guided by Dr. Jisha S V\nProject by students of S8 C.E (Devika Jose, Feba Ann Varughese, Navajith Sasi, Pallavi Premjith)  “Wastewater treatment combined with CO2 biofixation and biofuel production using indigenous microalgae” guided by Dr Jaya S Pillai.\nVision\nTo be a Centre of Excellence in Civil Engineering education with a global perspective, creating ethically strong engineers for the service of society.\nMission\nTo provide Engineering Education which can create exemplary professional Civil Engineers of high ethics with strong conceptual foundation coupled with practical insight, to serve the industry and community.\nBoS\nThe People\nDAB\nFacilities\nNews & Events\nAchievements\nActivities\nFaculty Activities\nConferences\nResearch & Consultancy\nB. Tech PEOs, POs & PSOs\nPlacement\nCurriculum & Syllabus\nTime Table\nFormer HoDs"
}