{
    "filename": "mbcet.ac.in_faculty_ms-remya-annie-eapen_.html",
    "content": "Ms. Remya Annie Eapen – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nMs. Remya Annie Eapen\nEmployee Code / ID No.\n10413032\nQualifications\nM.E, Pursuing Ph.D\nOrcid ID\nhttps://orcid.org/0000-0002-7843-9377\nIndustry / R & D Experience\n–\nEmail ID\n[email protected]\nAlternate E-mail ID\nMobile No (Optional) / Intercom Extension No.\nIntercom Extension Number :211\nAreas of Interest / Current Research\nWireless Sensor Networks, IoT\nResearch, Consultancy, Publication\n1. Krishnendu Lalaji, Remya Annie Eapen, “Priority Assignment Algorithms for Maximum Protection Ratio in Shared Mesh Protection”, 2021 International Conference on Computer Communication and Informatics (ICCCI), January 2021. 2. Amitha Khan Irshad, Arathy Krishnan, Avinash A S, Siddharth Sanjay, Remya Annie Eapen, Lani Rachel Mathew, K. Gopakumar, “Speech Assist” , International Research Journal of Engineering and Technology(IRJET),Vol 7, Issue 7,June 2020,pp 4273-4275.\n3. Alvin Moses and Remya Annie Eapen, “Maximizing Energy Efficiency in Mobile Energy Harvesting\nWireless Sensor Networks using Particle Swarm Optimization”, IOSR Journal of Electronics and Communication Engineering (IOSR – JECE), Volume 14, Issue 3, Series II, pp. 49-55, May-June 2019.\n4. Anand J. Ganesh, Bincy B. Varghese, Malavika V. V., Pooja Pratap Hasabe, Remya Annie Eapen, “Voice Controlled Reclining Wheelchair”, International Research Journal of Engineering and Technology (IRJET) Volume: 06 Issue: 06, June 2019.\n5. Arathy S. lal, Remya Annie Eapen, “A Study on Topology Control in Wireless Sensor Network”, International Journal of Research in Advent Technology, Vol.2, No.8, August 2014,pp. 36-38, Apr 2014, E-ISSN: 2321-9637.\n6. Arathy S. lal, Remya Annie Eapen, ” A review of mobile agents in wireless sensor network”, Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, vol. 3, issue 7, pp. 10842–10845, July 2014.\n7. Abhaya D S, Remya Annie Eapen, “Energy efficient transmission in random clustered wireless sensor networks using cooperative MISO”, International Journal of Engineering and Advanced Technology (IJEAT), ISSN: 2249 – 8958, Volume-4 Issue-6, August 2015.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nAcademic / Professional Outreach Activities\nMembership in Professional bodies/ organizations\nISTE life member\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\n1. Secured 1% topper and received Silver with Elite Certificate for the NPTEL online course on “Python for Data Science” in 2019. 2. Received Gold medal with Elite Certificate for the NPTEL online course on “Joy of computing using Python” in 2018. 3. Presented the paper entitled “Improvement in network lifetime using game theory in wireless sensor networks” in the fifth National conference on Signals,Systems and Security NCSSS-2012,organised by Department of Electronics and Communication Engineering, Bannari Amman Institute of Technology and selected as the best paper.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}