{
    "filename": "mbcet.ac.in_departments_electrical-electronics-engineering_facilities_.html",
    "content": "Facilities – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nElectrical and Electronics Engineering\n>\nFacilities\nFacilities\nDepartment Labs and Workshops\nThe budding Engineers of our Department experience practical realization of their theoretical concepts by acquiring practical experience in the following Workshops and Laboratories of the Department.\nElectric Vehicle Lab\nElectronic Devices and Circuits Lab\nCircuits and Measurements Lab\nDigital Electronics Lab\nElectrical Machines Lab\nElectrical Workshop\nMicrocontroller and Microcontrollers Lab\nPower System Lab\nPower Electronics Lab\nPG Drives Lab\nProject Lab\nSoftware Lab I\nControl System Lab\nSoftware Lab II\nElectric Vehicle Research Lab\nRoom no:  K 01\nFaculty-in-charge: Mr. Aswin R B\nStaff-in-charge: Mr. Anand B H\n_______________________\nLab Description\nThe Department is paving the path ahead for the students by setting up an EV Lab and two Electric Vehicle (EV) Charging Stations in the MBCET campus premises. Vydyuthi Energy Services in association with Chargemod delivered an E-Rickshaw for the lab as a part of their EV Community Development Program initiative.\nElectronic Devices and Circuits Lab\nRoom Number: E-13\nFaculty-in-charge: Dr. A V Soumya\nStaff-in-charge: Ms. Smiji RS\n_______________________________________\nLab Description\nThe Analog Electronic Circuits Lab lays the foundation stone for students and is equipped with AC/DC power supplies, function generators, oscilloscopes, training kits for the circuits, IC testers, solder/desolder stations, digital stopwatches, breadboards, digital multimeters and LCR meters. The purpose of this lab is for familiarizing basic concepts of Engineering Circuit Analysis, and to illustrate and reinforce these concepts and provide hands-on experience to the students. This lab is used to conduct a wide range of experiments in Electrical Engineering, such as Diode Circuits, Power Supplies, Optoelectronic Devices, Analysis and Design of BJT and MOSFET Amplifiers, Operational Amplifier Circuits, Power Amplifiers, Frequency Analysis, Oscillator Circuits, Active Filters, and to train Engineers and Technicians on the fundamentals as well as advanced electronic circuits and applications.\nCircuits and Measurements Lab\nRoom no:   B 11\nFaculty-in-charge: Ms. Manju Sreekumar\nStaff-in-charge: Mr. Anand B H\n________________________________________\nLab Description\nThe Circuits and Measurement Lab provides thorough knowledge for students regarding various transducers and instrumentation trainers, resistive, capacitive and inductive measurement systems, LVDTs and strain gauges, thermocouples and RTDs, Spot deflection Galvanometer, Weins Bridge Oscillator and Wheatstone Bridge. The lab also contains many basic electrical variables and time measurement equipments such as Frequency Counters, Digital Stopwatches, Digital Multimeters, Digital Anemometer, Digital Earth Tester, Electronic Energy Meter and Digital Oscilloscopes. The lab helps the students to gain hands on experience in different types of transducers and measurement systems.\nDigital Electronics Lab\nRoom no:   B 309\nFaculty-in-charge: Ms. Surasmi N L\nStaff-in-charge: Ms. Vidya B.\n________________________________________\nLab Description\nThe Digital Circuits Lab is equipped with AC/DC power supplies, function generators, oscilloscopes, training kits for the circuits, IC testers, solder/desolder stations, digital stopwatches, breadboards, digital multimeters and LCR meters. The purpose of this lab is for familiarizing basic concepts of Digital Electronics and logic designing, and to illustrate and reinforce these concepts and provide hands-on experience to the students.\nThis lab is used to conduct a wide range of experiments in logical gates, Digital and Timing Circuits and to train Engineers and Technicians on the fundamentals as well as advanced digital circuits and applications.\nElectrical Machines Lab\nRoom no:   E 11\nFaculty-in-charge: Dr. Nisha G K\nStaff-in-charge: Mr. Senthil Kumar E.\n________________________________________\nLab Description\nThe Electrical Machines Laboratory is equipped with over 20 branded AC machines (single phase and three phase Transformers, Induction machines and Synchronous machines) and DC machines, including programmable V/f controllers, Eddy-current dynamo-motor, industrial type synchronizing panel, etc., enabling our students to work in an industrial environment. The lab facilities are sufficient to provide the practical exposure to the student regarding the basic theory and operation of various electrical machines along with its industrial applications.\nElectrical Workshop\nRoom no:  D07\nFaculty-in-charge: Ms. C. Sojy Rajan\nStaff-in-charge: Mr. Ratheesh Kumar V S\n________________________________________\nLab Description\nThe Electrical Workshop is sufficiently outfitted with all the equipments and accessories for conducting practical classes in wiring practices as per BIS specifications. Models of modern switchgear and wiring accessories are deployed for the benefit of the students. The electronic side deals with the familiarization of Cathode Ray Oscilloscope (CRO), Bread board connections, PCBs and Soldering station. The students are exposed to the current practices in domestic wiring and industrial installation.\nMicrocontroller and Microcontroller Lab\nRoom no:  K 03\nFaculty-in-charge: Ms. Sheenu P\nStaff-in-charge: Mr. Sajan SS\n_______________________________________\nLab Description\nMicroprocessors and Microcontrollers laboratory course helps the students to develop their knowledge on processor architecture and the programming skills. This laboratory course provides hands-on experience to interface I/O devices, perform A/D and D/A conversions etc. The skills acquired through the experiments help the students to do their projects and enhance their knowledge on the latest trends and technologies. This laboratory provides facilities for the use of 8/16 bit microprocessors/microcontrollers and their interfacing for different applications, using hardware and software concepts to meet industry standards.\nPower System Lab\nRoom no:  E 14\nFaculty-in-charge: Mr. Praveen Raj R S\nStaff-in-charge: Mr. Rajeevmon S\n________________________________________\nLab Description\nThe Power Systems Lab is equipped with Power frequency AC/DC high voltage test set (100 kV DC/70 kV AC), Solid state relay test sets, Electromechanical relay test set, transformer oil testing set (manual and automatic), Cable testing equipment, Electrostatic field plotters, a full-fledged power system simulation software ‘Mipower‘, overcurrent and over voltage relays, Static relays, and power quality analyzer. It is used for teaching basic and advanced concepts in power system generation, transmission and distribution, and training in power quality analysis. For student projects, the lab is used for power system modeling and analysis and power quality. The lab is primarily used for teaching power system (basic and advance modeling, transmission lines, generation, distribution network and fault analysis, protective relays characteristics and schematics, and power quality analysis.\nPower Electronics Lab\nRoom no:   E 12\nFaculty-in-charge: Dr. Dishore S V\nStaff-in-charge: Mr. Arun N\n________________________________________\nLab Description\nThe Power Electronics Lab is equipped with Power Electronics Training System- Power MOSFETS, Power Thyristors, Chopper/invertors Control Units, Thyristors Controllers, Function Generators, Oscilloscopes, Power scopes, Multimeters and Signal Generators. It is used for teaching the integration of power electronics converters to design and implement motor drive systems and controlled drives.\nPG Drives Lab\nRoom no:  B 309\nFaculty-in-charge: Ms. Sandhya P\nStaff-in-charge: Mr. Sajan S S\n_______________________\nLab Description\nThey lab is mainly meant for the P.G. students to carry out research on emerging areas of Power Electronics, Control Systems and Drives. Simulations as well as real time implementation to validate concepts can be performed.\nProject Lab\nRoom no:  B 312\nFaculty-in-charge: Dr. Shalu George K\nStaff-in-charge: Mr. Arun N\n_______________________\nLab Description\nThe Department of Electrical and Electronics Engineering has one well equipped and spacious project laboratory to carry out the project work of students. This lab provides space for students to place their theoretical ideas before the real world. The lab can be accessed during the working hours and is also made available for working beyond hours, if required. Effective utilization of the lab is done by the department. The major equipments in the lab include Digital Storage Oscilloscope, Function Generator, Digital Multimeter and Computers installed with MATLAB.\nControl System Lab\nRoom no:   K 02\nFaculty-in-charge: Ms. Shyju Susan Mathew\nStaff-in-charge: Ms. Prabha S\n_______________________\nLab Description\nThe Systems and Control Lab is equipped with Stepper Motor Controller, Servo Motors, Temperature Control Process, Pressure and Flow Control Process, Synchro Transmitter-receiver Trainer and Digital Oscilloscopes. This lab is intended to introduce the fundamentals of various analog and digital control systems, for testing, calibration and diagnostic of various control systems, PID controllers and interfacing, and for diverse student projects.\nSoftware Labs I & II\nLab Description\nThe Department has one full-fledged and fully equipped computer lab (Software Lab with all kinds of Software platforms for engineering education. These labs are run under the keen control of teaching staff and technical staff. The lab-in-charge of the labs are fully responsible for the smooth running of the labs. The Simulation/Software lab consists of computer systems with packages like Mi Power, MATLAB, SIMULINK, Comprehensive Control package, AUTOCAD – Electrical, etc. installed in them, to help the students to gain a practical experience in these softwares.\nSoftware Lab I\nRoom no:  B 308\nFaculty-in-charge: Ms. Shilpa Susan Peter\nStaff-in-charge: Mr. Midhun Gopal V\n_______________________\nSoftware Lab II\nRoom no:  C 300\nFaculty-in-charge: Mr. Midhun G\nStaff-in-charge: Mr. Vijil Francis\n_______________________\nDepartment Library\nApart from highly equipped Central Library the Electrical and Electronics Engineering Department separately owns a standard library. This Department Library has several foreign and well known publishers’   books and study materials related to Electrical Engineering along with the textbooks and reference books prescribed by the University of Kerala as part of the Electrical Engineering curriculum. The Department is proud as the Faculty Members and students rely on the library faithfully for their reference, development and  research activities.\nApart from the above mentioned texts and references the Department also take initiative in subscribing to various Technical Journals and Magazines. The Faculty Members and students having IEEE Membership help in updating the Department.\nFaculty in-charge: Ms. Revathy K. P.\nVision\nTo be a Centre of Excellence in Electrical & Electronics Engineering Education, Research and Application of knowledge to benefit the society at large.\nMission\nTo mould quality Electrical Engineers, fostering creativity and innovation to address global issues.\nBoS\nDepartment Advisory Board\nThe People\nFacilities\nNews and Events\nActivities\nConferences\nWorkshops & Seminars\nResearch & Consultancy\nPlacement\nB. Tech PEOs, POs & PSOs\nOpportunities\nCurriculum & Syllabus\nTime Table\nVideo Lectures\nFormer HODs\nDepartment Google Site"
}