{
    "filename": "mbcet.ac.in_2022_06_09_ieee-international-conference-on-signal-processing-informatics-communication-and-energy-systems-2022-ieee-spices-2022-10-12-march-2022_.html",
    "content": "IEEE INTERNATIONAL CONFERENCE ON SIGNAL PROCESSING, INFORMATICS, COMMUNICATION AND ENERGY SYSTEMS 2022 (IEEE SPICES 2022) 10 – 12 MARCH, 2022 – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nThe IEEE International Conference on ‘Signal Processing, Informatics, Communication and Energy Systems (IEEE SPICES 2022) jointly organized by Mar Baselios College of Engineering and Technology, Trivandrum and the IEEE Kerala Section in association with Bowie State University, USA and the College Alumni Association (MBCETAA) was held during 10-12 March, 2022. In association with the conference, a press meet was held at Trivandrum Press Club on 08 March, 2022. The theme of the conference was “Smart Systems for Sustainable Development and Social Welfare” and it provided a platform for technical exchange amongst researchers from academia, research laboratories, and industries in various emerging fields of Signal Processing, Communication, Computer Science, Energy Systems, Instrumentation & Control Systems, Robotics and Smart Cities and so on. The technical program included Tutorial Sessions by experts, keynote lectures, plenary talks, regular technical sessions, and special invited sessions.\nOn 10 March 2022, three tutorial sessions were conducted as part of this conference. First session was led by Dr. V. R. Jisha, Professor (Dept. of Electrical Engineering, College of Engineering, Trivandrum), and second session by Prof. (Dr.) Bhim Singh, CEA Chair Professor, Dept. of Electrical Engineering, IIT Delhi. Dr. Darsana P. Josyula, Professor, Dept. of Computer Science, Bowie state University, USA, delivered the third tutorial session.\ninaugUral function\nThe inaugural ceremony of the three-day Conference on SIGNAL PROCESSING, INFORMATICS, COMMUNICATION AND ENERGY SYSTEMS 2022 commenced with the lighting of lamp by a group of dignitaries. Dr, Rajasree M.S, Vice-Chancellor, APJ Abdul Kalam Technolgical University inaugurated the three-day Conference in the presence Mr. Sreekumar V (Centre Head, Tata Elxsi Limited, Technopark Campus, Trivandrum), Dr. Mini Ulanat, (Professor of CUSAT and Chair, IEEE Kerala Section.), Prof Dr Jijimon K Thomas, (Principal, Mar Ivanios College), Rev Fr John Vilayil, (College Bursar), Dr. Abraham T Mathew (General Chair, IEEE Spices 2022 and Principal, MBCET), Dr. S Viswanatha Rao(Vice Principal and Dean (Academic Affairs- UG), MBCET)and Dr. Jayakumari J (Organizing Chair, IEEE Spices 2022, Head of ECE, MBCET),\nDr.Jayakumari.J formally welcomed all the dignitaries present on the dais and participants from various parts of the country, colleagues & students. Dr. Abraham T Mathew briefed about the importance of the conference theme and the significance and impact of sustainability in today’s world.\nDr. Mini Ulanat gave the presidential address. She quoted on various opportunities provided by the IEEE kerala section. “Kerala section is known for its activities in the humanitarian sector. In fact, the special interest group for humanitarian activities had its start from Kerala, after the work done by the volunteers post tsunami.There are a lot of opportunities for volunteers and many of the volunteers are making use of it – we are giving back to society. This is the right time because we are the elite group who are having the facility to enjoy wgat higher education can give. Now is the time to give back to society. ”\nDr. Rajasree M. S. gave the inaugural address. She connected this year’s theme “Smart Systems for Sustainable Development and Social Welfare” with the acronym SPICES: “The speciality of spices is that the right combination of spices makes things precise and very accurate. We know that one of the main aspects of smart systems is cyber-physical systems, which over the years have transformed the way systems are engineered, as the internet has transformed our lives. They integrate sensing, computation, control and networking into physical systems and infrastructure, creating them and connecting them to the internet and also to one another. This has to be made a reality for a sustainable future.” She also mentioned “Sustainability is all about making systems engineered by integrating smartness into the system making them meaningful in the context in which they are, and enable them to achieve the quality parameters with which they should perform. This can be applied to transportation, energy systems, healthcare, also to address natural calamities.”\nMr. Sreekumar V lauded the initiatives of the college over the years in inculcating the right kind of engineering and technology aptitude among young engineers in the state. He spoke about how Tataelxsi has been associating with academia and pitching in to help students become more employable into the corporate world.  He added “I congratulate IEEE and the conference organisers for choosing this theme for this year’s conference event. Wishing the SPICES conference to be a huge success.”\nRev. Fr. John Vilayil, Bursar, MBCET honored the guests. Dr. S Viswanatha Rao and Prof Dr Jijimon K Thomas briefed about the importance of the topic and our esteemed resource persons. They wished for the success of the conference and inspired the everyone to actively participate in the conference to get benefited.\nDr. Bijoy A Jose, Secretary, IEEE Kerala Section extended the vote of thanks and expressed his gratitude to one and all for gracing the occasion.\nValedictory function\nThe IEEE SPICES 2022 came to an end in the evening of March 12, 2022. Altogether 104 papers were presented in this mega-event, of which 2 delegates were from outside India, 9 delegates are from industry and 94 are from academia including research scholars, faculty and UG/PG students. Arrangements were made for both ONLINE and OFFLINE presentations. The conference had eight technical sessions on 8 different themes along with project expo by the students. There were 3 plenary speakers and 5 keynote speakers.\nAs a gesture to mark the end of successful completion of three days international conference and to felicitate authors and participants for successful submission and presentation of their innovative ideas, the Valedictory function was held at Visvesvaraya Hall of the College.                        Dr. Abraham T Mathew (General Chair, IEEE Spices 2022 and Principal, MBCET), welcomed the august gathering. He also congratulated all the participants. Sir also appreciated the hard work done by individual staffs for the conference.\nDr. Jayakumari J (Organizing Chair, IEEE Spices 2022, Head of ECE, MBCET)) placed the technical report of the Conference. She summarized on the number of papers received, the review process,pre conference tutorials, keynote sessions and tracks  held from 10\nth\nto 12\nth\nMarch 2022. She also pointed out that the proceeding will be published as a permanent reference for authors in IEEE Xplore. Rev. Fr. John Vilayil, Bursar, MBCET honoured the guests.\nThe Chief Guest of the valedictory function was Rt. Rev. Msgr. Dr. Mathew Manakarakkavil Corepiscopo, Member, Governing Body, MBCET and Chief Vicar General, Major Archdiocese of Thriuvananthapuram, Malankara Catholic Church, he emphasized on the significance of signal processing, informatics, communication, robotics and energy systems in the modern era. . The function was presided over by Dr. Muhammed Kasim (Vice-Chair, IEEE Kerala Section), who in his address pointed out the opportunities that the students can explore through IEEE kerala section.\nDuring the valedictory speech, the guest of honour Shri V K. Mathews (Executive Chairman, The IBS Group, Thriuvananthapuram) congratulated all the researchers and students. Also, he congratulated the initiatives of IEEE Kerala Section and Mar Baselios College of Engineering for organising the conference in an impeccable manner. He delivered a thought-provoking speech on how the world is now in a peculiar situation, after coming out of the Covid 19 pandemic. Mr. Mathews highlighted four major changes that are felt across the community as a whole: accelerated technology adoption, the changing nature of jobs, the changing operating models in work and the current state of the digital economy that we have entered now. He spoke about the three current mega trends of the day: personalization, disintermediation and virtualization. Mr. Mathews’ parting words on the need for change to happen from within each one of us, and the importance of continual learning, provided food for thought.\nThe best paper award for each track were presented and the program ended with vote of thanks by Ms. Luxy Mathews, Program Chair, IEEE SPICES 2022, Associate Professor, Dept. of ECE, MBCET.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}