{
    "filename": "mbcet.ac.in_faculty_mr-praveen-raj-r-s_.html",
    "content": "Mr. Praveen Raj R. S. – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMr. Praveen Raj R. S.\nEmployee Code / ID No.\n10303005\nQualifications\nM.Tech (Power Systems)\nOrcid ID\n—–\nIndustry / R & D Experience\n—–\nEmail ID\n[email protected]\nAlternate E-mail ID\n—–\nMobile No (Optional) / Intercom Extension No.\n408\nAreas of Interest / Current Research\nSmart Grids, Islanding\nResearch,  Consultancy, Publication\n——\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nSarika E P, Mr. Praveen Raj R S, “Comparison of direct torque control of two level fed three phase induction motor with conventional sinusoidal pulsewidth modulation scheme”, in the proceedings of International Conference on Current trends in Engineering and Technology (ICCTET), July 2014.\nMary Suja Antony, Mr. Praveen Raj R S, “Field oriented control of PMSM with carrier-based Space Vector Pulse width Modulation technique”, International Journal of Engineering Research and Technology, Aug 2015.\nMary Suja Antony, Mr. Praveen Raj R S, “Four Quadrant operation of Vector Control of PMSM with dynamic Braking”, International Journal of Engineering Research and Technology, Aug 2015.\nMary Suja Antony, Mr. Praveen Raj R S, “Switching Loss Estimation of SiC Mosfet in LT spice”, International Journal of Electrical and Electronics Engineering, Aug 2015.\nDawn P Varughese, Mr. Praveen Raj R S, “Solar powered closed loop SVPWM inverter connected to grid”, International Journal of Science and Innovative Engineering & Technology, May 2017.\nAthul Satheesh, Govind P.N, Harinarayanan S.M, Mukul Krishna & R.S Praveen Raj,” Surveillance, Fire Detection and Protection System for Substations”, International Journal of Engineering Research & Technology (IJERT), Volume 9, Issue 7, pp. 456 -460, July – 2020\nPraveen Raj R S, Sreejaya, Hybrid Islanding Recognition Scheme for PV driven Distributed Generators using Rate of frequency deviation and sub-harmonic injectio in Q axis current, International Journal of Elecetrical Engineering and Technology, Vol. 13, Issue 3, March 2022, pp: 1 – 10.\nPraveen Raj R S, Sreejaya, Performance Assessment of a Hybrid Islanding Detection\nScheme for PV Based Distributed Generators Combining Total Harmonic Distortion and Bidirectional Reactive Power Injection, Proceedings of the International Conference on Signal Processing, Informatics, Communication and Energy Systems 2022, March 2022, pp: 257 – 262.\nAcademic / Professional Outreach Activities\nChairman, Class Committee S2 EE (2021)\nM Tech (PCD) Staff coordinator (2019 to 2021)\nB- Tech (S6 EE1) Staff Advisor (2019-20)\nKerala University Exam Chief Supdt. (2016 to 2019)\nAsst. HoD (EE- 2011 to 2013)\nNBA Accreditation Criteria Co-ordinator (Criteria 10) – 2018 onwards\nNBA Accreditation Criteria Co-ordinator (Criteria 8) – till 2018\nCrossroads Technical Event co-ordinator 2016\nCross roads Light and Sound co-ordinator\nCross roads Publicity Co-ordinator 2018\nMembership in Professional bodies/ organizations\nISTE\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\n—–\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}