{
    "filename": "mbcet.ac.in_faculty_ms-surasmi-n-l_.html",
    "content": "Ms. Surasmi N L – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs. Surasmi N L\nEmployee Code / ID No.\n10312023\nQualifications\nM Tech\nOrcid ID\nhttps://orcid.org/0000-0001-8172-0007\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9744553938/403\nAreas of Interest / Current Research\nPower Electronics, Power Quality, Electric Drives, Renewable Energy System\nResearch,  Consultancy, Publication\nJOURNAL PUBLICATIONS\nSurasmi N L, Shiny G, Vinod B R “Enhancing Grid Power Quality with Shunt Active Filter and Unified Power Quality Conditioner,” Journal of Electrical Systems (ISSN:1112-5209, indexed in Scopus and ISI Thomson Reuters), Volume 20, Issue No 3, pp.7755-7773, 2024.\nINTERNATIONAL CONFERENCES\nSurasmi N L;,Shiny G, Vinod B R, “Grid Integrated Hybrid Renewable Energy System for Power Quality Improvement Using Open End Winding Transformer”, 2024 International Conference on E-Mobility, Power Control and Smart Systems (ICEMPS 2024) held at Mar Baselios College of Engineering and Technology from 18th to 20th April 2024.\nSurasmi N L; Anjana S; Titto S Babu; Rahul R S;,Vignesh S S, “Closed-loop Speed Control of BLDC Motor Using Flyback Converter for Electric Vehicle Applications”, 2024 International Conference on E-Mobility, Power Control and Smart Systems (ICEMPS 2024) held at Mar Baselios College of Engineering and Technology from 18th to 20th April 2024.\nSurasmi N L, Shiny G,” Grid-integrated Solar Photovoltaic Converter Control for Power Quality Enhancement,” IEEE 2023 International Conference on Control, Communication and Computing (ICCC), July 2023.\nSurasmi N L, Shiny G, “Hybrid Multilevel Inverter Control for Harmonic Mitigation, ” IEEE 2023 International Conference on Control, Communication and Computing (ICCC), July 2023.\nSurasmi N L, Abirami T J, Vinod B R, Shiny G ,”Synchronous Reference Frame Theory Based Shunt Active Filter For Harmonic and Unbalance Compensation,”      IEEE 2023 International Conference on Control, Communication and Computing (ICCC), July 2023.\nPeer Reviewed Science cited International Journals\nSurasmi N L, Hridya C K, ” Hybrid Energy Storage System for Electric Vehicles”, International Journal of Engineering Research and Technology (IJERT), ISSN 2278-0181, June 2021.\nAravind H, Christy Alex, Jithin John, Sharu Susan Jacob, Surasmi N L, “IoT Based Wearable for surgical and Post-operative Patients”, International Journal of Engineering Research &amp; Technology (IJERT), Vol. 09, Issue. 06, pp: 922-927, June 2020.\nArya Chandran D, Surasmi N L, ” Comparative analysis of Three level inverter fed Induction motor drive with and without DTC Technique”, in IJIRSET, Vol 7, Issue 4, April 2018.\nSurasmi N L,Sajeev Stanley, ” MMF Control Algorithm for Torque and Speed Ripple Reduction in BLDC Motor “, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering (IJAREEIE), Vol 6, Issue 6, June 2017, ISSN (Print): 2320 – 3765.\nSurasmi N L, Sajeev Stanley, “Open Loop Control of BLDC motor using SVPWM Inverter”, “, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering (IJAREEIE), Vol 6, Issue 3, March 2017.\nSwetha C, Surasmi N L, “SVPWAM for a VSI fed Induction motor drive for Solar Powered Electric Vehicles”, International Research Journal of Engineering and technology (IRJET), Volume: 03 Issue: 08 | Aug, p-ISSN: 2395-0072.\nSwetha C, Surasmi N L, “Implementation of SVPWAM Method for A VSI Fed BLDC Motor Drive” International Journal of Environmental Science, Computer Science and Engineering & Technology (JECET), June 2016- August 2016; Sec. C; Vol.5. No.3, 267-277.\nSwetha C, Surasmi N L, “Space Vector Pulse Width Amplitude Modulation Method for a VSI fed Induction Motor Drive”, International Journal of Advanced Research in Electrical Electronics and Instrumentation Engineering, Vol. 5, Issue 6, June 2016.\nSurasmi N. L., M. R. Sindhu, “Optimum Allocation of Active Filters In A 4-Bus System Using Genetic Algorithm.” in International Journal of Emerging Technology and Advanced Engineering (ISSN 2250-2459), Volume 2, Issue 4, April 2012.\nPeer Reviewed Science cited International Conferences\nSurasmi N. L., Shiny G, “Power Quality Improvement in Multilevel Inverter using Open end winding Motor Scheme” in the 5th IEEE International Women in Engineering (WIE) Conference on Electrical and Computer Engineering 2019 (IEEE WIECON-ECE 2019 Conference) on 15 & 16 November 2019 at Bangalore, India.\nSurasmi N. L., Shiny G, “Harmonic Mitigation in Induction-Motor Drives using Active Filtering Approach,”2020 IEEE International Power and Renewable Energy Conference (IPRECON), October 2020.\nNimy V P, Surasmi N L, “Harmonics and DC Offset Elimination Scheme for Buck-Boost Converter Fed Single Phase Inverter” in ICCC 2015 at CET Thiruvananthapuram).\nRenu V., Surasmi N L, “Optimal Control of Selective Harmonic Elimination in a Grid-Connected Single-Phase PV Inverter” Dec 17-18,2014, International Conference on Advances in Green Energy (ICAGE), Pages 265 – 271, IEEE Conference Publications 2014.\nPeer Reviewed National Conferences\nSurasmi N L, “COVID-19 and Digital Transformation in Academia: A Case Study”, ISTE National Faculty Convention 2020, MBCET, Trivandrum.\nSwetha C, Surasmi N L, ” Comparison of SVPWM and SVPWAM method for a VSI fed BLDC motor drive”, 17th National Conference on Technological Trends (NCTT-2016), College of Engineering Trivandrum, 19th – 20th August 2016.\nRenu V. and Surasmi N. L, “Adaptive Compensation for Lower Order Harmonics in a Grid Connected Single phase PV Inverter” 3rd National Conference on Emerging Technologies (NCET 2014), 1-2 August 2014, Trivandrum.\nAcademic / Professional Outreach Activities\nReviewer-International Conference on Emerging Technologies for Intelligent Systems (ETIS 2025), INTERNATIONAL CONFERENCE ON E-MOBILITY, POWER CONTROL AND SMART SYSTEMS- 2024, Computers and Electrical Engineering Journal\nDepartment Advisory Board Coordinator\nICEMPS 2024 Organizing Committee Member\nExecutive Committee Member MBCETAA\nStaff Club Secretary (2021-22)\nFaculty Coordinator –  Dept of EEE\nNBA Criteria 5 Coordinator\nNAAC Criteria 3 Member\nLab in charge- Digital Electronics Lab\nStaff Advisor(2015-19, 2019-23) Staff Coordinator (2023-27 EE)\nWomen Studies Unit -Member\nTutorial Commitee Member- SPICES 2022\nModule Coordinator\nPower Electronics Research Group Member\nB Tech / M Tech Admission Duty Committee Member 2021\nISTE Faculty convention 2021 -Technical Committee Member\nNEXUS 2019 International Summit Committee Member\nPEDES 2016 International Conference- Committee Member\nICAGE 2015 International Conference-  Committee Member\nExam Cell Department Representative (2014-15)\nMembership in Professional bodies/ organizations\nMISTE, IEEE\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\nBEST Paper award for paper titled “Hybrid Multilevel Inverter Control for Harmonic Mitigation, “in  IEEE 2023 International Conference on Control, Communication and Computing (ICCC), July 2023\nThird rank holder in M. Tech (Power Electronics) from Amrita School of Engineering, Ettimadai, Coimbatore (Amrita University) during the year 2010-2012.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}