{
    "filename": "mbcet.ac.in_departments_mechanical-engineering_student-activities_.html",
    "content": "Student Achievements and Activities – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nMechanical Engineering\n>\nStudent Achievements and Activities\nStudent Achievements and Activities\nStudents Achievements\nJ Ananthakrishnan, Anzil Asharaf, Seby Toms\n(S6 ME) were part of the team that represented MBCET and won first prize for the event Battle of bands held at IIST on 15/03/2025. They had also won Second prize for Battle of Bands at Rasam 2025 held at Providence College of Engineering on 07/02/2025.\nMr. Sidharth S. D.\n(S8 ME) was awarded scholarship for undergoing value addition course at Armstech Engineers private Limited.\nGowrisankar Manikandan of S4ME1\nSecured Gold Medal in the Kerala State Classic Powerlifting Championship conducted by Power Lifting Association, Ernakulam zone, at under 105 kg (Junior Category) on Sunday, 16 February 2025 held at Rajiv Gandhi indoor Stadium, Kadavanthara, Kochi.\nAravind Ajay of S5 ME\nwas selected as the Captain of the KTU Men’s Tennis team in the South Zone Inter University Tennis Championship hosted by Kerala University\nMr. Adithyan S Kumar, Mr. Ayvin Ajith, Ms. Nandana M, Mr. Sidan Ahammed S. (final year ME Dept students)\nhas presented a paper on the topic “Design and fabrication of a diaper recycling device” during the All India Seminar on ‘Material Efficiency in Clean Energy Transitions’ held on October 22 and 23rd 2024 at Visvesvaraya Bhavan, Thiruvananthapuram organised by The Institution of Engineers (India), Kerala State Centre under the aegis of Mechanical Engineering Division Board, IEI.\nMr. Arjun Sunil, Ms. Bhadra S.S., Mr. Gokul Krishnan G R, Mr. Adityan S R (final year ME Dept students\n) has presented a paper on the topic “Design, Analysis and Fabrication of Heat Transfer Fluid Tubes in PTC” during the All India Seminar on ‘Material Efficiency in Clean Energy Transitions’ held on October 22 and 23rd 2024 at Visvesvaraya Bhavan, Thiruvananthapuram organised by The Institution of Engineers (India), Kerala State Centre under the aegis of Mechanical Engineering Division Board, IEI.\nA\nDesign Patent\nfor ‘Device for detecting Sodium Benzoate’ was awarded by the Patent office Govt of India to the following authors Mr. Aaron K B (student, S6 MED), Dr Krishnamohan GP (Faculty, S&H), Ms. Amritha BJ (Faculty, ECD), Dr Dishore S. V. (Faculty, EED), Mr. Chandramohan B (IEDC).\nAnanth P. Nampoothiri, Adithya Jayakumar K. T.,\nJohn Sony Kurien\n, S6 students of ME Department received certificate of appreciation from\nAnushreedha S. S.\n, Project Officer, WWF-India for pitching an environment conservation idea ‘Solar tree’ as part of WWF-India’s ECHO – Building Environment Conservation Heroes Programme 2023-24 on 26/06/2024 (Wednesday).\nGroup mentor:\nDr. Nidhi M. B\n. Professor in MED.\nMr. Aaron Koshy Boby (student of S6 ME) presented a poster (paper titled “A Patentleft Design to Estimate the Sodium Benzoate Preservative in the Food Grade Ice and Other Commodities”) at National level research conclave ‘Research Conclave on Global Transformation 2024 (ReconGT24)’ organized by The National Institute of Technology Calicut on April 19-20, 2024. Other authors – Dr. Krishnamohan G.P., Associate Professor, S&H Dept; Ms. Amritha B. J., Assistant Professor, ECD; Dr. Dishore S V, Assistant Professor, EED, Mr. Santhosh P, Texas A&M University Qatar and Mr. Chandramohan B.\nThe following papers from ME Department were presented at 15th International Symposium on Experimental and Computational Aerothermodynamics of Internal Flows (ISAIF 2023), 24-27 Oct 2023 held at IIT Madras. All papers are products of UG dissertation/project.\n“Numerical Study On Flow Oscillation Suppression Mechanism When Supersonic Flow Passes Open Cavities”, Mahadev A K*, Milan A, Abhijith T, Anjith S, K Muraleedharan Nair\n“Computational Study on The Effect Of Slot Span On Wing Performance of a NACA4412 Airfoil”. Arghya P.S*, Ananthan A, K Muraleedharan Nair\n“Effect of shockwaves on supersonic film cooling with rectangular and triangular slotted wall”, Anjan R Nair, Melvin Jacob, Arghya P.S, Ananthan A*\n“Numerical Investigation on Novel Scramjet Design for Optimizing Flow Characteristics”, Shalom B Varghese, Bobin Saji George, Mohamed Safan*, Anston Nixon, Alen Sunny\nThe following papers were presented by final year Mechanical Engineering students at the National Conference on ‘Recent Trends in Design and Application in Energy Development Programme’ held on 10th & 11th May 2023 organised by The Institution of Engineers (India), Kerala State Centre under the aegis of Mechanical Engineering Division Board, IEI.\nPaper on ‘Flexible Single Valve PSA Oxygen Concentrators for Medical Applications’ by Mr. Yethil. A.N., Mr. Akul Lal, Mr. Ananthan A., and Dr. Nidhi M. B., Associate Professor, MED.\nPaper on ‘Battery performance Analysis’ by Ms. Shilpa Nair U. S., Mr. Sethuraman R. S., Ms. Vrinda S. S. and Dr. Nidhi M. B., Associate Professor, MED.\nPaper on ‘Review on Battery Thermal Management System of Electric Bus’ by Mr. Stebin Philip Biju, Mr. Akshay V. B., Mr. A. Sai Sreedhar, Mr. G. J. Roopesh and Dr. Nidhi M. B., Associate Professor, MED.\nThe paper titled ‘Numerical Investigation on Parametric Study of Fins for Waste Heat Recovery’ by Allen Babu, Anamika Vijayan, Aromal RV, Nikhil Krishna RS (under the guidance of Mr. Vaisakh S. Nair, Asst Professor, MED) was presented at the 2nd International Conference on Energy Resources and Technologies for Sustainable Development (ICERTSD 2023), IIEST Shibpur, India.\nMr. Joel Thomas of S6 ME1 competed in a national level best manager competition hosted by CET School of Management Trivandrum on April 2023 and came in first position.\nMiss. Bhadra S. S. of S4 ME secured 8\nth\nposition in the Triathlon National Championship held in Karnataka on April 09, 2023.\nAkul lal, Ananthan A, Yethil A N presented a paper titled ‘Simulation and Analysis of Portable Oxygen Concentrator’, guided by Dr. Nidhi MB, Assoc Prof MED, MBCET at Mohandas College of Engineering and Technology on 25 March 2023 as part of the International Conference on Operations Research, Differential Equations, Numerical Analysis, Computing, and applications -CORDENumACA’23.\nTeam comprising of Mr Henry Christudas Isaac, Gokul R S Nair, A Muhammad Siddique, Saran Deny, Sarath S and Rahul B of Mechanical ME1 (2018-22 Batch) mentored by Dr. Deepak G Dilip, Assistant Professor, Mechanical Engineering, MBCET has been selected for funding for their idea “BICYCLE TRACTOR” at the recently concluded IDEA FEST 2022 conducted by Kerala Startup Mission.\nMiss Bhadra SS(S2ME) is selected in the forthcoming  36th National Games representing Kerala in Triathlon, going to be held at IIT Gandhinagar, from 8th to 11th October 2022. She has Individual and Mixed team relay competition.\nIndia’s very first international Airship regatta ( Design and Engineering of Lighter -Than-Air systems) happened at IIT Bombay from 24-26 June, Team Skyarc got within first 10 teams and it was the only team who got qualified from south india and only team from Kerala. The participants were Vignesh K. , Arjundev J A, V.S Savio , Gokul Krishna Gopakumar from S4 ME1.\nMr. Anjith Madhav D.\nof S5 ME-2 has been selected for the MITACS Globalink Research Internship 2022. Title of the project: “Clean energy Generation in urban water systems”. The internship will be hosted by Concordia University, Montreal, Canada.\nMr. Bharath Suresh Appukuttan Nair\nof S1 ME has won the “Video Contest” conducted by the team of upcoming movie “Time to think”.\nMr. Aaron Koshy Boby\nof  S1 ME got selected for an internship at GTECH MuLearn Community for the role of Interest Group Management.The internship period is 3 months, officially started on Jan 24\nth\n2022.\nIndian Society of Heating, Refrigerating & Air Conditioning Engineers (ISHRAE) conducts ‘Job Junction ‘, an initiative to provide job opportunities to fresh graduate engineers across the country. Test was conducted on National level and five students got selected from Trivandrum, of which four are from MBCET. Following students from S8 Mechanical got selected – Ms. ArvaS. Swami, Sam RonyZachariah, James S. and Joel John.\nMr. William George,\nfinal year student has won the BASELIAN award for the year 2021.\nAnashwara Binod\nof S7 ME1 received her GTech Mulearn Joint Director of Operations Badge from Mr. Binu Jacob who is the Secretary at GTech and Managing Director of Experion Technologies. She was the Content Writer at GTech. Based on her performance, she was promoted to a new role as Joint Director of Operations at GTech. She received the badge at CTF Award Ceremony at APJ Abdul Kalam Technological University, Thiruvananthapuram.\nMs. Bhadra S. S., of first year Mechanical Engineering participated at the\n1st National Finswimming Championship\nconducted by Underwater Sports Federation of India at Ponda, Goa on Nov 18-22, 2021 and won two silver medals (200m monofins senior A category and 400m bifins  senior A category).\nPran P.\nof S6 ME2 passed the World Squash Coaching (WSC) Level 1 Certification Exam organized by HCL Squash Podium Program held at Secunderabad Club from 19-23 February 2020.He also won his first ever National Bronze Medal at the Squash Racquets Federation of India JJ Sports National Open Squash Championship held at Kanyakumari.\nSreerag S.\nof S8 ME2 bagged the 2nd place in Classical Instrumental Solo at the 35th Inter-University South Zone Youth Festival held at Alagappa University, Madurai from 18 to 22 December 2019\nHarikrishnanJayan Menon of S8 Mechanical won the Third place (cash prize $200) for the topic “Cardiovascular Fluid Mechanics” at the Old Guard Oral Presentation Competition held at ASME EFEST for ASIA- PACIFIC region organised at Delhi Technological University, New Delhi, INDIAin the month of March (16th -18th), 2018. Participants :HarikrishnanJayan Menon, Bharath Lal L, Edwin Denis Joseph.\nMr. Arjun Subramonian of S6 ME2 secured first prize in Indian Classical Dance (Event-Kathakali) in the 33rd All India Inter University Youth festival held at Ranchi, Jharkhand in February 2018.\nFinal year students of the department Ajmal M, Akhil J Mohan, Aswin M, Deepus S R and Ribin Das M R presented the paper titled “EXPERIMENTAL AND NUMERICAL STUDY OF HEAT DISSIPATION FROM ELECTRONIC COMPONENT IN A CLOSED ENCLOSURE” at 1stInternational and 18th National, Indian Society for Mechanical Engineers (ISME) Conference held at NIT Warangal on 23-25 Feb 2017. Guided by Asst Prof.  Bobin Saji George.\nFinal year students of the department Ajmal M, Akhil J Mohan, Aswin M, Deepus S R and Ribin Das M R paper titled “EXPERIMENTAL AND NUMERICAL STUDY OF HEAT DISSIPATION FROM ELECTRONIC COMPONENT IN A CLOSED ENCLOSURE” Abstract accepted at 24th National and 2nd International ISHMT-ASTFE Heat and Mass Transfer Conference (IHMTC 2017), 27-30 December 2017. Guided by Asst Prof.  Bobin Saji George.\nFinal year students of the department Ajmal M, Akhil J Mohan, Aswin M, Deepus S R and Ribin Das M R paper titled “EXPERIMENTAL AND NUMERICAL STUDY OF HEAT DISSIPATION FROM ELECTRONIC COMPONENT IN A CLOSED ENCLOSURE”Abstract accepted at the 6th Asian Symposium of Computational Heat Transfer 2017 (ASCHT-17), IIT Madras, 10-13 December 2017. Guided by Asst Prof.  Bobin Saji George\nGovind S Kumar and Thomas V Alex final year students of the department secured first prize for the paper “Productivity enhancement of solar still” at the paper presentation event “Technovate” organized by college of Engineering Trivandrum.\nMr. Naveen George Koshy of S6 ME1 secured first position in English essay writing and third position in English elocution competition held on 30th October 2017 as part of Vigilance awareness week Programme 2017, organized by Union Bank of India and Aksharakkoottam, the creative writing club of Mar Baselios College of Engineering and Technology Trivandrum.\nMr. Ajith Kumar S J of S6 ME1 secured first position in Ethic Walk, in cultural program held at Bishop Chulaparambil Memorial College Kottayam, held in February 2018.\nMr. Jibin Joy of S4 ME1 secured second place in FIFA tournament held in College of Engineering, Trivandrum held in November 2017.\nMr. Aneesh Raj S, Mr. A S Dhanush Tee Yee and Mr. Alan B George S8 ME, had been part of the team that won Championship in Kerala University Net Ball Tournament held in February 2018.\nArjun KS final year student of the department  won the prestigious “Kalaprathibha pattom” of the 39th  Kerala University youth festival held from 27th to 31st March 2017 at 9 venues in the city\nFinal year students of the department S Vishnu Prasad, Balu G, Gopal Krishna V presented paper at 1st International and 18thISME Conference, ISME18 February23rd – 25th, 2017, NIT Warangal, Warangal on “INVESTIGATION ON FLOW INDUCED OSCILLATIONS WHEN LOW-HIGH SPEED FLOW PAST A ROUND CAVITY”. Guided by  -Dr. K Muraleedharan Nair.\nMr. Adarsh M P of S8 ME2 had participated in National Level Squash Tournament held in November 2017.\nMr. Pran P. of S2 ME2 was the winner of Trivandrum District Squash Championship and State Squash Championship. He represented Kerala State in Junior National Championship held in Ajmer, Rajasthan and was Champion there also.\nMr. Prapanch P. Reji, Mr. Joel Kurian S2 ME1, had been part of the team that won Championship in KTU Net Ball Tournament held in February 2018.\nMr. Georgy Thomas, Mr. Aron Thomas and Mr. Nigel of S6 ME represented MBCET for KTU Basketball Tournaments in district and state levels and were the champions.\nMr. Abraham Santhosh, Mr. Vigeesh Oommen, Mr. Muhammed Suroor, Mr. Abhimanyu S. and Mr. Deepak Kumar, of Mechanical branch have won 1st place in APJ Abdul Kamal Innovation Award (Rs 1 Lakh), a National Level Project competition, in the Category of Manufacturing and Technology.  The Exhibition wasorganised by ICT Academy, hosted by Sai Ram Institutions at Chennai in April 2017. Their Project guide is Mr. Rajesh T. N., Asst Professor in Mechanical Engg Dept, MBCET.\nMr. Harikrishnan Jayan Menon has attended a 4 week course on Oil and Gas Operations and Markets, from Duke University, USA securing 97.2% (Domicile Rank -2nd )\nAbraham Santhosh, Vigeesh Oommen, Muhammed Suroor, Abhimanyu S of final year Mechanical has won the 3rd prize for the topic “Design and Development of Physiotherapic aid for paraplegic patients” in Project Idea presentation competition YAJNA conducted by the Aeronautical Society of India, Trivandrum chapter on January 28,2017.\nMr. Dean B. George, Mr. Govind S. Syam, Mr. Abhijith S. B., Mr. Gautham Rajeev, final year mechanical students have participated in “Impromptu Design Challenge” – ASME E-fest- Asia Pacific, Jaipur 2017.\nMr. Harikrishnan Jayan Menon, Mr. Govind S. Syam has attended an 8 week online course for Project Management (certified) – IIT Kanpur.\nMr. Emmanuel Ruben Gilbert, M.Tech student (2014-2016 Batch) secured the First Rank in Kerala University in M.Tech – Machine Design 2016.\nMr. Abhijith Vijayan of S7 Mechanical is chosen as the best player in the 43rd UC college basket ball tournament.\nStudents Activities\nYanthra ’25\nYanthra ’25: A Celebration of Innovation\nAn exhibition showcasing the works of final-year Mechanical Engineering students was held on March 24, 2025, at the Department of Mechanical Engineering. The event was formally inaugurated by Rev. Fr. John Varghese Palanilkunnathil (Director) in the presence of Dr. S. Viswanatha Rao (Principal), Dr. Remil G.T. (HoD-ME), Dr. Vinod V (Project Coordinator), and Mr. Adarsh V K (Expo Coordinator).\nA total of 13 projects were exhibited, featuring impressive fabrication and simulation works that addressed real-world challenges. The projects showcased innovations in areas like renewable energy, medical technology, waste management, surveillance systems, and quadcopter control.\nThe Best Prototype Award was presented to the project “Design and Fabrication of a Diaper Recycling Device” by Adithyan S Kumar, Ayvin Ajith, Nandana M, and Sidan Ahammed S, guided by Dr. Nidhi M.B. The project provided an eco-friendly solution for effective diaper waste management.\nThe Best Simulation Project Award was awarded to the project “Effect of Dimples on Aerodynamic Performance of NACA 4412 Aerofoil” by Adhil Navas, Ananthi P Nampoothiri, Darsan Devanand, and Vighnesh B, under the guidance of Dr. Rajesh T.N and Mr. Vaisakh S Nair. The project highlighted advancements in aerodynamic design using innovative simulation techniques.\nCertificates and cash prizes were awarded to the winners, marking a proud moment for the department. Yanthra ’25 stood as a testament to the students’ hard work, creativity, and commitment to engineering excellence.\nOFFROADS 25\nOFFROADS 25, the annual Auto Show event, was organized by the Department of Mechanical Engineering at Mar Baselios College of Engineering and Technology, Nalanchira, on March 1st, 2025. The event primarily featured high-end vehicles, modified vehicles, and various engaging activities.\nHis Highness Avittom Thirunal Adithya Varma graced the occasion as the Chief Guest. Additionally, Instagram influencer Dilin Dinesan (Eagle Gaming) was invited to the event.\nThe event was coordinated by student representative Mr. Bharath Suresh (S8 ME), with faculty coordinators Mr. Ayswer A.S. and Mr. Deepak B. A Music band performed by students of Mechanical Engineering and other cultural activities added vibrancy and excitement to the celebration.\nYANTHRA 24\nYANTHRA 24 – PROJECT EXPO\nAn exhibition showcasing the works done by the final year ME dept students was conducted at the Mechanical Dept Block on May 17, 2024. The exhibition was formally inagurated by Rev. Fr. John Varghese Palanilkunnathil, Director in the presence of Dr. S. Viswanatha Rao, Vice Principal and Dr. Remil George Thomas, Head of MED. A total of 17 projects were put as exhibits, comprising of fabrication works and simulation works. Project faculty coordinators of this expo were Dr. Vinod V. and Dr. Rajesh T. N.\nThe project titled “Monopropellant cold rocket thruster” by the group of A. B. Gouri, Aiswarya Mohan D., V. S. Savio and Vignesh K. guided by Dr. K Muraleedharan Nair; “Sustainable E-bike for urban logistics” by Sooraj Menon, Sreekanth M. R., Dan Mathew Philip, Umesh M. Chandran and Jovan Mathew Thomas guided by Dr Arvind P.; both these projects shared the best expo project award.\nOFFROADS 2024\n“ OFFROADS “  is the annual Auto Show event of The Department of Mechanical Engineering of Mar Baselios College of Engineering and Technology , Nalanchira. It mainly involves showcasing of high end vehicles , modified vehicles , various workshops and other activities. Students of the Mechanical Department conducted “\nOFFROADS-24\n” on\n20th April 2024\nat college premises .\nMr.Sooraj Menon (present S8 ME2) was selected as the student coordinator and Mr.Ajeesh M. V. along with Mr.Ayswer A.S. were the faculty coordinators. His Highness Avittom Thirunal Adithya Varma was invited as the Chief guest for the event. He inaugurated the event and also displayed one of his vehicles from his garage.\nAlong with that instagram influencers such as Call ME Venom , Trivandrum foodie and Senthil Kats were also invited for supporting the event. This time Offroads were planned to be more than an auto show , as a result we added open mics for students to perform music . Along with that students were given a chance to put out their stalls as a fun and educating activity.\nExhibition of vehicle parts were conducted at the A-block giving an insight into how a vehicle performs. A separate room for gaming was also employed simulating driving experiences and also other fun activities. More than 25 cars and 35 bikes were displayed during the event. Special places were employed for various category of vehicles (for example premium cars were displayed in front of A-Block , bikes at OAT ,etc.). We saw a footfall of more than 3000 people.\nOFF ROADS LOGO RELEASE\nThe logo release of the\n“Off Roads”\nto be held in March 2024 was held along with the Senate X’mas celebrations. A super-bike show, displaying 20 super bikes was held at the OAT on 22 December 2023as part of the logo release.\nYANTHRA 23 PROJECT EXPO\nYANTHRA 23 PROJECT EXPO – FINAL YEAR ME STUDENTS\nAn exhibition showcasing the works done by the final year ME dept students was conducted at the Department of Mechanical Engineering on May 19, 2023. The exhibition was formally inaugurated by Rev. Fr. John Varghese Palanilkunnathil (Bursar) in the presence of Dr. Abraham T. Mathew (Principal) and Dr. Remil G.T. (HoD-ME). A total of 26 projects were exhibited, comprising fabrication works and simulation works. Faculty coordinators of this expo were Dr. Vinod V. and Dr. Rajesh T N.\nCertificates and cash prizes were awarded to the following top 3 projects.\nFlexible Single Valve PSA Oxygen Concentrators For Medical Use by Akul Lal, Ananthan A, Yethil  A N.\nGuide Dr. Nidhi M.B.\nThermophysical Property Estimation Of Anisotropic Material Using Inverse Heat Transfer Technique by Aswathy Mohan, Nithik Sudeesh, Sivan Nair, Arghya P S.\nGuide Mr Abhiram R Nair.\nParametric Study On Fins For Waste Heat Recovery Using Thermoelectric Generators by Allen Babu, Anamika Vijayan, Aromal R V, Nikhil Krishna R S.\nGuide Mr. Vaisakh S Nair.\nVORTECHX’22\nDepartment of Mechanical Engineering and AUTOMATA successfully conducted a one day technical fest, VORTECHX’22, on July 2nd 2022. The fest was inaugurated by Rev. Fr. Thomas Mukalumpurathu, Asst.Bursar in presence of Dr. Abraham T. Mathew, Principal and Dr. Rajesh T.N, HOD and Dr. K Muraleedharan Nair, Professor & Dean (Administration).\nA variety of technical events like RC Obstacle race, CATIA workshop, Machine hunt, Cycle race, CAD competition, Pit stop, Lathe master and fun activities were organised. More than 100 students contested for the events mentioned above. Mr. Ajeesh M. V., Faculty Coordinator and Jibi John, Student Head coordinated the programs effectively.\nYANTHRA 22 Project Expo\nAn exhibition showcasing the works done by the final year ME dept students was conducted at the Amenity centre on June 07, 2022. The exhibition was formally inaugurated by Rev. Fr. John Varghese Palanilkunnathil, Bursar in the presence of Fr. Thomas Mukalumpurathu, Assistant Bursar, Fr. Bitty Mathew, Dr. Abraham T. Mathew, Principal and Dr. Rajesh T. N., Head of MED. A total of 28 projects were put as exhibits, consisting of fabrication works and Simulation works. Faculty coordinators of this expo were Dr. Vinod V. and Dr. Deepak G. Dilip. The project titled “Hybrid Multi Utility Bicycle ” by the group of K R Parameswaran, Pratyush Moni S J, Kailas Nath N I, Sidharth Nair guided by Mr. Mobin M Mathew won the best prototype award. The best poster award was won by the project “Testing and Evaluation of Additively Manufactured Injector for Rocket Engine” done by the group composed of Jacob Varghese Karingottu, Raeshma Roopesh and Maadhav Krishnan guided by Dr. Remil George Thomas and the best presenter award was won by the group of Alex George, Vinayak S, Vishu Pradeep and Aju Jacob for their project “Farm-Aidbot” guided by Mr .Bipin Sankar. The awards were distributed by Fr. Thomas Mukalumpurathu.\nVortechx 19\nFInal year students has organised a two day technical fest Vortechx 19 on 27th and 28th April 2019. A variety of technical events including Robo soccer, Lathe master, Paper presentations etc., was organised. The faculty coordinators of the event was Mr. Raveesh G and Mr. Ranith H  and the student coordinator was Mr. Jithin Babu.”\nProject Exhibition 2019\nThe exhibition was organized by AUTOMATA along with student volunteers from the department. There were 31 projects exhibited in total. The projects were categorized as Design and Fabrication, Numerical Simulation and Mathematical Modeling, Experimental Studies and Analysis. Poster presentation of the methodology and results was also arranged. The working video of the fabricated prototypes was displayed. Six of those projects were presented in different International conferences. Two projects were in the Finalist of Kerala start up mission BOOT camp by startup India.\nProject Exhibition 2018\nA platform to showcase the final year project work of students, in which the fabricated final product were be displayed. The one day exhibition was inaugurated by HoD Dr. K Muraleedharan Nair and the Book of Abstracts that includes details of all final year projects was released by Principal Dr. T M George.\nStudents and staff from other departments visited the various exhibition stalls and carried out technical discussions with the project groups.\nThe exhibition was organized by AUTOMATA and the students from the department volunteer their service for conducting the event. A technical team judged the individual projects and their presentation skills were evaluated\nThe students of second semester Mechanical Department conducted a project exhibition on 9/05/2017 as part of their curriculum in Design and Engineering. The project exhibition gave the student platform to identify innovative minds and enhance their team building and leadership skills. The event was overseen by Asst. Prof Raveesh G and Asst. Prof Emmanuel Ruben Gilbert.\nThe final year project exhibition of Mechanical Department, entitled Mech Expo 2017 organized by AUTOMATA, association of mechanical engineering department was held on 21-4-2017. A total of 22 projects were displayed. The exhibition was conducted at three venues. The function was inaugurated by Prof. K.M. Raju, Dean Academic, Prof. K. Gisuthan and Dr. K.Muraleedharan Nair, HOD ME at different venues by 10:00am. During the function a Book of Abstracts was released by Rev. Fr Wilson Thattarathundil, Bursar, and handed over to the Principal Dr TM George .Faculty and students from all departments visited the exhibition and gave excellent feedback. The exhibition provided an opportunity for the students to showcase their creativity, team work, technical expertise presentation and social responsibility. The exhibition came to close by 3:30pm.\nMECH EXPO (MECHANICAL PROJECT EXHIBITION)\nA project exhibition was held on 6/03/2015 by the students of 2015 batch of the Mechanical engineering department. The program started at 10am and continued till 3pm and exceeded all the expectations with a footfall of more than 300 students, excluding the faculty members and the members of the management.\nThe projects exhibited were the works of final year mechanical engineering students.The exhibited projects include:\n1. COMPACT BIOGAS PLANT\n2. DEFORMATION CONTROL OF WORKPIECE FIXTURE SYSTEM BY OPTIMIZATION OF CLAMPING FORCES ON LOCATOR CONFIGURATION\n3. CFD ANALYSIS OF FLOW THROUGH VENTURI OF CARBURETOR\n4. MATERIAL HANDLING SYSTEM\n5. THERMO ACOUSTIC COOLING\n6. REGENERATIVE SHOCK ABSORBER\n7. SOLAR SEGWAY\n8. PIN ON DISC WEAR TESTING APPARATUS\n9. DESIGN OF RECEIVER TUBE OF A PARABOLIC TROUGH COLLECTOR FOR DESALINATION OF SEA WATER\n10. SELF ASSISTED BED\n11. PREPARATION OF BIODIESEL FROM VARIOUS EDIBLE OILS\n12. HUMP FREE ROADS\nThis expo proved to be very informative to the visitors and the real application of theories amazed many junior students and it was a real benefit for all those who visited the expo.Other than the students of the collageBursar Rev Fr Wilson Thattaruthundil,PrincipalDr. T.M. George, Vice PrincipalProf. S. ViswanathaRao, Dean (Administration)Prof. K M Raju,Dean (Academic)Prof. M. K. Giridharan,Dean (R&D) Dr. Sakuntala S. and the Heads Of The various Departments and other members of the faculty also attended this expo.\nEfforts of Head of the Mechaniacal Engineering Department Mr. M Pradeep, Prof K Gisuthan and Assistant Prof Mr K S Venketesh requires special mentioning in making this expo a big success.\nOFFROADZ\nOFFROADZ is the auto expo organized by Department of Mechanical Engineering in Mar Baselios College of Engineering and Technology, Nalanchira as a part of national level Techno cultural fest of the college named Crossraods. The expo showcases automobiles of different ranges under luxury, modified and vintage sections. The objective of the show is to provide the students and public a glimpse of the emerging trends in car design and a visual lesson in automobile engineering.\nOFFROADS 2K18\nTrivandrum witnessed one of the biggest Auto fest in 2018. The Offroads’18 which was conducted by the Mechanical Department of MBCET showcased some of the exquisite vehicles in the capital city. The auto fest which was conducted on 4th March was inaugurated by the Prince of Travancore, His Highness AvittomThirunalAdithya Varma.\nOffroads’18 also was the first auto fest in Trivandrum to feature KAWASAKI Ninja H2 in Trivandrum. The show also presented a wide range of antique bikes and cars which exhibited some of the foregone vehicles of the past. Offroads’18 created a venue for many youngsters who go that extra mile to customize their vehicles. The heavily customized monster truck, Isuzu V-Cross by BABS, was another highlight. The fest was lit by the team TORC. TORC, a Trivandrum based superbike club, featured an array of superbikes which was visual treat.\nSupercars included a Porsche Carrera 911 S and a BMW 640d. A well coordinated and disciplined programmed was witnessed by a large number of people. Offroads’18 was an absolute success and just raised the bars of the auto fests conducted in the whole of Trivandrum.\nOFFROADZ\n2014\nOFFROADZ 2014 was held on March 1st &2nd at Mar Ivanios ground, Nalanchira. The inaugural function took place on 1st March at 11:00 am and was presided over by Rev. Raju Parukoor, principal Dr. T. M. George and Dean Administration Prof. K. M. Raju.\nThe auto expo witnessed aero show of small Static Aircraft Models and Radio Controlled Dynamic Aircraft. It entertained the spectators with acrobatic moves. The aircraft was controlled by the NCC student wing, Cadet Warrant Officer’s Muhammed Mysha Ashraf and Arya U. P., who won the Gold medal at the All India remote controlled aircraft competition at the Republic Day parade, New Delhi.\nWith the theme “SAFETY IS IN OUR HANDS” a road safety campaign was held on 23 February 2014 at Sanghumugham beach which received a great response from the public. The session started with beach cleaning in association with Department of Tourism. A sand sculpture of a hand holding a car was casted by Sri. Deepak Moutatil. The evening session was inaugurated by Sri. Harikumar, Sub. Inspector of Police, Valiyathura, followed by a public interaction session on road safety awareness. All the people who gathered there lighted up candles around the sculpture in memory of their loved ones who lost their lives in road accidents\nOFFROADZ 2013\nThe second edition of “OFFROADZ”, the auto show, organized by Department of Mechanical Engineering, was held on 23 & 24 Feb. 2013. It presented the finest brands in auto industry this year. The Armory Expo was an added attraction this year. The response of the public was quite encouraging and their participation, beyond expectation.\nOFFROADZ 2012\nThe First edition of “OFFROADZ”, conducted by Department of Mechanical Engineering, was held on 24 & 25 Feb 2012 at Mar Ivanios Ground, Nalanchira. The events included Autoquiz, Pit stop, modified car competition etc.\nStudent Projects\nThe student’s project demonstrates the limitless potential and inventiveness of youthful minds. From tackling real-world challenges to exploring new frontiers of technology and creativity, these projects demonstrate the passion and drive of students to make a difference. In this write-up, we will highlight a few notable student projects that have captured the attention and admiration for their innovative ideas and remarkable achievements.\n2024-25\nProject Title: DESIGN AND FABRICATION OF A DIAPER RECYCLING DEVICE\nStudents: ADITHYAN S KUMAR, AYVIN AJITH, NANDANA M, SIDAN AHAMMED S.\nGuide: Dr. Nidhi MB\nProject Title: EFFECT OF DIMPLES ON AERODYNAMIC PERFORMANCE OF NACA 4412 AEROFOIL\nStudents: ADHIL NAVAS, ANANTHI P NAMPOOTHIRI, DARSAN DEVANAND, VIGHNESH B.\nGuide: Dr. Rajesh T.N and Mr. Vaisakh S Nair\n2023-24\nProject Title: MONO PROPELLANT COLD ROCKET THRUSTER\nStudents: AB GOURI, AISWARYA MOHAN D, V S SAVIO, VIGNESH K.\nGuide: Dr. K. Muraleedharan Nair\nProject Title: SUSTAINABLE E-BIKE FOR URBAN LOGISTICS\nStudents: SOORAJ MENON, SREEKANTH M R, DAN MATHEW PHILIP, UMESH M CHANDRAN, JOVAN MATHEW THOMAS.\nGuide: Dr. Arvind P.\n2022-23\nProject Title: FLEXIBLE SINGLE-VALVE PSA OXYGEN CONCENTRATORS FOR MEDICAL USE\nStudents: AKUL LAL, ANANTHAN A, YETHIL  A N.\nGuide: Dr. Nidhi M.B.\nProject Title: THERMOPHYSICAL PROPERTY ESTIMATION OF ANISOTROPIC MATERIAL USING INVERSE HEAT TRANSFER TECHNIQUE.\nStudents: ASWATHY MOHAN, NITHIK SUDEESH, SIVAN NAIR, ARGHYA P S.\nGuide Mr. Abhiram R Nair.\nProject Title: PARAMETRIC STUDY ON FINS FOR WASTE HEAT RECOVERY USING THERMOELECTRIC GENERATORS\nStudents: ALLEN BABU, ANAMIKA VIJAYAN, AROMAL R V, NIKHIL KRISHNA R S.\nGuide Mr. Vaisakh S Nair.\nVision\nTo be a Centre of Excellence in Education and Research, imparting ethical values for the betterment of mankind.\nMission\nTo impart Technical Knowledge and Values through continuous Training and Research for the overall development of the Stakeholders.\nBoS\nThe People\nDAB\nFacilities\nNews and Events\nActivities\nResearch\nPlacement\nB. Tech PEOs, POs & PSOs\nVideo Lectures\nSyllabus\nStudent Achievements and Activities\nTime Table\nFormer HoDs"
}