{
    "filename": "mbcet.ac.in_faculty-department_science-humanities_.html",
    "content": "Science & Humanities – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nTotal: 8 years experience (5 yrs Industrial and 3 years lab)\nEmployee Code / ID No.\n10713024\nQualifications\nMSc, M Phil, P h.D\nOrcid ID\n—-\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n700\nAreas of Interest / Current Research\nPharmacological studies of natural products, Nanomaterials\nResearch, Consultancy, Publication\nIn-house project\nPublications\nVilas, V., Das, A.P., Philip, D. (2022). Essential Oil-Mediated Synthesis of Metal and Metal Oxide Nanoparticles. In: Baskar, C., Ramakrishna, S., Daniela La Rosa, A. (eds) Encyclopedia of Green Materials. Springer, Singapore. https://doi.org/10.1007/978-981- 16-4921-9_3-1.\nPresented a paper titled ‘Synthesis, spectral characterization, molecular docking and MTT assay studies of Embelin derivatives as anticancer agents’ in the International seminar on ‘Recent Trends in Interdisciplinary Science’ organized by Dept of Chemistry, The Standard Fireworks Rajaratnam College for Women, Sivakasi on 20-9-2019.\nShiny P.L., Annette F., Rema D.V.K., Vishnu V.S., Arun K.B., Kavitha R.P.K., Archana P.D., Evaluation of In silico and In vitro pharmacological activities of 1,3,8-trihydroxyanthraquinone, International journal of research and reviews in pharmacy and applied science., 5(1), 2015, 1173-1188.\nShiny, P.L., Annette, F., Arun, K., Vishnu, V.S., Rema, D.K., Archana, P.D., Thomas, O., Synthesis, Single Crystal Study, in silico Analysis, in vitro Anti-inflammatory and Anticancer Activities of 7-hydroxy-14H-naphtho[2,3- a]phenothiazine-8,13-dione, Drug Delivery Letters, 5(2), 2015, 140-150.\nArchana, P.Das., Annette, F., Arunkumar, B., Shiny, P.L., In silico screening and molecular docking studies of embelin and its derivatives as potent anti cancer agents-A green chemistry approach, International Journal of Emerging Research Trends in Engineering and Technology, 2(4), 2015,632-637.\nArchana P. Das, Dr. Annette Fernandez, Arun Kumar B, “Embelin derivative as anticancer agent for breast cancer- in silico screening and docking studies” International Journal of Emerging Research Trends in Engineering and Technology, -Vol-II , Pages: 136 – 139,  February 2016.\nArchana P. Das, Annette Fernandez, B. Arunkumar , Shiny P. Laila, V.S. Vishnu and B.N. Bessy Raj, “Synthesis, characterization, in silico and in vitro studies of an amino derivative of embelin as potent anticancer agent against human breast cancer cell line MCF-7”, International Journal of Research and Reviews in Pharmacy and Applied sciences, Vol.7 Issue.1, 1426-1437, 2017.\nSeminar\nParticipated in the seminar on ‘150 yrs of the Periodic Table of Elements and Advances in Hyphenated Chromatographic Techniques’ organised jointly by the Indian Society of Analytical Scientists, Chromatographic Society of India and Dept. of Chemistry, Mar Ivanios College on 18-9-2019.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\nAssociated with NSS wing of the college\nAwards / Distinctions / Rank / Other Achievements if any\nPresented a paper and received the best paper award in the Two Day National Seminar on NMR Spectroscopy, jointly organised by MRSK and MA College (Autonomous), Kothamangalam (Oct 20-21,2023).\nAwarded third prize for oral presentation titled ‘An amino derivative of Embelin as potent anticancer agent against human breast cancer cell line MCF-7’ in the International Seminar on ‘Tracing the new strides: Vignettes of frontline Chemistry’ organized by Department of Chemistry, University College, Thiruvananthapuram supported by Department of Collegiate Education, Govt. of Kerala on 7-11-2019 and 8-11-2019\nEmployee Code / ID No.\n10715030\nQualifications\nM.Phil,\nM.Sc\nOrcid ID\nIndustry / R & D Experience\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n700\nAreas of Interest / Current Research\nLinear algebra\nResearch, Consultancy, Publication\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nAcademic / Professional Outreach Activities\nGuest lectures in various colleges, Resource Person in various FDPs\nMembership in Professional bodies/ organizations\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\n2nd prize in AICTE-Srinivas Ramanujan Mathematical Contest, 2013\nEmployee Code / ID No.\n10710012\nQualifications\nMA, PGDTE, Ph.D\nOrcid ID\nIndustry / R & D Experience\nEmail ID\n[email protected]\nAlternate E-mail ID\nMobile No (Optional) / Intercom Extension No.\n704\nAreas of Interest / Current Research\nDrama, Ppetry and Creative Writing (Malayam & English)\nResearch, Consultancy, Publication\nConsultancy for NAAC Accreditation Work, Publications: Malayalam- I. Three short story Collections\nII. Five Novels\nIII. Greek Mythology Retold for Children (5 Vols.)\nIV. Children’s Stories (5 titles)\nV. Dhyanam Billiioode (Translation of the 8 vol.series ‘Pray with Bible- by Msgr. Noel Quesson) (all in Malayalam)EnglishVI. A Paleolithic Mask (Collection of English Poems published by Writer’s Workshop, Calcutta)\nVII. Poems included in the Anthologies:\na) Poetry India: Voices in the Making\nb) Wander Lust I & II\nVIII. Mystic Theology of Osuna & Yoga Philosophy\nIX. Mysticism of St. Teresa of Avila and Yoga (English)\nX. Vortices of Broken Images (English Poems)\nXI. Song of Solomen, Gita Govinda and Spiritual Article: An Indian Reading\nXII. Lord’s Prayer: An Indian Reading\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nAcademic / Professional Outreach Activities\nMembership in Professional bodies/ organizations\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nWon Award for the Best Novel in Malayalam Titled ‘Uthpavanam’\nEmployee Code / ID No.\n10711014\nQualifications\nMsc, M Phill Physics\nOrcid ID\nIndustry / R & D Experience\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9447025246\nAreas of Interest / Current Research\nCrystallography\nResearch, Consultancy, Publication\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nAcademic / Professional Outreach Activities\nMembership in Professional bodies/ organizations\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nEmployee Code / ID No.\n10706008\nQualifications\nMSC,Mphil,Bed, SET\nOrcid ID\nIndustry / R & D Experience\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n137\nAreas of Interest / Current Research\nGraph Theory\nResearch,  Consultancy, Publication\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nAcademic / Professional Outreach Activities\nMembership in Professional bodies/ organizations\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nEmployee Code / ID No.\n10712016\nQualifications\nM. Sc, M.Phil, B.Ed, Ph. D (Submitted)\nOrcid ID\n0000-0003-3174-4179\nIndustry / R & D Experience\n2 years 5 months\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n703\nAreas of Interest / Current Research\nFUZZY DECISION MAKING\nResearch,  Consultancy, Publication\nPublications-\nParticipated in TLC workshop conducted by Mar Baselios College of Engineering and Technology on November 29,2024.\nParticipated in a Five day FDP on ‘ Cutting – Edge Research and Emerging Trends in Mathematics 2025’ organized by VIT, Chennai from January 27 -31,2025.\nAttended a Six Days FDP on AI Applications in Modern Research: A Hands-on Approach” organized by Mar Baselios College of Engineering & Technology, Trivandrum from 17- 22 February 2025.\nAttended a One week online workshop on’ SAGEMATH for Mathematicians: Unlocking Advanced Computation’ organized by Indian Mathematics Professors Association (INMPA) & Infinity Research and Development Institute from March 3-7, 2025.\n5\n. Attended a Workshop on ‘Mathematical Techniques for Time Dependent Water Wave Problems’ organized by VIT, Chennai from March 24-25 ,2025\nA LITERATURE SURVEY ON FUZZY MULTI-CRITERIA DECISION-MAKING METHODS, INTERNATIONAL JOURNAL OF MECHANICAL ENGINEERING,Vol.7 , No.1 Pages: 3341-3344, ISSN: 0974-5823, IF- 2.1, January 2022.\nPERFORMANCE EVALUATION OF STUDENTS-A DECISION-MAKING STRATEGY BASED ON FUZZY TOPSIS METHOD, ADVANCES & APPLICATIONS IN MATHEMATICAL SCIENCES,Vol.21, Issue 8 Pages: 4273-4288, ISSN: 0974-6803, IF-0.22, June 2022.\nA REVIEW ON FUZZY MULTICRITERIA DECISION-MAKING METHODS IN MEDICAL DIAGNOSIS, INTERNATIONAL JOURNAL OF HEALTH SCIENCES,  Vol.6(S5), Pages: 2546—2554, ISSN: 2550-6978, IF-2.96, https://doi.org/10.53730/ijhs.v6nS5.9198, June  2022.\nA NEW FUZZY MODELLING APPROACH F-NoVaRM FOR PERFORMANCE EVALUATION OF MATHEMATICS POST -GRADUATE STUDENTS, EUROPEAN CHEMICAL BULLETIN, Vol.12, no. 3, Pages: 971-982, https://www.eurchembull.com/uploads/paper/fe7676beb0cb107b957ef6f1f5763393.pdf, ISSN: 2063-5346,IF-3.71 , 2023.\nFUZZY NoVaRM APPROACH TO MEDICAL DIAGNOSIS VIA ANALYZING THE RISK FACTORS OF TUBERCULOSIS, EUROPEAN CHEMICAL BULLETIN, Vol.12, No. 6, Pages: 7566-7575, ISSN: 2063-5346, IF-3.71, 2023.\nAN EXTENDED APPLICATION OF FUZZY COMPLEX PROPORTIONAL ASSESSMENT DECISION MAKING APPROACH TO DIAGNOSE VECTOR-BORNE DISEASES, JOURNAL OF PROPULSION TECHNOLOGY, Vol.44, No. 3, Pages: 150-155, ISSN: 1001-4055, IF-0.293, 2023.\nPROCEEDINGS-\nA FUZZY DECISION-MAKING MODEL BASED ON F-MARCOS METHOD TO DETECT VECTOR-BORNE DISEASES,  Page :199-204 ISBN 978-93-91347-00-0, May 5-7 2022, International Conference on Mathematical Science and Its Recent Advancements organized by Rathinam College of Arts and Science, Coimbatore.\nA FUZZY DECISION-MAKING MODEL BASED ON MODIFIED FUZZY VALUE-BASED RANKING METHOD TO DETECT VECTOR-BORNE DISEASES,Page:49, ISBN 978-93-90146-32-1, May 19-21 2022, International Conference on Advances in Mathematics & Computer Engineering 2022 organized by Nesamony Memorial Christian College, Marthandam.\nA COMPARATIVE STUDY OF F- MARCOS AND F-COPRAS METHODS TO DIAGNOSE VECTOR-BORNE DISEASES, ISBN 978-81-908388-7-0, Page: 105-113, March 3,2023, National Conference on Advances In Graph Theory Organized by Malankara catholic College, Kaliakkavilai.\nAN EXTENDED APPLICATION OF FUZZY COPRAS DECISION-MAKING MODEL IN MEDICAL DIAGNOSIS, Page: 29 ,March 8-10, 2023, National Conference on Applied Mathematics and Numerics Organized by Mar Ivanios College & Indian Institute of Space Science and Technology, Trivandrum.\nEmpowerment of women in Tamil Nadu based on Fuzzy COPRAS Decision-Making Method, ISBN: 978-93-94510-18-0, Page: 100-106, September 22, 2023, National Conference on Advances in Pure & Applied Mathematics organized by Malankara Catholic College, Kaliakkavilai.\nPAPER PRESENTATIONS\nPresented a paper titled ‘A Literature Survey on Fuzzy Multicriteria Decision- Making Methods’ in the 2nd International Conference on Social Science, Management and Technology in    Covid Era on 19th December 2021.\nPresented a paper titled ‘A Study on The Application of Fuzzy Sets and Fuzzy Decision -Making Methods in Medical Diagnosis’ in the International Conference on Recent Trends in Theoretical and Computational Mathematics on February 25, 2022 organized by PSGR Krishnammal College for Women.\nPresented a paper titled ‘Performance Evaluation of Students- A Decision-making Strategy Based on Fuzzy TOPSIS Method’ during March 3-4, 2022 organized by Loyola College, Chennai.\nPresented a paper titled ‘A Fuzzy Decision-Making Model Based On F-Marcos Method to Diagnose Vector-Borne Diseases’ in the International Conference on Mathematical Science and Its Recent Advancements on May 6,2022 organized by Rathinam College of Arts & Science, Coimbatore, Tamil Nadu.\nPresented a paper titled ‘A Fuzzy Decision-Making Model Based on A Modified Fuzzy Value Based Ranking Method to Diagnose Vector Borne Diseases’ in the International Conference on Advances in Mathematics &Computer Engineering during May 19-21, 2022 organized by Nesamony Memorial Christian College, Marthandam, Tamil Nadu.\nPresented a paper titled ‘A Fuzzy COPRAS Decision-Making Model to Diagnose Vector-Borne Diseases’ at the Two -Day International Conference on Applied Mathematical Sciences held during December 21-22, 2022 organized by J.J College of Arts and Science, Pudukkottai, Tamil Nadu.\nPresented a paper titled ‘A fuzzy NoVaRM Vaccine Selection Decision making Model for COVID-19-A Case Study in India’ at the International Conference on Recent Trends in Applied Mathematics held during February 24-25, 2023 organized by Loyola College, Chennai.\nPresented a paper titled ‘A Comparative Study Of F- MARCOS and F-COPRAS Methods To Diagnose Vector-Borne Diseases’ at the National Conference on Advances in Graph Theory on March 3, 2023 organized by Malankara Catholic College, Kaliakkavilai, Tamil Nadu.\nPresented a paper titled ‘An Extended Application of Fuzzy COPRAS Decision-Making Model in Medical Diagnosis’ at the National Conference on Applied Mathematics and Numerics held during March 8-10, 2023 Organized by Mar Ivanios College & Indian Institute of Space Science and Technology, Trivandrum.\nPresented a paper entitled ‘Empowerment of Women in Tamil Nadu Based on Fuzzy COPRAS Decision-Making Method’ at the National Conference on Advances in Pure and Applied Mathematics held on September 22, 2023 organized by Malankara Catholic College, Mariagiri, Kaliakkavilai, Tamil Nadu.\nPresented a paper entitled ‘Empowerment of Women in Tamil Nadu Based on Fuzzy Normalized Value Based Ranking Method’ at the 2nd International Conference on Mathematics and Applied Science held on December 16, 2023 organized by Indian Academicians and Researchers Association.\nPresented a paper entitled ‘A Dam Rehabilitation Model Based on Fuzzy Value Based Ranking Method- A Case Study – Neyyar Gravity Dam, India at the International Conference on Recent Trends in Applied Mathematics held during February 22-23, 2024 organized by Loyola College, Chennai.\nCONFERENCES/FDPS/WORKSHOPS/SEMINARS/WEBINARS ATTENDED\nWebinar on ‘Introduction to Grobner Basis’, St.Berchmans College,Changanassery, July11,2020.\nThree Day FDP on ‘Outcome Based Education in Higher Education Sector’,      Mar Baselios Institute of Technology &Science, and Amal Jyothi College of Engineering, Kottyam, July 23-25,2020.\nNational Webinar on ‘Modelling the Invisible Mathematics’  St. Aloysius College, Alappuzha July25, 2020.\nWorkshop on ‘Effective Online Teaching Tools’   Teaching & Learning Centre and Mar Baselios College of Engineering and Technology, Trivandrum. July29-31,2020.\nNational Webinar on’ Fuzzy Modelling and Decision Making Applications’ ISTE Saintgits College of Engineering August 1,2020\nWebinar on ‘Recent Trends in Fuzzy Modeling Applications and Recent Trends in the Real World’   Institute of Technical and Scientific Research  August 2,2020\nThree day International Conference on ‘ Productive Mathematical Discourse’ Christ Nagar College,Maranalloor,Trivandrum August3-5,2020\nInternational Webinar series on ‘Advances in the Mathematical Modeling  of  infectious Diseases’  Mar Ivanios College, Trivandrum.   August 6-7 2020\nInternational Conference on ‘Graph Connections’ Bishop Chulaparambil Memorial College in association with MG University, Kottayam.  August 6-8,2020\nNational webinar on ‘Technology Adoption in Mathematics classroom-A Welcome change’ Alagappa University College of Teacher Education,Alagappa University, Karaikkudi  August 8,2020\nFive Day online FDP on”Mathematics in Engineering Research’  Sree Buddha College of Engineering, Alappuzha.  August 10-14,2020\nOne week FDP on ‘ Application &Implements of Mathematics’ Hindusthan College of Engineering and Technology,Coimbatore.   August17-23,2020\nNational Level Webinar on ‘ ISTEM- A Gateway for Researchers Stepping Towards Aatma Nirbhar Bharat’  Dr.MGR Educational and Research Institute, Chennai August 25 2020.\nNational webinar on  ‘Graph theory & problem solving using sage  math, ‘S.D College , Alappuzha, November 4,5,6 2020.\nWebinar on ‘NATIONAL EDUCATIONAL POLICY” TLC,MBCET,TVM 23 MARCH2020.\nWorkshop On Role Of Science &Humanities Department In An Engineering College,         Mbcet, Tvm November 27,2020.\n31st    Annual State Faculty Convention Of Iste Kerala Section, MBCET, TVM,   JANUARY 23,2021.\nThree day Faculty Development Programme ‘Mathematical Foundations For  Artificial Intelligence and Machine Learning’ Muthoot Institute Of Technology and Science, Varikoli, June 23-25.2021.\nWebinar  on ‘Bloch’s Constant’ St.Berchman’s College, Changanassery,       July 10,2021.\nINTERNATIONAL FACULTY DEVELOPMENT PROGRAMME (FDP) ON ‘THE ART OF DOING RESEARCH’, Jyothi Engineering College ,Thrissur,Christ(Deemed to be university, Bangalore, Pelita Bangsa University, Indonesia    ,    July 12-22,2021.\nWebinar Series on” An Invitation to the Rogers-Ramanujan Identities     ,   S.B College, Changanassery  ,  August 7,2021.\nThirty Hour FDP On Mathematics in Machine Learning, CET, Trivandrum, June30-July16,2021.\nINTERNATIONAL SEMINAR ON RECENT TRENDS IN MATHEMATICS &ITS APPLICATIONS RECENT TRENDS IN MATHEMATICS &ITS APPLICATIONS   ,     St. Jude’s College,Thoothoor,Tamilnadu   ,     October 16,2021.\n6 DAYS INTERNATIONAL FDP ON RECENT RESEARCH ADVANCES IN MATHEMATICS  ,      St.Joseph’s College, Chennai ,Tamilnadu     ,   October 4-9,2021.\n5 day online workshop on Academic Writing     ,    Mar Baselios College of Engineering & Technology, Trivandrum ,      November1-6,2021.\nInternational Webinar on Foundations for Contemporary Mathematical Research,   Manipur University,Canchipur,Imphal   ,     November 8-10,2021.\nOne day National Webinar on Applied Mathematics    ,    Malankara Catholic College , Mariagiri, Kaliakkavilai  ,      November 12,2021.\nTwo day National Webinar on Linear Algebra & its Applications  ,      Federal Institute of Science & Technology   ,    November 19&20,2021.\n2ND INTERNATIONAL CONFERENCE ON SOCIAL SCIENCE ,MANAGEMENT & TECHNOLOGY IN COVID ERA, Institute for scientific research and development, Montenegro, December19,2021.\nNATIONAL WORKSHOP ON MATHEMATICAL INSIGHTS-BIOLOGICAL PROBLEMS   , SRI SARADA COLLEGE FOR WOMEN, SALEM    , February 23,2022.\nINTERNATIONAL CONFERENCE ON RECENT TRENDS IN THEORETICAL AND COMPUTATIONAL  MATHEMATICS    ,    PSGR KRISHNAMMAL COLLEGE FOR WOMEN,COIMBATORE        February 24-25, 2022.\nINTERNATIONAL CONFERENCE ON RECENT TRENDS IN APPLIED MATHEMATICS,        LOYOLA COLLEGE,CHENNAI, March 3-4, 2022.\nMultidisciplinary National Seminar on  ‘Bio-Mathematics’        , Sri Sarada College For Women,Salem,     March 11, 2022.\nInternational Webinar on Recent Trends in Pure and Applied Mathematics, Syed Ammal Arts and Science College,Tamilnadu   ,     March 24-26,2022.\nInternational Conference on Mathematical Science and Its Recent Advancements,        Rathinam College of Arts and Science, Coimbatore,       May 5-7,2022.\nInternational Conference on Advances In Mathematics & Computer Engineering 2022        ,Nesamony Memorial Christian College, Marthandam,   May 19-21, 2022.\n2nd International Conference on Global Issues in Multidisciplinary Academic Research,        Rajbhat Mahasarakham University, Thailand,      June 5,2022.\nInternational Conference on Mathematical Analysis & Applications,        University of Kalyani, India,      June 28-29,2022\nFDP on Conformal Mapping in Complex Analysis,  SRM Institute of Science and Technology, Chennai,      September 21,2022.\nInternational Conference on Recent Advancements in the Areas of Science, Technology, Business, Economics, Management, Social Sciences, Humanities and Travel Tourism,   IARA, Tailand, December 9,2022.\nWebinar on ‘How to Write a Book and Get it Published as an Author’, Indian Academicians and Research Association.        December 11, 2022.\n16 th International Conference on Mathematical Sciences for Advancement of Science and Technology,        IMBIC, Kolkata, India,      December 21-23,2022.\nA Two Day International Conference on Applied Mathematical Sciences-ICAMS 2022,  J.J College of Arts and Science, Pudukkottai,Tamil nadu,December 21-22, 2022.\nNational Conference on Computational Mathematics, National Institute of Technology, Pondicherry, Karaikal,        December 22-23, 2022.\nInternational E-Conference of Young Researchers in Algebra and Number Theory-2023,        Faculty of Sciences Dhar EL Mahras, Fez, Morocco     ,   January 12-13, 2023.\nInternational Conference on Research Trends in Contemporary Mathematics,        Patrician College of Arts & Science, Chennai,       February 3-4, 2023.\nInternational Conference on Recent Trends in Applied Mathematics,        Loyola College, Chennai  ,      February 24-25, 2023.\nNational Webinar from Mathmania to Cryptomania  ,        February 24, 2023.\nNational Conference on Advances in Graph Theory,        Malankara Catholic College, Kaliakkavilai, Tamil Nadu, March 3, 2023.\nNational Conference on Applied Mathematics and Numerics ,   Mar Ivanios College & Indian Institute of Space Science and Technology, Trivandrum, March 8-10, 2023.\nInternational Webinar on Advances in Mathematical Sciences,        West Bengal State University, Kolkata,      March 30-31, 2023.\n5 days FDP on Numerical Techniques for Real World Problems, VIT, Chennai,  June 3-7, 2023.\nInternational Conference on Modelling, Simulation & Optimization of Energy Systems        ,Canadian University Dubai, UAE,     June 17-18, 2023.\nA 5 Day Online FDP on Mathematical Modelling in Biological System, VIT, Chennai,        June 19-23, 2023.\nNational Conference on Recent Trends in Mathematical Biology- Theory, Methods & Applications , Sri Sathya Sai Institute of Higher Learning, Andhra Pradesh , July 20-22, 2023.\n7-Day FDP on Mathematical Modelling & Computation in Engineering,        SRM Institute of Science & Technology, Delhi, Uttar Pradesh.        July 24-30, 2023.\nNational Conference on Advances in Pure and Applied Mathematics,         Malankara Catholic College, Mariagiri, Kaliakkavilai,       September 22, 2023.\n2nd International Conference on Mathematics and Applied Science         , Indian Academicians and Researchers Association, December 16, 2023.\nInternational Workshop on Advancements in Graph Theory,        Vellore Institute of Technology, Chennai,        February1-2, 2024.\nInternational Conference on Recent Trends in Applied Mathematics, Loyola College, Chennai,        February 22-23, 2024.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\n—–\nMembership in Professional bodies/ organizations\nRotary Club of Trivandrum Suburban\nCommunity Outreach Activities\nProvide humanitarian services through rotary activities.\nAwards / Distinctions / Rank / Other Achievements if any\nQualified KTU Ph. D Entrance examination in the year 2021.\nQualified Manonmaniam Sundaranar University Ph. D Entrance examination in the year 2021.\nSelected as the best Rotary Ann in the year 2020.\nEmployee Code / ID No.\n10713021\nQualifications\nM.Sc, M.Phil, B.Ed in Mathematics(Pursuing Ph.D)\nOrcid ID\n—-\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9946699226, Intercom:\nAreas of Interest / Current Research\nSpectral Graph Theory\nResearch,  Consultancy, Publication\nFDPs & Conferences attended:\nParticipated in the International Webinar on Applied Mathematics organized by the PG& Research Department of Mathematics, Thiagarajar College, Madurai on 19th to 20 th April 2022.\nParticipated in the Three Days International Level Workshop on Research Methodology Paradigms -SPECTRUM 2022 organized by the Research & Development Cell, St. Francis College, during 11th to 13th April 2022.\nParticipated in the National Webinar on Statistics in Research Data Analysis organized by the Department of Mathematics, Noorul Islam Centre for Higher Education, Kumaracoil on 28th June 2021.\nParticipated in online workshop on Recent Trends in Domination and Graph Labelling (RTDGL 2021) organized by Department of Mathematics, Ramanujan College, University of Delhi in collaboration with Academy of Discrete Mathematics and Applications (ADMA) during 27th to 31st May 2021.\nParticipated in the workshop, Role of Science and Humanities Department in Engineering College, organized by the Department of Science and Humanities of the college on 27th November 2020\nParticipated in the National Webinar on Graph Theory & Problem-Solving Using Sage Math organized by the PG & Research Department of Mathematics, SD College, Alappuzha on 4th to 6th November 2020.\nParticipated in National Level Webinar On “I-STEM: A Gateway for Researchers Stepping Towards AatmNirbhar Bharat organized by Dr. M.G.R Educational and Research Institute, Adayalampattu Phase -II Campus on August 25th, 2020.\nParticipated in National Webinar on ‘Modelling the Invisible Mathematics‘ organized by St. Aloysius College, Edathua on August 25th 2020.\nParticipated in National Webinar on ‘The Curious Case of Cyber Security’ organized by St. Aloysius College, Edathua on August 22nd, 2020.\nParticipated in Two-Day National Level E-Workshop on Performing Statistical Data Analysis Using Ms Excel organized by Dr. M.G.R Educational and Research Institute, Adayalampattu Phase -II Campus from August 18th to 19th , 2020.\nParticipated in FDP on Mathematics for Engineering Research organized by Sree Buddha College of Engineering, Pattoor, Alappuzha from August 10th to 14th , 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modelling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6th to 7th , 2020.\nParticipated in International webinar on Statistics organized by Carmel College, Mala from July 27th to 28th ,2020.\nParticipated in Faculty Development Programme on Outcome Based Education in Higher Education Sector organized by Mar Baselios Institute of Technology & Science& Amal Jyothi College of Engineering from July 23rd to 25th ,2020.\nParticipated in Berchmans Webinar Series in Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11th , 2020.\nParticipated in Three-Day International Conference on Productive Mathematical Discourse organized by Christ Nagar College, Maranalloor, Thiruvananthapuram from August 3-5, 2020.\nParticipated in Five Day FDP on “Engineering Next-Gen Materials”  organized by  the Department of Science and Humanities, Mar Baselios College of Engineering & Technology, Thiruvananthapuram from June 18-22, 2024.\nParticipated in Five Day FDP on “Algebraic Structures” organized by the Research Department of Mathematics, Nesamony Memorial Christian College, Marthandam from December 16-20, 2024.\nParticipated in two days International Conference  on “Algebraic Graph Theory, Graph Theory and Topology” organized by the Research Department of Mathematics, Nesamony Memorial Christian College, Marthandam from January 09-10, 2025.\nParticipated in Three Day FDP on “Mentoring Matters: Strategies for Effective Academic Counselling ” organized by the Department of Science and Humanities, Mar Baselios College of Engineering & Technology, Thiruvananthapuram from December 19-21, 2025.\nPaper presentations:\nPresented a paper titled “The Laplacian Energy of Divisor Graphs” in the  International Conference on AI – Powered Approaches to Graph Theory ans Applications (INAIGA-2025) on 28 May 2025.\nPresented a paper titled “Zero Divisor Graphs of Commutative Rings: Computation on Edge-Based Topological Indices and Energy” at the International Conference of Networking and Computer Application (ICNCA 2023),  NICHE  on 5th May 2023.\nPresented a paper titled “Energy of Divisor Graph” in the 2nd International Conference on Advanced Information Science and Computing Systems (ICAISCS) organized by the Department of Computer Science and Applications, Christ Nagar College, Maranallor, Trivandrum on 28 January 2023.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\n—–\nMembership in Professional bodies/ organizations\n—–\nCommunity Outreach Activities\n—–\nAwards / Distinctions / Rank / Other Achievements if any\nGot selected for Ph.D in Mathematics at Noorul Islam Centre for Higher Education, Kumaracoil, Tamil Nadu\nEmployee Code / ID No.\n10712020\nQualifications\nMSc, B.Ed, Ph.D, SET, NET\nOrcid ID\n0009-0004-6788-9593\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9846992262    Ext:- 703\nAreas of Interest / Current Research\nMaterial Science, Nanoceramics\nResearch,  Consultancy, Publication\nPublications\nLakshmi J S, Rajesh S, E K Suresh, Rafael A Raimundo, Rini Varghese, Steffy Maria Jose, J K Thomas, Low-temperature sintering of Zn2-xCuxV2O7 (X=0~2) nanoceramics as an LTCC material, synthesized through combustion route, and a study on the influence of copper in their structural and dielectric behavior, Ceram. Int., 2023, DOI:10.1016/j.ceramint.2023.12.118, ISSN: 0272-8842\nRini Varghese, Steffy Maria Jose, Lakshmi J S, Abraham A, J K Thomas, Enhanced optical, electrical, dielectric, and photovoltaic properties in strontium titanate by Ce-doping through a modified combustion method, J. Integr. Sci. Technol., 12 [4] (2024) 781, DOI: 10.62110/sciencein.jist.2024.v12.781 , ISSN: 2321-4635\nRini Varghese, Steffy Maria Jose, Lakshmi J S, J K Thomas, Investigation of the structural, optical, electrical, and photovoltaic characteristics of nanostructured Ce-doped BaTiO3 by a modified combustion method, Opt. Quant. Electron., 56 [1] (2024), DOI: 10.1007/s11082-023-05686-9, ISSN: 1572-817X\nSteffy Maria Jose, C T Mathew, Y.V Swapna, J S Lakshmi, J K Thomas, Synthesis of Ultrafine Nanopowder of Y2O3-ZnO composite by a modified combustion method for their application as infrared transparent ceramic materials, in: Emerging Trends in Advanced Spectroscopy, River Publishers, 2022. DOI: 10.1201/9781003338093-16 (Book chapter)\nY V Swapna, C T Mathew, J K Thomas, J S Lakshmi, Steffy Maria Jose, Synthesis and Characterization of Hydroxyapatite Nanoparticles Using a Novel Combustion Technique for Bone Tissue Engineering, in: Emerging Trends in Advanced Spectroscopy, River Publishers, 2022. DOI: 10.1201/9781003338093-20. (Book Chapter)\nConferences\nPresented a paper “Structural and morphological studies of LaVO4 nanoceramics for LTCC applications” in the National Seminar on Modern Trends In Physics Research at St. Stephen’s College, Pathanapuram on 16th and 17th December 2024.\nPresented a paper “Synthesis and characterization of Zn2-xCuxV2O7 (x=0~2) nanostructured ceramics for LTCC applications” in the International Conference on Nanotechnology and Materials Science at Mar Ivanios College, Thiruvananthapuram on 18th and 19th December 2023.\nPresented a paper “Structural and electrical studies of CeVO4 nanoceramics for LTCC applications” in the National Conference on Advanced Functional Materials -2023 at VTMNSS College, Dhanuvachapuram on 23rd and 24th March 2023.\nPresented a paper “Single step combustion, synthesis and characterisation of CeVO4 nanoceramics for LTCC applications” in the International Conference on Materials Science at Bharata Mata College, Thrikkakkara on 9th and 10th January 2023.\nPresented a poster on Preparation and Characterization of Low Temperature Sintering of  Vanadium pentoxide nanoparticles for LTCC Applications  at ICMS held on December 2017 at MG University , Kottayam.\nFDP/ Conferences  attended:\nAttended a three-day FDP on ‘Mentoring Matters: Strategies for Effective Academic Counselling’ organized by the department of Science and Humanities, from 19-21 May 2025\nAttended a nine-hour workshop on pedagogy organised by TLC, MBCET in collaboration with at Theophilus Training College.\nAttended a six day international FDP on ‘Innovation, IP Management & Industry Connect’ organised by Innovation and Entrepreneurship Development Cell St. Thomas College of Engineering & Technology, Chengannur from 20-25 January 2025.\nParticipated in the one day Teachers’ Workshop as part of World Space Week 2024 Celebrations held at Liquid Propulsion Systems Centre (LPSC) and Indian Institute of Space Science & Technology (IIST), Valiamala, Thiruvananthapuram on October 07, 2024.\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\nParticipated and successfully completed the 5-day online FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022.\nParticipated in 5-day workshop on ‘Academic Writing’ from November 1-November 6, 2021.\nParticipated in Talk on Recent trends in Raman spectroscopy organized by Department of Physics, University of Kerala on July 15, 2020.\nParticipated in Webinar on “Evading Social Engineering Attacks: COVID’19 ” organized by NetSec Research Group, Department of Computer Science and Engineering, Mar Baselios College of Engineering and Technology on July 21, 2020.\nParticipated in International webinar-CROSSROADS 2020 organized by PG and Research Department of Physics, SN College, Kollam on 22 July 2020\nParticipated in Webinar on Astronomy and Astrophysics organized by Department of Physics, Mar Ivanios College on 25 July 2020.\nParticipated in FDP on Outcome Based Education in Higher Education Sector organized by MBITS & AJCE from 23-25 August 2020.\nParticipated in Lecture on Emerging Solar Cell Technologies organized by Bishop Moore College on July 28, 2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Short term FDP on “Pedagogical And E-Learning Tools For Teaching organized by SD College & The Kerala State Higher Education Council from 4-10 August 2020\nParticipated in National Webinar on Next Generation Challenges in Astro technology organized by Department of Basic Sciences and Humanities, RSET on August 12, 2020.\nParticipated in National Webinar on “Silicon to Systems – How the world has transformed after the transistor” jointly organized by Department of Physics and Internal Quality Assurance Cell of All Saints’ College on August 15,2020.\nParticipated in FDP (Interdisciplinary) on Towards a Digital Era of Teaching and Learning organized by UGC-HRDC, University of Kerala in collaboration with KSMDB College, Sasthamcotta from August 12-18, 2020.\nParticipated in FDP on “How to write a research paper/Book chapter for Scopus Publication organized by Department of management Studies, New Horizon College of Engineering on September 4, 2020.\nParticipated in the workshop, Role of Science and Humanities Department in an Engineering College, organised by Department of Science & Humanities on November 17, 2020.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\nJudged the Science exhibition- Sarvo Techtopia 2024-2025 held at Sarvodaya Vidyalaya on October 22.\nCoordinated an invited lecture on ‘Linear Algebra in Machine Learning Applications” was organized by the Department of Science and humanities for the first year students of Computer Science on November 13, 2024. The speaker for the session was Dr. K.Satheesh Kumar, Visiting Professor, Digital University.\nParticipated as a judge at Sarvo Techtopia – Science exhibition 2024-2025 held at Sarvodaya Vidyalaya on 22 October 2024.\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}