{
    "filename": "mbcet.ac.in_faculty_dr-amal-raj_.html",
    "content": "Dr. Amal Raj – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nCivil Engineering\n>\nDr. Amal Raj\nEmployee Code / ID No.\n10122098\nQualifications\nM.Tech Transportation Engineering, PhD\nOrcid ID\nhttps://orcid.org/0000-0002-9550-031X\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n7736606107\nAreas of Interest / Current Research\nPavement material characterisation, cold bituminous mixes, microstructural and rheological characterisation of binders and mastics, sustainable construction materials\nResearch, Consultancy, Publication\n1.       Amal, R., M. Sivakumar & M.V.L.R. Anjaneyulu (2022), “Investigation of Curing and Strength Characteristics of Cold Mix Asphalt with Rice Husk Ash Activated Fillers”, Journal of Transportation Engineering, Part B: Pavements, American Society of Civil Engineers, ASCE. https://doi.org/10.1061/JPEODX.0000408\n2. Vimal,C., R. Amal, M. Sivakumar, and M.V.L.R. Anjaneyulu (2022), “Use of Nano-lime Extracted from Egg Shell in Cold Bituminous Mix”, International Conference on New Technologies and Innovations in Rural Roads, May 24-26, 2022, New Delhi\n3. Amal, R., J. Narendra, M. Sivakumar, and M.V.L.R. Anjaneyulu (2021), “Performance Evaluation of Cold Bituminous Mix Reinforced with Coir Fibre”, Proceedings of International Web Conference in Civil Engineering for a Sustainable Planet, ICCESP-2021(In collaboration with ASCE), March 5 and 6 March 5-6, 2021. AJIR Books, https://doi.org/10.21467/proceedings.112.67\n4. Anand, K., R. Amal, M. Sivakumar, and M.V.L.R. Anjaneyulu (2018), “Effect of Aggregate Gradation and Size on Cold Bituminous Mix Performance”, Proceedings of the 5th Colloquium on Transportation Systems Engineering and Management (CTSEM 2018), NIT Warangal\n5. Abhinag, R. Amal and M.V.L.R. Anjaneyulu (2018), “Study on Moisture Susceptibility of Cold Bituminous Mixture”, Shaastra Research Conference (SRC-2018), IIT-Madras\n6. Amal, R, K. Pradeep and K. Sitaramanjaneyulu (2017), “Development of Correlation between Roughness Index and International Roughness Index for Indian Condition”, Indian Highways, Indian Roads Congress, New Delhi\n7. Prince, T, R.K. Garg and R. Amal (2016), “Vibration-Based Health Monitoring and Damage Detection of Steel Beam”, Structural Engineering Convention (SEC-2016), CSIR-SERC, Chennai\n8. Amal, R, V.T. Stephen and V. Sivabala (2012), “Potential use of Phosphogypsum in Concrete” National conference on Sustainability and innovations in Civil Engineering, TKM College of Engg., Kollam\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\nLife member in Indian Geotechnical Society, Delhi Chapter\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}