{
    "filename": "mbcet.ac.in_news-events_.html",
    "content": "News & Events – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nNews & Events\nNews & Events\nFebruary 17, 2025\nSmart Phone Addiction and Mental Health Challenges\nDr Shobha Teresa Panicker MBCET College student counselor and consultant Psychotherapist, gave an informative talk on 'Smart Phone Addiction and Mental Health Challenges' in All India Radio Air Malayalam on friday 14th February 2025.\nRead more\nFebruary 06, 2025\nConference ICAMeO 2025\nConference Website    https://www.icameo2025.com/\nRead more\nFebruary 05, 2025\nSIX-DAYS FDP on “AI Applications in Modern Research: A Hands-on Approach” (17-22 Feb 2025)\nIX-DAYS FDP on \"AI Applications in Modern Research: A Hands-on Approach\" (17-22 Feb 2025) We are delighted to invite you to a six-day Faculty Development Programme (FDP) on \"AI Applications in Modern Research: A Hands-on Approach,\" scheduled from 17 - 22 February 2025 in offline mode at Mar Baselios College...\nRead more\nNovember 06, 2024\nATAL One Week Faculty Development Programme\nfdpredited\nRead more\nJune 24, 2024\nInternational day of Yoga celebration at MBCET -21st June\nInternational day of Yoga celebration at MBCET -21st June [video width=\"720\" height=\"400\" mp4=\"https://mbcet.ac.in/wp-content/uploads/2024/06/VIDEO-2024-06-23-09-19-15.mp4\"][/video]\nRead more\nMarch 07, 2024\nCycle Rally\n*“Don't buy upgrades, ride up grades”* – Eddy Merckx.  As a part of _National Safety Week_, *NSS MBCET UNIT 230 and 706 and Department of Physical Education* is proudly presenting a *_Cycle Rally_* in collaboration with *Waste Management Cell MBCET* on _07th March 2024_ .Inaugurated by: *Smt. Veena George*, Minister of...\nRead more\nFebruary 26, 2024\nYoung Innovator Award\nRead more\nFebruary 21, 2024\nUpcoming International Conference ICID 2024\nICID 2024 Second International Conference on Infrastructure Development, Conducted by the Department of Civil Engineering MBCET, from September 25th to 27th, 2024 focuses on resilience, sustainability and transformation adaptation in infrastructure. It will be held at Mar Baselios College of Engineering and Technology (MBCET) in Thiruvananthapuram, Kerala. ICID 2024 aims...\nRead more\nDecember 21, 2023\nFDP on “LIDAR Applications in Advanced Surveying” on 8-12 January 2024\nFDP on “LIDAR Applications in Advanced Surveying\" Department of Civil Engineering, Mar Baselios College of Engineering and Technology, is conducting a Five day Faculty Development Programme on  “LIDAR Applications in Advanced Surveying\" from 8-12 January 2024. The link for registration is https://forms.gle/oAjWaeFvLV8DGx43A. Coordinators of the program are Ms. Akhila A.M,...\nRead more\nNovember 25, 2023\nIndian Geotechnical Society Students Chapter and the one day National Seminar.\nIndian Geotechnical Society Students Chapter and the one day National Seminar. Department of Civil Engineering, Mar Baselios College of Engineering and Technology, Trivandrum (MBCET) is pleased to invite you to the inauguration of IGS Students Chapter at MBCET and a One Day National Seminar on the topic \"Modern Geotechnical Engineering...\nRead more\nPage 1 of 14\n1\n2\n3\n4\n5\n...\n10\n...\n»\nLast »\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}