{
    "filename": "mbcet.ac.in_faculty_ms-sheenu-p_.html",
    "content": "Ms. Sheenu P. – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs. Sheenu P.\nEmployee Code / ID No.\n10307006\nQualifications\nM.Tech (Applied Electronics), Pursuing PhD\nOrcid ID\nhttps://orcid.org/0000-0002-9867-4606\nIndustry / R & D Experience\n1 year\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n403\nAreas of Interest / Current Research\nDigital Signal Processing\nResearch,  Consultancy, Publication\nMs. Evita Anilkumar, Ms. Sheenu P, “Solar powered pump with improved efficiency”, International Journal of Trend in Scientific Research and Development (IJTSRD), Volume-4, Issue-4, June 2020.\nMs. Ashwini Kammath, Ms. Sheenu P, “Comparative study of IPT Techniques for consumer electronics”, International Conference on Interdisciplinary Research 2020, July 2020.\nMs. Teena V S, Ms. Sheenu P, “Fault Detection Method for three level NPC Inverter based on DC Bus Electromagnetic Signatures”, Indian Journal of Applied Research, July 2019.\nMs. Anasooya Devan, Ms. Sheenu P, “Interactive Monitoring and Controlling System for A Conference Hall”, International Research Journal of Engineering & Technology(IRJET), July 2019.\nMs. Sheenu P, Dr. M J S Rangachar, “ Modelling & analysis of LF scatter from the sea using surface wave radars for tsunami signal detection” , International Journal of Electronics & Communication Engineering(IJECE), ISSN:2278-991X; vol.7,Issue 4, Jun-July 2018.\nAkashSasidharan, Ms.Sheenu P.,”Modelling and Control System Design of Launch Vehicle”, in the proceedings of International Conference on Energy Efficient Technologies for Sustainability (ICEETS) 2018.\nAkashSasidharan, Ms.Sheenu P, ”Dynamic modelling and control system design for Ascent Phase of Launch Vehicle”, in the proceedings of 3rd National conference on Future Technologies in Power, Control & Communication systems (NFTPCOS ’18).\nAkashSasidharan, Ms.Sheenu P., Analysis and Design of a Typical Launch Vehhicle”, in the proceedings of International Conference on Technology Innovation in Mechatronics, Energy Management and Intelligent Communication (ICTIMEMIC’18).\nKannan P S, Ms.Sheenu P, “PID Control of Twin Rotor Mimo System”, International Journal of Advanced Research In Basic Engineering Sciences And Technology, IJARBEST, Volume 2, Special Issue 23, April 2017.\nKannan P S,Ms.Sheenu P, “Advanced Control of Twin Rotor Mimo System”, International Journal of Advanced Research Trends In Engineering And Technology, IJARTET, Volume 4, Special Issue 6, April 2017.\nAthul G Nathan, Ms.Sheenu P,” Torque Ripple Reduction In Induction Motor Using PWM Techniques”, International Journal Of Advanced Research In Electrical, Electronics And Instrumentation Engineering, IJAREEIE, Volume 6, Issue 4, April 2017.\nJumana Beegum N S, Ms. Sheenu P, “Comparison of Speed Control of PMSM Using PI, PID& Adaptive PIDControllers”, International Research Journal of Engineering and Technology (IRJET), Vol.3, Issue. 06, June 2016.\nJumana Beegum N S, Ms. Sheenu P,” Speed Control of PMSM with Different Control Methods”, International Journal of Electrical and Electronics (SSRG-IJEEE), Vol.3, Issue. 06, June 2016.\nVijisha V U, Ms. Sheenu P, “Design and Modeling of Generalized Photovoltaic System with a Half- Bridge Converter”, IJSRD, Vol.4, Issue 4,pp.932-935,2016.\nMs.Sheenu P, Dr. M J S Rangachar , “Design of Surface wave radars for Tsunami predictions”, in the proceedings of National Conference on Emerging Trends in Engineering & Technology/ International Advanced Research Journal in Science, Engineering & Technology(IARJSET) titled, volume 3, special issue 3,August 2016.\nAnjali R D, Ms. Sheenu P, “Voltage Regulated Five Level Inverter Fed Wind Energy Conversion System using PMSG”, International Journal of Engineering Research & Technology (IJERT), Vol. 04, Issue 08, August 2015, pp: 618 – 622.\nAnjali R D, Ms. Sheenu P, “Comparison of Wind Turbine Driven PMSG Fed Wind Energy Conversion Systems using Reactive Power Controlled Two Level Inverter”, International Journal of Engineering Research and General Science, Vol. 03, Issue 05, Sept.-Oct. 2015, pp: 440 – 448.\nAnjali R D, Ms. Sheenu P, “Modelling and Performance Analysis of Reactive Power Controlled Wind Energy Conversion System”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, Vol. 04, Issue 10, October 2015, pp: 8166 – 8173.\nMs. Sheenu P, Dr. M J S Rangachar ,” Advance prediction of Tsunami by Surface Wave radars” , International Journal of Advanced Research Trends in Engineering & Technology (IJARTET), March 2015\nMs. Sheenu P, Dr. M J S Rangachar, “Advance Prediction of Tsunami by Radio Methods”, International Journal of Innovations in Engineering & Technology (IJIET), February 2015.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNil\nAcademic / Professional Outreach Activities\nNil\nMembership in Professional bodies/ organizations\nISTE\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\nNil\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}