{
    "filename": "mbcet.ac.in_resources_.html",
    "content": "Resources – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nResources\nHome\n>\nResources\nMar Baselios College of Engineering and Technology offers World-class facilities and resources for the future technocrats in the campus.\nThe aesthetically designed buildings in nine blocks spread over the campus have a total built-up area of over 32000 sq. m.\nEach block is connected by Pedestrian Bridge, retaining the separate entity of each branch of Engineering, Chaitanya – The Administrative block, Thejus – The Academic Block, Nalanda – The Library, Yantra – The Mechanical Engineering Block and Nirmithi – The Civil Engineering Block. Olympia, houses the Amenity Centre, Auditorium, Food Court, Indoor Courts, Gymnasium, Placement Rooms and so on.\nLibrary\nThe world of knowledge compressed into a limited space, at your finger tips, in a serene atmosphere...\nRead more\nIT Management and Services\nQuality and reliable IT facility on the campus is the watch word of the Information Technology Management Service Division.\nRead more\nHostel\nA Home Away from Home, a Heaven where dreams breed…\nRead more\nTransportation\nThe College takes care of the safe and comfortable travel of the students providing them the means of conveyance…\nRead more\nCanteen\nAkshaya… provides energy with flavours to make the academic pursuits on the campus vibrant…\nRead more\nAmenities Center\nFacility for Conferences, Meetings, GDs, interviews, recruitments… under a single roof…\nRead more\nChapel\nSt. Basil’s Chapel has been erected in the shape of a bell, under the Buddhist influence, by the Founders…\nRead more\nCentral Computing Facility\nThe Central Computing Facility provides a common source for using Network facilities for the students and faculty members.\nRead more\nConference Halls\nMBCET provides state-of-the-art facilities to the students. Various Halls have been named after eminent Scientists and Engineers so that every space would provide an ambience conducive to quality academic pursuits.\nRead more\nCells and Centres\nVarious Cells and Centres ensure the sustenance and enhancement of quality performance of the Institution…\nRead more\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}