{
    "filename": "mbcet.ac.in_departments_electronics-communication-engineering_facilities_.html",
    "content": "Facilities – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nElectronics & Communication Engineering\n>\nFacilities\nFacilities\nThe department has two seminar halls facilitated with the latest technology and well-equipped with multimedia projectors and audio-video amenities, named after the famous mathematician Aryabhatta and scientist, Shannon. With a seating capacity of 126, the Shannon hall is regularly used for class interactions, national and international conferences and teacher-student training programs. The back-up facility in the seminar hall enables smooth functioning of seminars and conferences. The following well equipped laboratories, containing state of the art equipment, have been set up to enable the students to undergo their practical classes.\nSl.No.\nNAME OF THE LAB\nFACULTY IN CHARGE\nSTAFF IN CHARGE\nROOM NO.\n1\nProject Lab I\nMr. Anoop K. Johnson\nMr. Norbert A Varghese\nB108\n2\nModelling and Simulation Lab\nDr. Ancy S. Anselam\nMs. Hanna Varghese\nB317\n3\nDepartment Computing Facility\nMs. Deepa P.L.\nMr. Dhaneesh Raj D\nB116\n4\nDigital Electronics Lab\nDr. Luxy Mathews\nMs. Sarika U.S\nB117\n5\nPCB Lab\nMr. Anoop K. Johnson\nMr. C. S. Shinin\n6\nCommunication Engineering Lab\nDr. Lani Rachel Mathew\nMs. Manju Suresh & Mr.Ajithkumar S M\nB217\n7\nAdvanced Communication Lab\nDr. Sreedevi P/Mr. Shiras SN\nMr. Rajendran H\nB105b\n8\nIntegrated Circuits Lab\nMs. Teena Rajan\nMr. Akhil Sudheesh B\nB105a\n9\nProject Lab II\nMr. Jinu Baby\nMr. C. S. Shinin\nB209\n10\nBasic Electronics Lab\nMs. Ann Mary Alex\nMs. Swapna Lekha U\nA104b\n11\nIntel Unnati Lab\nDr. Swapna P S\nMs. Ancy. A\nA104\n12\nIEDC Lab\nMr. Jijo Jose\nMr. Chandramohan\n13\nMaintenance cell\nMr. Akhil Sudheesh B\nB215 (A)\n14\nDepartment Library\nDr. Lani Rachel Mathew\nMr. Akhil Sudheesh B\nB115\nIntegrated Circuits Lab\nThis lab mainly introduces the theoretical & practical aspects of Operational amplifiers, which is the cornerstone for the basics of linear integrated circuits. The major equipment in the lab includes Digital Storage Oscilloscope, Function Generator, Multi Output Power Supply, Analog & Digital IC Tester.\nCommunication Engineering Lab\nThis lab imparts strong foundation on analog and digital communication systems. The major equipment in the lab includes Digital Storage Oscilloscope, Function Generator, Spectrum Analyzer, Multi Output Power Supply, Digital IC Tester, Digital Trainer Kit.\nDigital Electronics Lab\nThis lab bestows in-depth concepts of digital electronics and train students with all the equipment to improve their basic knowledge. The major equipment in the lab include Digital Storage Oscilloscope, Function Generator, Multi Output Power Supply, Analog & Digital IC Tester.\nAdvanced Communication Lab\nThis lab is equipped for familiarizing students with Microwave and Optical communication techniques relevant for most modern communication systems. The major equipment in the lab includes Klystron Power Supply, Klystron Tube, Gun Power Supply, Gun Oscillator, PIN Modulator, VSWR Meter, Cathode Ray Oscilloscope, Function Generator, LED module, Photo diode module, Laser diode unit, APD module, LD modulator, Optical fiber communication trainer kit, Laser diode and glass fiber optic trainer Kit, Optical Power meter with Power Supply, PAM, PPM, PWM Modulation and Demodulation Kits, TDM, Pulse Code Modulation Kit , ASK Modulation and Demodulation Kit, FSK Modulation and Demodulation Kit, PSK Modulation and Demodulation Kit, DSB-SC Modulation and Demodulation Kit.\nDepartment Computing Facility\nThis lab provides a strong frame work of digital signal processing which enables the students to apply DSP to real time applications. This lab also provides knowledge for students regarding, the architecture of 8051 Microprocessors, Micro51LC controller and Assembly Language Programs using the instruction sets of processors and to study the interfacing of the processor with various peripheral devices . The major equipments in the lab includes Computer, Digital Storage Oscilloscope, 8051 Trainer kit(Vi 89C51SB), Microcontroller Trainer kit (Micro 51 LC(LCD)), DSP Starter Kit (TMS320C6713) and Function Generator. Internet facilities are also available for the students in DCF. The softwares like orCAD, Proteus and MATLAB are there for circuit design and simulations.\nPCB Lab\nThis lab facilitates designing and manufacturing of prototype Printed Circuit Board (PCB), to assemble and test electronic circuits. The major equipment in the lab includes Scrubbing Machine, Drilling Machine, UV Exposure unit and Etching Machine.\nIEDC\nThe aim of the Innovation and Entrepreneurship Development Center (IEDC) is to instill innovative ideas among students to open creative space, which eventually enables them to be experts in product based design. Moreover, moulds their entrepreneurship skills in relevant areas. The major equipment in the lab includes Computer, Analog & Digital IC Tester, Soldering Station, Digital Storage Oscilloscope, Function Generator, and Multi Output Power Supply. The softwares like orCAD, LabVIEW and Proteus are there for circuit design and simulations.\nBasic Electronics Circuits Lab\nThis lab lays the foundation stone for students, which is a pre requisite for gaining basic knowledge in electronics. The major equipment in the lab includes Cathode Ray Oscilloscope, Digital Storage Oscilloscope, Function Generator, Multi Output Power Supply and Soldering stations.\nProject Lab I\nThis lab provides space for students to place their theoretical ideas before the real world and also foundation on modern analog and digital communication systems and simulations. The major equipment in the lab includes Digital Storage Oscilloscope, Function Generator, Multi Output Power Supply, Analog & Digital IC Tester and Computer.\nProject Lab II\nThis lab provides space for students to place their theoretical ideas before the real world and also a foundation for electronics circuit theory. The major equipment in the lab includes Digital Storage Oscilloscope, Function Generator, Multi Output Power Supply, Analog & Digital IC Tester and Computer.\nPG Lab\nThis lab provides facility for simulating and realizing most modern communication and signal processing systems. The major equipment in the lab includes Digital Storage Oscilloscope, Function Generator, Multi Output Power Supply, DSP Kit (6713, 6416), Logic Analyzer, FPGA Kit and Computer. The softwares like MATLAB, ANSYS(HFSS) , LabVIEW are there for simulations and Xilinx for Digital System Design.\nDepartment Library\nText books of national and international authors in the area of Mathematics, Signal Processing, Microprocessors, Electromagnetic theory, Power electronics, Computers, VLSI Engineering, Neural Networks etc., are available in our Department Library. The Library has back up volumes of the previous year’s seminar reports, and project reports for students’ reference.\nMicrocontroller Lab\nThis  lab emphasizes hands-on experience in designing microcontroller-based systems for a wide range of applications, primarily using the 8051 microcontroller and its associated interfaces. Students are introduced to industry-relevant hardware and software platforms to ensure practical familiarity with current technologies. The course also includes exposure to advanced controller boards commonly used in industry, enhancing students’ readiness for real-world applications.\nIntel Unnati Lab\nThe Intel® Unnati Data Centric Lab at MBCET is an industry-powered center for advanced  skill development in AI and IoT, supported by Intel® under the Unnati Scheme. Equipped with IoT kits and a high-end server, the lab provides 24×7 cloud connectivity to Intel®’s platform, facilitating seamless experimentation and project development. Located in Room 104 of A Block, it can accommodate 30+ students in its first phase. The collaboration aims to equip students with industry-relevant, data-centric skills, preparing them for cutting- edge applications in industry, agriculture, public administration, and social service. The lab&#39;s infrastructure is backed by AUK Computing through a tripartite MoU with MBCET and Intel®, with an initial investment exceeding four million rupees.\nVision\nTo be a Centre of Excellence in Electronics and Communication Engineering Education and Research for the service of humanity.\nMission\nTo provide quality Engineering Education and to carry out Research in the field of Electronics and Communication Engineering addressing the challenges faced by the society.\nBoS\nThe People\nDepartment Advisory Board\nFacilities\nNews and Events\nActivities\nConferences\nResearch and Consultancy\nWorkshops & Seminars\nPlacements\nB. Tech PEOs POs & PSOs\nSyllabus\nVideo Lectures\nTime Table\nFormer HoDs"
}