{
    "filename": "mbcet.ac.in_faculty_ms-lakshmi-j-s_.html",
    "content": "Dr. Lakshmi J S – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nScience & Humanities\n>\nDr. Lakshmi J S\nEmployee Code / ID No.\n10712020\nQualifications\nMSc, B.Ed, Ph.D, SET, NET\nOrcid ID\n0009-0004-6788-9593\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9846992262    Ext:- 703\nAreas of Interest / Current Research\nMaterial Science, Nanoceramics\nResearch,  Consultancy, Publication\nPublications\nLakshmi J S, Rajesh S, E K Suresh, Rafael A Raimundo, Rini Varghese, Steffy Maria Jose, J K Thomas, Low-temperature sintering of Zn2-xCuxV2O7 (X=0~2) nanoceramics as an LTCC material, synthesized through combustion route, and a study on the influence of copper in their structural and dielectric behavior, Ceram. Int., 2023, DOI:10.1016/j.ceramint.2023.12.118, ISSN: 0272-8842\nRini Varghese, Steffy Maria Jose, Lakshmi J S, Abraham A, J K Thomas, Enhanced optical, electrical, dielectric, and photovoltaic properties in strontium titanate by Ce-doping through a modified combustion method, J. Integr. Sci. Technol., 12 [4] (2024) 781, DOI: 10.62110/sciencein.jist.2024.v12.781 , ISSN: 2321-4635\nRini Varghese, Steffy Maria Jose, Lakshmi J S, J K Thomas, Investigation of the structural, optical, electrical, and photovoltaic characteristics of nanostructured Ce-doped BaTiO3 by a modified combustion method, Opt. Quant. Electron., 56 [1] (2024), DOI: 10.1007/s11082-023-05686-9, ISSN: 1572-817X\nSteffy Maria Jose, C T Mathew, Y.V Swapna, J S Lakshmi, J K Thomas, Synthesis of Ultrafine Nanopowder of Y2O3-ZnO composite by a modified combustion method for their application as infrared transparent ceramic materials, in: Emerging Trends in Advanced Spectroscopy, River Publishers, 2022. DOI: 10.1201/9781003338093-16 (Book chapter)\nY V Swapna, C T Mathew, J K Thomas, J S Lakshmi, Steffy Maria Jose, Synthesis and Characterization of Hydroxyapatite Nanoparticles Using a Novel Combustion Technique for Bone Tissue Engineering, in: Emerging Trends in Advanced Spectroscopy, River Publishers, 2022. DOI: 10.1201/9781003338093-20. (Book Chapter)\nConferences\nPresented a paper “Structural and morphological studies of LaVO4 nanoceramics for LTCC applications” in the National Seminar on Modern Trends In Physics Research at St. Stephen’s College, Pathanapuram on 16th and 17th December 2024.\nPresented a paper “Synthesis and characterization of Zn2-xCuxV2O7 (x=0~2) nanostructured ceramics for LTCC applications” in the International Conference on Nanotechnology and Materials Science at Mar Ivanios College, Thiruvananthapuram on 18th and 19th December 2023.\nPresented a paper “Structural and electrical studies of CeVO4 nanoceramics for LTCC applications” in the National Conference on Advanced Functional Materials -2023 at VTMNSS College, Dhanuvachapuram on 23rd and 24th March 2023.\nPresented a paper “Single step combustion, synthesis and characterisation of CeVO4 nanoceramics for LTCC applications” in the International Conference on Materials Science at Bharata Mata College, Thrikkakkara on 9th and 10th January 2023.\nPresented a poster on Preparation and Characterization of Low Temperature Sintering of  Vanadium pentoxide nanoparticles for LTCC Applications  at ICMS held on December 2017 at MG University , Kottayam.\nFDP/ Conferences  attended:\nAttended a three-day FDP on ‘Mentoring Matters: Strategies for Effective Academic Counselling’ organized by the department of Science and Humanities, from 19-21 May 2025\nAttended a nine-hour workshop on pedagogy organised by TLC, MBCET in collaboration with at Theophilus Training College.\nAttended a six day international FDP on ‘Innovation, IP Management & Industry Connect’ organised by Innovation and Entrepreneurship Development Cell St. Thomas College of Engineering & Technology, Chengannur from 20-25 January 2025.\nParticipated in the one day Teachers’ Workshop as part of World Space Week 2024 Celebrations held at Liquid Propulsion Systems Centre (LPSC) and Indian Institute of Space Science & Technology (IIST), Valiamala, Thiruvananthapuram on October 07, 2024.\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\nParticipated and successfully completed the 5-day online FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022.\nParticipated in 5-day workshop on ‘Academic Writing’ from November 1-November 6, 2021.\nParticipated in Talk on Recent trends in Raman spectroscopy organized by Department of Physics, University of Kerala on July 15, 2020.\nParticipated in Webinar on “Evading Social Engineering Attacks: COVID’19 ” organized by NetSec Research Group, Department of Computer Science and Engineering, Mar Baselios College of Engineering and Technology on July 21, 2020.\nParticipated in International webinar-CROSSROADS 2020 organized by PG and Research Department of Physics, SN College, Kollam on 22 July 2020\nParticipated in Webinar on Astronomy and Astrophysics organized by Department of Physics, Mar Ivanios College on 25 July 2020.\nParticipated in FDP on Outcome Based Education in Higher Education Sector organized by MBITS & AJCE from 23-25 August 2020.\nParticipated in Lecture on Emerging Solar Cell Technologies organized by Bishop Moore College on July 28, 2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Short term FDP on “Pedagogical And E-Learning Tools For Teaching organized by SD College & The Kerala State Higher Education Council from 4-10 August 2020\nParticipated in National Webinar on Next Generation Challenges in Astro technology organized by Department of Basic Sciences and Humanities, RSET on August 12, 2020.\nParticipated in National Webinar on “Silicon to Systems – How the world has transformed after the transistor” jointly organized by Department of Physics and Internal Quality Assurance Cell of All Saints’ College on August 15,2020.\nParticipated in FDP (Interdisciplinary) on Towards a Digital Era of Teaching and Learning organized by UGC-HRDC, University of Kerala in collaboration with KSMDB College, Sasthamcotta from August 12-18, 2020.\nParticipated in FDP on “How to write a research paper/Book chapter for Scopus Publication organized by Department of management Studies, New Horizon College of Engineering on September 4, 2020.\nParticipated in the workshop, Role of Science and Humanities Department in an Engineering College, organised by Department of Science & Humanities on November 17, 2020.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\nJudged the Science exhibition- Sarvo Techtopia 2024-2025 held at Sarvodaya Vidyalaya on October 22.\nCoordinated an invited lecture on ‘Linear Algebra in Machine Learning Applications” was organized by the Department of Science and humanities for the first year students of Computer Science on November 13, 2024. The speaker for the session was Dr. K.Satheesh Kumar, Visiting Professor, Digital University.\nParticipated as a judge at Sarvo Techtopia – Science exhibition 2024-2025 held at Sarvodaya Vidyalaya on 22 October 2024.\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}