{
    "filename": "mbcet.ac.in_faculty_ms-elizabeth-varghese_.html",
    "content": "Dr. Elizabeth Varghese – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nDr. Elizabeth Varghese\nEmployee Code / ID No.\n10303004\nQualifications\nM Tech (Control Systems), Ph.D\nOrcid ID\nhttps://orcid.org/0000-0003-4646-6853\nIndustry / R & D Experience\n—–\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n406\nAreas of Interest / Current Research\nControl Systems, Robust Control, Adaptive Control, Fractional Order Controllers, Aerospace Systems\nResearch,  Consultancy, Publication\n—–\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nJournals\nElizabeth Varghese,Dr. S. Dasgupta and Dr.J. S. Savier, “Robust Fractional Order Attitude Controller for Launch Vehicle with Flexible Dynamics” International Review of Automatic Control (IREACO), vol  14, no .2, 2021.\nElizabeth Varghese, Dr. S Dasgupta, Dr J S Savier, “Robust Fractional Order Controller For An Expendable Launch Vehicle”International Conference on Design,Automation & Control (ICDAC) 6-8 January 2020 IOP Conf. Series: Materials Science and Engineering 1123  (2021) 012029 IOP Publishing doi:10.1088/1757-899X/1123/1/012029.\nArya S J, Asish A, Febi Shine B S, J L Sreelakshmi, Elizabeth Varghese presented their paper titled “SKIN DETECTION USING YCbCr COLOUR SPACE FOR UAV BASED DISASTER MANAGEMENT” based on their final year project work in the 8th International Conference on Innovations in Computer Science & Engineering (ICICSE 2020) in virtual mode organized by Guru Nanak University, Hyderabad. The conference proceedings will be published by Springer LNNS series publication.\nAmala Justin, Elizabeth Varghese, “Comparative Study of Attitude Control for Rigid Body of Launch Vehicle Using Sliding Mode Control for Different Constant Rate Reaching Laws” International Journal of Innovative Research in Science, Engineering and Technology, Vol. 7, Issue 5, May 2018.\nMs. Elizabeth Varghese and Mr. Jithin Babu, “Stabilization of Rotary Arm Inverted Pendulum using State Feedback Techniques” International Journal of Engineering Research & Technology, ISSN-2278-0181, Vol. 4, Issue 7, July 2015.\nMs. Elizabeth Varghese and Mr. Augustin, “Design of Controllers for Liquid Level Control”, International Journal of Electrical Engineering and Technology, Vol. 6, Issue 7, July 2015.\nMs. Elizabeth Varghese and Mr. Ramkumar V P, “Fractional Order PID Controller for Liquid Level System”, International Journal of Engineering Research & Technology (IJERT) ISSN: 2278-0181 Vol. 4 Issue 07, July-2015.\nMr. Aneesh Kumar K T, Ms. B Prasannakumari, Ms. Elizabeth Varghese, “Space vector PWM based two level inverter topology for Wind energy conversion systems”, International Journal on Advanced Electrical and Computer Engineering, IJAECE, Volume_1, Issue_1, 2014, pp 28-34.\nConferences\nElizabeth Varghese, Dr. S. Dasgupta and Dr. J. S. Savier, “Design of Robust Fractional Controller for Unstable Linear Systems Based on Phase Shaper Method,” 2021 IEEE 6th International Conference for Convergence in Technology (I2CT), 2021, pp. 1-5, doi: 10.1109/I2CT51068.2021.9417902.\nElizabeth Varghese, Dr. S. Dasgupta and Dr. J. S. Savier, “Robust Fractional Order PI Controller for Attitude Control of Launch Vehicle with Flexible Dynamics”, International Conference om Sustainable Technology Applications for Green Energy STAGE 2020 17-18 July, 2020.\nElizabeth Varghese, Dr. S Dasgupta, Dr. J S Savier, “Robust Fractional Order Controller For An Expendable Launch Vehicle”International Conference on Design,Automation & Control (ICDAC) 6-8 January 2020.\nG. Dhanya, Elizabeth Varghese, “Fractional stabilizing controller for a magnetic levitation system”, International Conference on Circuit,Power and Computing Technologies (ICCPCT) 2017, pp : 1 – 8.\nShincy Gilbert, Elizabeth Varghese, “Design and simulation of robust filter for tracking control of quadcopter system”, International Conference on Circuit, Power and Computing Technologies (ICCPCT), 2017.\nAnagha Philip Antony and Elizabeth Varghese, “Comparison of Performance Indices of PID Controller with Different Tuning Methods”, IEEE International conference on Power and Computing Technologies Circuit, 2016.\nMr. Aneesh Kumar K T, Ms. B Prasannakumari, Ms. Elizabeth Varghese, “Simulation topology and control methods for Wind energy conversion systems”, International Conference on Emerging Trends in Electrical Engineering ICETREE_2014.\nMr. Aneesh Kumar K T, Ms. B Prasannakumari, Ms. Elizabeth Varghese, “Space vector PWM and fractional controller-based Wind Energy Conversion systems”, Dec 17-18,2014, International Conference on Advances in Green Energy (ICAGE), Pages 74-81, IEEE Conference Publications 2014.\nMs. Tania K.S., Ms. Elizabeth Varghese, “Fractional Order PI Controller to Control the Speed of Permanent Magnet Synchronous Motor Drive”, International Conference on Electrical Electronics and Computer Engineering ICEECE 2014.\nAcademic / Professional Outreach Activities\nHead of the Department : From 01-07-2014 to 08-01-2017\nAssistant HOD : From 16-09-2009 for two years\nNBA Coordinator : From June 2008 to June 2017\nAdmission Coordinator : From 2008 onwards\nGrievance Redressal Committee member : From 06-03-2017 onwards\nMembership in Professional bodies/ organizations\nISTE, IET, ISSE\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\nBEST PAPER AWARD IN ICDAC 2020,\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}