{
    "filename": "mbcet.ac.in_faculty_mr-vaisakh-s-nair_.html",
    "content": "Mr. VAISAKH S NAIR – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nMechanical Engineering\n>\nMr. VAISAKH S NAIR\nEmployee Code / ID No.\n10620069\nQualifications\nM Tech (PROPULSION ENGINEERING), B Tech (MECHANICAL ENGINEERING)\nOrcid ID\nhttps://orcid.org/0000-0003-0955-8310\nIndustry / R & D Experience\n6 months\nEmail ID\n[email protected]\nAlternate E-mail ID\n–\nMobile No (Optional) / Intercom Extension No.\n–\nAreas of Interest / Current Research\nExperimental and Computational Fluid Dynamics, Gas Dynamics and Aero-acoustics\nResearch,  Consultancy, Publication\nK Muraleedharan Nair, S Vishnu Prasad, Vaisakh S Nair, “Comparison of flow features near the wake of a circular and elliptical cylinder for different gap to diameter ratios”, 7th Asian Joint Workshop on Thermo physics and Fluid Science, November 21– 24, 2018.\nVaisakh S Nair, K Muraleedharan Nair, “Numerical study on oscillation mechanism and its suppression when flow past a closed cavity for an inflow Mach number 3.0”, 7th International and 45th National Fluid Mechanics and Fluid Power (FMFP) Conference, IIT Bombay, December 10– 12, 2018.\nK Muraleedharan Nair, Vaisakh S Nair, “Numerical analysis of low speed flow past an open, transitional and closed rectangular cavities “, 32nd National Convention of Aerospace Engineers (NCAE 2018), BIT Mesra, Ranchi, October 27 – 28, 2018.\nUnnikrishnan G, Vaisakh S Nair, Abhilash Suryan, “Experimental investigation of sloshing phenomenon in cylindrical and rectangular tanks subjected to linear excitation”, 7th Asian Joint Workshop on Thermo physics and Fluid Science, November 21– 24, 2018.\nK. Muraleedharan Nair, S Vishnu Prasad, Vaisakh S Nair, Greeshma Pradeep Kartha, “Analysis of Supersonic Flow Past Deep Cavity with Different Aspect Ratios”, ICAMEO, MBCET AIP Conference proceedings, June 2019, https://doi.org/10.1063/1.5120198.\nUnnikrishnan G, S. Vishnu Prasad, Vaisakh S. Nair, Abhilash Suryan, “Investigation on the effect of baffle position on sloshing in tanks”, ICAMEO, MBCET AIP Conference proceedings, June 2019, AIP Conference Proceedings 2134, 040005 (2019); https://doi.org/10.1063/1.5120213.\nVaisakh S Nair, Vishnu Prasad and K. Muraleedharan Nair, “Comparison of Supersonic Flow Past Rectangular and Round Deep Cavities”, 6th National Symposium on Shock Waves, Oct 2020.\nVaisakh S Nair, Abhilash Suryan, Vikash Kumar & T. John Tharakan, “Experimental investigation of cavitation inside a plain orifice injector”,Indian Journal Of Cryogenics, Jan 2021, Vol 46, http://dx.doi.org/10.5958/2349-2120.2021.00007.8.\nVaisakh S Nair, Vikash Kumar, T. John Tharakan & Abhilash Suryan., “Comparison of Flow Features Inside a Plain Orifice Injector for Different Length-to-Diameter Ratios”,Proceedings of 16th Asian Congress of Fluid Mechanics, Feb 2021, pp.43-49, http://dx.doi.org/10.1007/978-981-15-5183-3_5.\nVaisakh S Nair, K. Muraleedharan Nair, S Vishnu Prasad, Greeshma Pradeep Kartha, “Numerical Analysis of Supersonic Flow Past Tandem Deep Cavities”, 48th National Conference on Fluid Mechanics and Fluid Power (FMFP), BITS Pilani, Pilani Campus, RJ, India, December 2021.\nVaisakh S Nair, K Muraleedharan Nair, “Numerical Analysis of Supersonic Flow Past a Double Cavity Scramjet Combustor”, Conference: Proceedings of the 1st International Conference in Fluid Thermal and Energy SystemsAt: NIT Calicut, Kerala, India, June 2022.\nComparison of Flow Features Inside a Plain Orifice Injector for Different Length-to-Diameter Ratios,Springer – Proceedings of 16th Asian Congress of Fluid Mechanics, pp 43-49, 04-02-2021. (https://doi.org/10.1007/978-981-15-5183-3_5).\nUnnikrishnan G, Vaisakh S Nair, S. Vishnu Prasad, Abhilash Suryan, “Sloshing Behavior of Different Fluids in a Cylindrical Tank”, Energy and Exergy for Sustainable and Clean Environment, Volume 1, January 2022, http://dx.doi.org/10.1007/978-981-16-8278-0_35.\nComparison of Flow Features Near the Wake of Circular and Elliptical Cylinders for Different Gap to Diameter Ratios, Recent Asian Research on Thermal and Fluid Sciences.2020-02-19 | Book chapter, Springer – Recent Asian Research on Thermal and Fluid Sciences, pp 409-419, 19-02-2020. (https://doi.org/10.1007/978-981-15-1892-8_32).\nS Vishnu Prasad, Vaisakh S Nair, Unnikrishnan G and Abhilash Suryan, Investigation on the Effect of Baffle Position on Sloshing in Tanks, Proceedings of the International Conference on Applied Mechanics and Optimization, Mar Baselios College of Engineering and Technology, Thiruvananthapuram, June 2019, (AIP published).\n10 Conferences (National and International)\nPh.D Research Guidance          (Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\nOne Week Online Faculty Development Progamme on “Taking Research to Next Level” organized by Department of Mechanical Engineering & Department of Basic Science , in Association with IQAC, ISNT and IIC Cell, Sri Venkateshwara College of Engineering, Bengaluru from 26th to 30th September 2022.\nOne Week Virtual International Faculty Development Programme (FDP) on Smart Tools and Methodologies for Academic Research organized by the Department of ECE, Mahatma Gandhi Institute of Technology, Hyderabad in association with Swecha during 01 – 05 August 2022.\nOnline webinar on Fantasy of Hypersonic Flight: Conquering the last frontier, IEEE, 23 October, 2020.\nOnline webinar on Sustainability in Flight: Our Journey to Decarbonization Confirmation, AIAA, 8 February, 2021.\n5-day online FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from 16 August, 2021 to 20 August, 2021.\n7th Asian Joint Workshop on Thermo Physics and Fluid Science Conference organizing team\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nKTU University Rank – PG\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}