{
    "filename": "mbcet.ac.in_students_student-club_.html",
    "content": "Student Clubs – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nStudents\n>\nStudent Clubs\nStudent Clubs\nIEDC\nCatalyst- Mar Baselios IEDC\nThe Innovation and Entrepreneurship Development Centre of Mar Baselios College of Engineering and Technology, Catalyst was inaugurated in the year 2013 with a purpose of inspiring students to become independent engineers by exposing then to the world of Entrepreneurship through Innovation. The Centre aims in sharpening the skills of students, broadening their knowledge base and equipping them with technical and non-technical qualities that an engineer need.\nRather than pushing students to startup, the centre believes in inculcating the entrepreneurial spirit in students. The members have identified the true joy of self-learning and they passionately involve in brining life into their ideas, to solve the problems that they see around. They know the importance of spreading this fire to ignite the minds of their fellow students and hence have dedicated all their work in IEDC for this purpose, besides working on their own individual projects. Catalyst Mar Baselios IEDC aims in helping the students follow their dreams and passion to help them depart MBCET campus not just as engineering graduates, but as real engineers who seek and solve problems.\nRead More\nPHOTOGRAPHY Club - FRAMES\nPHOTOGRAPHY CLUB – FRAMES\nClub Co-ordinator:\nMr. Sherry Varghese George (EC)\nThe Photography Club was started in 2009 and the purpose of this club is to promote creativity through photography. The club conducts photography workshops, photowalks etc. FRAMES not only gives the students a platform to nurture their talent in editing and photography but also networking with experts in the field of photography.\nCheck out the promotional campus tour video shoot done by FRAMES:\nhttps://www.youtube.com/watch?v=82ERrFd48Ew\nFor more details, check out our website @\nwww.tinyurl.com/framesmbcet\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2019-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nNATURE Club\nNATURE CLUB\nNATURE CLUB (PRAKRUTHI)\n“The Greatest Threat to Nature is to believe that someone else will save it.”\nRealizing this, “Prakruthi”, the Nature club of Mar Baselios College of Engineering and Technology has always been committed in sensitizing the students on issues related to Environment. The main objective of the nature club is to create awareness among students on the need for environmental protection, conservation of our resources and to make our campus green and eco-friendly.\nNature Clubs bring students closer to nature and make them realize the importance of maintaining an eco-friendly environment. The Nature Club believes that nature teaches life’s lessons in its own subtle ways and enables our youth to share their responsibilities in preserving a healthy environment and to take steps to avoid environmental degradation in their individual capacity as well as in a group. We empower and sensitise our students on issues related to environmental degradation and take up meaningful environmental activities and projects.\nFaculty Co-ordinator\nDr. Jaya S Pillai, Assistant Professor, Department of Civil Engineering\nStudent Co-ordinator\nMr. Alan A. Vincent, S6 CE1\nWorld Water Day Celebration\nAs part of the World Water Day Celebrations, the\nNature Club\nof MBCET – ‘Prakruthi’ conducted a quiz competition on March 22, 2024 for students based on the global campaign theme of this year ‘WATER FOR PEACE’.\nWorld Environment Day celebrations\nAs part of the World Environment Day (June 5)celebrations, Nature club (Prakruthi) organised distribution of 100 saplings to MBCET staff members on 6th June 2024. Dr.Jaya S.Pillai and Ms. Akhila A.M. were the  coordinators of the program.\nReports\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2019-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2018-2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nWorld Water Day Celebration\nWorld Environment Day celebrations\nhttps://mbcet.ac.in/wp-content/uploads/2024/11/VID-20231221-WA0032.mp4\nActivities\nActivities\nSamvadam -Public Speaking Club\nPublic Speaking Club\nThe Oratory club was formed to focus on and bring up public speaking activities in our college. Central to the club’s activities is its participation in various competitions, including Model United Nations (MUN) conferences held in different colleges. MUN conferences provide a unique platform for students to engage in diplomatic simulations, representing different countries and debating pressing global issues. Through preparation and participation in these conferences, members not only enhance their public speaking and diplomatic skills but also broaden their understanding of international affairs and cooperation.\nStudent Achievement\nachievements\nACHIEVEMENTS (2024-25)\nCET MUN 2024\n(August 9–11, 2024)\nIP Photography\nAbin S Manoj (S4 EC)\n–\nHonourable Mention\nAshlin Anil Antony (S6 EC)\n–\nHonourable Mention\nAbraham Jacob (S4 EL)\n–\nSpecial Mention\nAIPPM\nYash Chhalotre (S4 EL)\n–\nSpecial Mention\nMBCET INTRA MUN 2025\n(February 1–2, 2025)\nUNHRC\nJithin Rajesh (S4 EL) –\nBest Delegate\nAdil Mohammed S (S2 EC2)-\nHigh Commendation\nNeil Philip (S4 EL)-\nSpecial Mention\nPrathyusha Nair (S4 EL)-\nSpecial Mention\nBevis Mathew (S4 CS1)-\nHonourable Mention\nAaron S (S2 EC2)-\nHonourable Mention\nInternational Press\nAlbin Anil Antony (S2 EL) –\nBest Photojournalist\nAnagha Asok Kumar (S4 CS1) –\nBest Journalist\nMACE MUN 2025\n(March 28 -30, 2025)\nUNHRC\nNeil Philip Koshy (S4 EL)\n–\nVerbal Mention\nJacob Cherian (S2 EE)\n–\nVerbal Mention\nAdil Mohammed (S2 EC)\n–\nHonourable Mention\nECOSOC\nElvis Mathews (S4 EL) –\nHigh Commendation\nJithin Rajesh\n(S4 EL) –\nSpecial Mention\nDISEC\nAbhav Nair (S4 EL)\n–\nHigh Commendation\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nA delegation of 22 students from our college had participated in MACE-MUN 2023. The following students won:Yash Chhalotre(S3 EL) and Bevis Mathew Thomas(S1CS1) in UNODC, Joel Ipe Samuel(S5CS1) in UNHRC, Ryan M Jacob(S3 EC2) and Ashlin Anil Anthony(S3 EC1) in photojournalist, Best Delegation in IP: Abin S Manoj(S1 EC2),  Vaishnav Prabhath(S3 EC2) in CCC.\nInstagram handle for Samvadam\nhttps://www.instagram.com/samvadam.mbcet/\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nINTRA MUN Report\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nMUSIC Club – RAGAM\nMUSIC CLUB – RAGAM\nRagam- The MBCET music club envisions to enrich Students’ experience, by encouraging involvement and providing platform for the Students and Faculty Members to expose and widen their various musical talent as well as knowledge. The Music Club is open to all Faculty Members and Students who are interested in music. The purpose of this club is to promote participation of students in the development and enjoyment of their talents in the field of Music.\nStrength of club: 97 members\nFaculty in-charge\n: Dr. Shalu George K, Associate Professor, EED.\nClub Secretary\n: Prithvi M(S6 EE)\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPerforming Arts Club\nPERFORMING ARTS CLUB MBCET\nThe\nPerforming Arts Club\nat MBCET was established in 2017 with a clear vision of fostering creativity and providing a platform for students to engage in diverse forms of performing arts. Since its inception, the club has remained committed to promoting artistic expression and providing students with opportunities to showcase their talents. The club regularly organizes a variety of events, offering students a space to express their passion for performing arts. In addition to performances, the club organizes workshops on different artistic disciplines, allowing students to nurture their skills and explore new forms of art. These workshops help cultivate a deeper understanding of performance techniques and broaden the creative horizons of participants. Meetings are held periodically to evaluate past activities, discuss future events, and ensure that the club continues to grow in line with its objectives. The club’s efforts extend beyond academics, as it aims to engage students in activities that keep their minds fresh and invigorated.\nThe\nPerforming Arts Club\nalso serves as a forum for students to discuss the evolution of art, exchange ideas, and discover new talents within the MBCET community. Through these initiatives, the club plays an essential role in promoting the growth of artistic expression and creativity among students.\nFaculty In-charge:\nMs. Akhila A M, Assistant Professor, Civil Engineering Department\nClub Secretary:\nBasil Anil, EEE Department\nBy supporting the artistic development of students and promoting a culture of creativity, the Performing Arts Club continues to be a vibrant and integral part of campus life at MBCET\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2019-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nFOSS Club\nFree and Open Source Software (FOSS) are those software that are liberally licensed to grant users the freedom to run the program for any purpose, to study and modify the program, and to redistribute copies of either the original or modified program (without having to pay royalties to previous developers). The main objective of the club is to adopt and promote the Free and Open Source Software. It can include both the system software as well as the application software. System Software include- GNU/Linux, Apache Web Server, BSD etc. and Application Software include OpenOffice, Gimp, TeX and LaTeX typesetting systems etc.\nReports\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nAKSHARAKOOTAM -  Creative Writing Club\nCREATIVE WRITING CLUB\nThe Creative Writing Club of MBCET came into existence in 3rd November 2016. Students interested in creative writing in English, Hindi and Malayalam is eligible for membership. The club was named as “Aksharakoottam”. Club meetings were held on every Tuesdays.\nInstagram handle for Aksharakootam\nhttps://www.instagram.com/aksharakootam.mbcet/\nAksharam – Mar Baselios College of Engineering And Technology\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nStudent Coordinators(2022-24): Merin (S4 EEE) and Sam (S4 CS1)\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nYOGA Club\nYOGA CLUB\n“Yoga is the journey of the self through the self to the self”.\nYoga has been gaining immense popularity due to the short-term as well as long-term benefits that it provides. The aims of the yoga enthusiasts are extremely varied. Some are particularly inspired by the spiritual element that yoga provides; others by the increased fitness and flexibility that it results in. Some people find solutions to suffering from varied health disorders and there are others who achieve an all-round development of a calm-stress free mind and a fit body.\nOur college proudly supports yoga through club activities. Hours a day sitting at desk or more hours doing homework cause a young body to tense up. Social and family pressures and unfortunately, anxiety, abuse and bullying also take their toll. Stress is a major obstacle to academic achievement, and yoga’s stress relief powers have been shown to boost student performance.\nYoga and Meditation club in our college has its activities going on actively. Club conducts the activities once in a week. The activity includes theoretical, practical classes and convey knowledge about importance of yoga and meditation under the guidance of trained teachers who has about 10 years of experience. While we may speak different languages and come from different states, our problems and questions about life are similar. Modern science has made great strides in helping us improve our standard of living, it has lacked in a holistic approach to help people overcome pain in life and gain lasting happiness. Each of us are on a spiritual journey with life lessons to learn. For those of us who are conscious of spiritual journey and want to progress spiritually, yoga and meditation club would like to help by providing you with a road map so that you can make the best use of every precious moment of your life.\nYoga and Meditation club activity have been conducted weekly one hour. Which includes Meditations, Pranayama- a process of directing energy in our body, Yoga postures and Sooryanamaskara. Yoga is not a religion; it is a way of living that aims towards a healthy mind in a healthy body.\nTENSORZ Club\nTensorz Club is a place where students get an opportunity to express themselves and unleash their true potential in terms of soft skills which is a necessity in today’s world.\nTensorz Club truly believes that everyone can improve with little moulding provided and the effort that they put in. One cannot simply stand out, they need to have a lot of courage and confidence to raise their opinions and voice out what they really desire.\nThis club acts as a foundation and as an advisor for students who desire to excel in their respective fields. By having them complete tasks and perform activities which enhances their vocabulary skills, presentation skills and communicative skills, we prepare them to face the world and show what they truly are.\nThe knowledge gained at Tensorz will prepare them for interviews, inviting more opportunities and will help to find themselves in an easy position and soar to greater heights\nThe Tensorz Club is thrilled to announce that we are back in action. We have recently formed a new core team that brings together passionate individuals dedicated to achieving our club’s mission and goals. Our new OB team: Sam (S4 CS1), Sophy Maria Joy (S4 EE) Sweta (S4CE2), Hashna (S4 CE2) ,Deanne Rodricks (S4 CS2)\nWe have carefully planned a series of activities that will engage students and create awareness about our club. These activities will serve as stepping stones towards larger initiatives in the future. Our goal is to reconnect with students, demonstrate the values we bring, and encourage them to join our efforts to help them develop their capabilities and become better professionals\nTensorz Core Team\nDr. Veena Nair (Staff Coordinator ): Assistant Professor in the Department of Science and Humanities\nMr William George (Co-founder of Tensorz ) : S8, ME2\nMr Aaditya Radhakrishnan (Co-founder of Tensorz ) : S8, ME2\nMs Devi Suresh (Co-founder of Tensorz ) : S8, CS1\nMs Anamikaa Nair : S4, EC2\nMr Aswen AM : S4, EC2\nMr Faizan Ahamed Dawood Majahar : S4, EC2\nMs Sanna Pramod : S4, CS1\nNew OB\nMs. A. Samyukta Syam, S2 EE\nMr. Ansen Lovejen, S2 EC\nMs. Athena S, S2 CE1\nMs. Megha, S4 CE1\nMr. Mohammad Rawther, S2 ME\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nTensorz Club organised a motivational talk on ‘Changing Faces, Changing Times’ on October 1, 2023. The resource person was Mr. Khader Hassan, Film Producer, Director and Businessman. Around 75 students attended the session.\nInstagram handle for Tensorz\nhttps://www.instagram.com/tensorz_mbcet/\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nOpen Lab AI Club\nOpen Lab AI club was constituted with new student ambassador Ann shiny, S7CS1 on October 2022.First technical session of Open Lab AI was taken by Bharat T U, Engineer, TCS. Open LAB AI started Student Talk series on 16.11. 2022.The first session of the talk series was handled by Ms Riya P Mathew, s7cs1.She explained her path and topic was “My Dive into Machine Learning”. Next session was on 23.11.22, on topic “Introduction to Figma by RHEA MERIN, On 30.11.22. Mr Kevin Jacob of s7 CS1 gave brief introduction about “Web 3.0”. Don Kora Jacob, CEO & founder of Tatos tech was the next speaker, he explained the journey towards his startup.\nOn January,2024 a new executive committee was constituted with new student ambassador Adlu Rehman, S6CS1. The Department of Computer Science and Engineering in association with CSI-SB & Data Analytics Research Group, Open Labs AI of Mar Baselios College of Engineering and Technology organized 6 days Online Faculty Development Programme on “Generative AI with Hands on Training Using Python” from 29 January to 03 February 2024.\nCheck out the promotional campus tour video shoot done by FRAMES:\nhttps://www.youtube.com/watch?v=82ERrFd48Ew\nFor more details, check out our website @\nwww.tinyurl.com/framesmbcet\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nScience Club\nScience Club\nAdyatva – The Science Association, MBCET, launched its debut event, Antaragni, on October 19th, drawing around 150 first-year students for a day filled with excitments and engagements. Alumni guest Ramakrishnan Hareesh captivated the audience with a stunning performance, while Adlu Rahman of S7 CS inspired attendees with an insightful talk.\nThe program featured interactive sessions, an introduction to the Science Club, and a variety of games, creating a seamless flow of engaging moments. Antaragni set a promising foundation for future events, fostering a spirit of unity, creativity, and lifelong learning among students.\nINSTA ID :\nScience Club was started on 19/02/24.\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nSpace Club\nThe space club at MBCET was inaugurated by Dr. V. Narayanan, Director, Liquid Propulsions Systems Centre, LPSC, Valiyamala, Trivandrum on 1 October 2024. Dr. V. Narayanan delivered an inspiring inaugural address, sharing his passion for space and encouraging students to explore the wonders of the universe. His words ignited a sense of curiosity and excitement among the audience. Following his speech, the students were treated to captivating video presentations on the marvels of space and the Chandrayaan mission. Officials from LPSC joined the inaugural ceremony. The presidential address was delivered by Dr. S Viswanatha Rao, Principal, MBCET. The welcome address and Vote of Thanks were delivered by Dr. Swapna P. S., Faculty in charge of Space Club and Mr. Rohin Sabu, Student Coordinator, Space Club.\nFaculty coordinator: Dr.Swapna P S, Associate Professor, ECE Department, MBCET.\nSPACE DAY CELEBRATIONS\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nµLearn\nμLearn is a pioneering peer-driven learning platform that fosters skill development through a unique microlearning approach. Designed to meet the evolving needs of learners, μLearn breaks down industry-relevant skills into actionable tasks, enabling users to progress in a structured and gamified environment. Learners earn Karma Points for each completed task, with progress tracked on dynamic leaderboards, fostering healthy competition and engagement.\nA defining feature of μLearn is its emphasis on community collaboration. Hosted on Discord, the platform brings together proactive learners, industry leaders, and mentors, creating a vibrant ecosystem for knowledge exchange. Tasks created within μLearn are not only crafted to meet real-world standards but are also vetted for quality and relevance by industry experts and mentors. Proof of work submissions undergo thorough validation, ensuring that the learning outcomes are impactful and credible. By combining microlearning, gamification, and community-driven engagement, μLearn catalyzes developing industry-aligned skills while promoting inclusivity, collaboration, and innovation.\nReports\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nBlock Hub\nIntroduction\nThe world is changing, and so should we. Blockchain technology and Web 3.0 have the potential to revolutionize industries, disrupt traditional industries, and empower individuals. Web 3.0 is creating more jobs and opportunities than ever before. Considering this, we propose the creation of a club in our college in collaboration with Block Hub, which will be called Block Hub MBCET. Here, we will be breaking down the complex world of blockchain to bring students the essence of Web 3.0.\nVision\nTo lead the charge in understanding, embracing, and shaping the future of the internet in MBCET. Our vision is to empower a community of forward thinkers who explore the limitless possibilities of Web 3.0, fostering innovations and decentralized solutions.\nMission\nOur mission is to educate, inspire, and connect individuals in exploring Web 3.0 technologies. We aim to foster innovation, advocate for decentralization, and empower our members to shape a more inclusive, secure, and decentralized digital future.\nObjectives\nEducation: Provide resources, workshops, and events to educate members and the public about blockchain technology and Web 3.0 applications.\nInnovation: Foster collaboration among developers, researchers, and entrepreneurs to drive innovation in the blockchain space.\nInclusivity: Create a diverse and inclusive community that welcomes individuals from all backgrounds.\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nBlock hub activities 2024-25\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nIEDC\nPHOTOGRAPHY Club - FRAMES\nNATURE Club\nSamvadam -Public Speaking Club\nMUSIC Club – RAGAM\nPerforming Arts Club\nFOSS Club\nAKSHARAKOOTAM -  Creative Writing Club\nYOGA Club\nTENSORZ Club\nOpen Lab AI Club\nScience Club\nSpace Club\nµLearn\nBlock Hub\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}