{
    "filename": "mbcet.ac.in_faculty_ms-teena-rajan_.html",
    "content": "Ms. Teena Rajan – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nMs. Teena Rajan\nEmployee Code / ID No.\n10407008\nQualifications\nBTech.,MTech.,Pursuing Ph.D\nOrcid ID\nhttps://orcid.org/0000-0003-1527-4226\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9447088924/180\nAreas of Interest / Current Research\nWireless communication,Assistive Technology\nResearch, Consultancy, Publication\nIn-house Project-PI of project titled “Textile Sensors”                                                                                           Publications\nMs. Teena Rajan ,AP, Dept of ECE, published a book chapter titled “MULTI-DIMENSIONAL CHARACTERIZATION METHODS FOR CONDUCTIVE FABRIC MATERIALS: ENABLING AI-ENHANCED HEALTHCARE APPLICATIONS” in Futuristic Trends in Artificial Intelligence e-ISBN: 978-93-6252-759-2 IIP Series, Volume 3, Book 8, Part 4, Chapter 7\nLink: https://mbcet.ac.in/faculty/ms-teena-rajan/\nMs. Teena Rajan, Assistant Professor, Dept. of ECE presented a paper titled ‘Dry Electrode Design for Non-Invasive Fetal ECG Acquisition’, at Second International Conference on Advances in Smart Sensor, Signal Processing and Communication Technology (ICASSCT 2024),  held at School of Physical and Applied Sciences, Goa University, Goa, India  23rd, March 2024.\nLink: https://mbcet.ac.in/faculty/ms-teena-rajan/\nAshwin Abraham Thomas , Avita Wilson , Karthik Mohan , Raichu Varghese, Teena Rajan, “SAVI: Smart Assistant for Visually Impaired”, IOSR Journal of Engineering (IOSRJEN) , ISSN (e): 2250-3021, ISSN (p): 2278-8719 Vol. 11, Issue 5, May 2021.\nJyothis Philip, Feba Mary Abraham, Ken Kurian Giboy,B J Feslina and Teena Rajan,”Automatic Medicine Dispenser using IoT “International Journal of Engineering Research & Technology (IJERT),ISSN: 2278-0181, Vol. 9 Issue 08, August-2020.\nAkhil M, Anu Thomas, Jijin Mohan , Royce Thomas, Teena Rajan, “MediNav – Autonomous Ambulance Management System” International Research Journal of Engineering and Technology (IRJET) e-ISSN: 2395-0056 p-ISSN: 2395-0072,Vol.6,Issue 5 May 2019.\nSanzitha K, Priya S, Angelin Maria, Bindhya Boban, Teena Rajan, “Wrist Motion Detector cum Efficiency Evaluator” International Research Journal of Engineering and Technology (IRJET) e-ISSN: 2395-0056 p-ISSN: 2395-0072,Vol.6,Issue 5 May 2019.\nAmina K., Teena Rajan, “ Performance Evaluation of Dynamic MIO Scheme Using LFSR Protocol and ER Approach”, IJEECS, Vol6, Issue 7, July 2017 [ISSN 2348-117X]\nTeena Rajan and Simi N, ‘A Comparison on Vector Quantisation and SMVQ’, International Journal of Advanced Technology in Engineering and Science (IJATES), ISSN: 2348 – 7550, Volume-04, Issue-05, May 2016.\nRenjitha Mariam Rajan,Teena Rajan,”Low complexity detection and PAPR reduction in SFBC BICM-OFDM system”International Journal of Advanced Information in Engineering Technology (IJAIET) ISSN: 2454-6933\nVol.3, No.10, October 2016\nRenjitha Mariam Rajan,Teena Rajan,”PAPR Reduction in BICM-SFBC OFDM based on Amplification and Clipping”International conference on Current Trends in Engineering and Technology (ICCTET-2014)\nRenjitha Mariam Rajan,Teena Rajan,”PAPR Reduction Based on Clipping and Scaling in SFBCOFDM Systems”International Journal of Engineering Trends and Technology(IJETT) –Volume10 Number10-Apr2014\nC-Band Chirp Spread Spectrum (CSS) Signal Generation Using DDS-PLL Technique in  International Journal of Advanced Electrical and Electronics Engineering, (IJAEEE) Volume-1, Issue-3, 2012\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nSelected as Evaluator of Young Innovators Programme ’20 and ’21 conducted by KDISC, Kerala\nMembership in Professional bodies/ organizations\nISTE Life time member,  IEEE,EMBS\nCommunity Outreach Activities\n“Spanadanam”- ECE Department Social Service Wing Faculty Coordinator,•    Spandanam activities are in association with NGOs like Jwala Foundation, CIMR Central Institute for Mental Retardation,Mobility In Dystrophy (MIND)etc\nAwards / Distinctions / Rank / Other Achievements if any\nWon the Best Paper award for the paper – “C band Chirp Spread Spectrum Signal generation using DDS-PLL Technique”, in the category-Best Content and Presentation, at the International Conference on Advances in Electrical,Electronics and Computer Science Engineering(ICEECS) 2012 held at Coimbatore organized by IRD, India on 21st October 2012\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}