{
    "filename": "mbcet.ac.in_faculty_ms-anne-dickson_.html",
    "content": "Dr. Anne Dickson – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nComputer Science & Engineering\n>\nDr. Anne Dickson\nEmployee Code / ID No.\n10208008\nQualifications\nM.Tech\nOrcid ID\nhttps://orcid.org/0000-0001-6288-3740\nIndustry / R & D Experience\n15 years 3 months\nEmail ID\n[email protected]\nAlternate E-mail ID\n—\nMobile No (Optional) / Intercom Extension No.\n—\nAreas of Interest / Current Research\nNetwork Security, Algorithm Analysis and Design, Nature Inspired Computing\nResearch,  Consultancy, Publication\n1) Anne Dickson. Ciza Thomas,”Attack Detetion Availing Feature Discretion Using Rando Forest”, Computer Science & Engineering, AIRCC Publishers, An International Journal(CSEIJ), Vol 12,2022.DOI:10.5121/cseij.2022.12611.\n2)Anne Dickson, Ciza Thomas, Identifying Network Intrusion using Enhanced Whale Optimization Algorithm,Springer series on Advances in Intelligent Systems and Computing, in the International Conference on Intelligent Systems Technologies and Applications ISTA’20, 2020.\n3) Anne Dickson, Ciza Thomas, Analysis of UNSW-NB15 using Machine Learning Algorithms, Springer communications in Computer and Information Science in the Symposium on Machine Learning and Meta-heuristics Algorithms and Applications, SOMMA’20, 2020.\n5) Anne Dickson, Ciza Thomas, Improved PSO for optimizing the performance of intrusion detection systems, in the International Conference (ISTA’19), Second Symposium on Machine Learning and Metaheuristics Algorithms and Applications, 2019.\n6) Anne Dickson, Ciza Thomas, Optimizing False Alerts Using Multi-objective Particle Swarm Optimization Method, IEEE Xlore, IEEE SPICES, 2015.\n7) Anne Dickson, Ciza Thomas, Feasibility of Machine Learning Techniques to reduce false alarms in intrusion detection, International Journal of Computer Science and Mobile Computing,ICMIC 2013.\n8)Marcia Rajan, Bhavya, Hema Joy,Anne Dickson “Automated car parking system using optical character recognition”, IJSER 2020.\n9)Ann Emrita C, Aswani A S, Divya Sylvester, Kavery M S, Lydia Sebastian and Anne Dickson, “Security Using Webcam”, MBCET Journal of Research, Vol.2, April 2013.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—\nAcademic / Professional Outreach Activities\n1) Resource person for the “Workshop on Open Source Programs for Scientific Applications organized by PG and Research, Department of Chemistry, Mar Ivanios College (Autonomous),2020.\n2) Presented a Lightening talk on the topic “Requisite for framing an optical network structure” in the CoCoNet International Conference 2019.\n3) Handled a session on “Machine Learning for Network Security” for CDAC as part of the NetSec research group activity, 2021.\nMembership in Professional bodies/ organizations\n—\nCommunity Outreach Activities\n—\nAwards / Distinctions / Rank / Other Achievements if any\nReceived Best Paper Award from NIT- Trichy for the paper “Attack Detetion Availing Feature Discretion Using Rando Forest”in the International Conference onComputational Intelligence and Paradigms (CLIP ’22).\nAnne Dickson, Ciza Thomas, Improved PSO for optimizing the performance of intrusion detection systems,  Journal of Intelligent & Fuzzy Systems, vol. 38, no. 5, pp. 6537-6547, IOS Press, 2019, DOI: 10.3233/JIFS-179734 (SCI Impact factor – 1.891)(Best paper award).\nArea of interest\nArtificial Neural Network\nDigital Image Processing\nInteractive Computer Graphics\nArtificial Neural Network.\nNetwork Security\nPublications\nAnne Dickson. Ciza Thomas,”Attack Detetion Availing Feature Discretion Using Rando Forest”, Computer Science & Engineering, AIRCC Publishers, An International Journal(CSEIJ), Vol 12,2022.DOI:10.5121/cseij.2022.12611,2022.\n“Automated car parking system using optical character recognition”, IJSER 2020\n“Improved PSO for optimizing the performance of IDS” inJournal of Intelligent& Fuzzy Systems, 2019\n“Optimizing False Alerts using Multi-objective PSO”, 2015.\nMs. Anne Dickson and Ciza Thomas “Optimizing False Alerts Using Multi-objective Particle Swarm Optimization Method”, Signal Processing, Informatics, Communication and Energy Systems (SPICES), 2015.Ann Emrita C, Aswani A S, Divya Sylvester, Kavery M S, Lydia Sebastian and Anne Dickson, “Security Using Webcam”, MBCET Journal of Research, Vol.2, April 2013.\nAchievements of faculty\n:\nReceived best paper award for the research paper published titled “Improved  PSO for optimizing the performance of IDS”in the Coconet International Conference held at IIITMK on December 2019.\nDetails of Faculty as resource person:\nTook a class on “Open Source Programs for Scientific Applications” in Department of PG & Research, Mar Ivanios College on February 8, 2020.\nProfessional Memberships\nExperience\nTeaching: 12 years, 3 months\nWorked as lecturer for one year at St.Xaviers Catholic College of Engineering and Technology\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}