{
    "filename": "mbcet.ac.in_departments_civil-engineering_student-activities_.html",
    "content": "Conferences – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nDepartments\n>\nCivil Engineering\n>\nConferences\nConferences\nICID 2024\nUpcoming International Conference\nICID 2024\nICID 2024\nSecond International Conference on Infrastructure Development, Conducted by the Department of Civil Engineering MBCET, from\nSeptember\n25\nth\nto 27\nth\n, 2024\nfocuses on resilience, sustainability and transformation adaptation in infrastructure. It will be held at Mar Baselios College of Engineering and Technology (MBCET) in Thiruvananthapuram, Kerala.\nICID 2024 aims to address the challenges and opportunities in infrastructure development, considering its crucial role in societal progress and sustainable development goals (SDGs). The conference provides a platform for stakeholders, academicians, practitioners and students to come together to seek solutions and innovations.\nJoin us for three days of insightful discussions, keynote sessions, technical presentations, workshops and networking opportunities.\nFor more details, visit the website:\nhttps://www.icid24.in/\nContact:\nThe Organizers,\nICID 2024,\nMar Baselios College of Engineering and Technology,\nThiruvananthapuram, Kerala, India.\nDr. Jaya S Pillai\n+91 96332 65828\n[email protected]\nDr. Amal Raj\n+91 77366 06107\n[email protected]\nMr. Nitin S\n+91 99957 35762\n[email protected]\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nICID 2018\nThe department of Civil Engineering conducted International Conference on Infrastructure Development: Issues, Innovations &The Way Forward, from 21st to 23rd JUNE, 2018. ICID 2018 was conducted IN ASSOCIATION WITH Kerala Infrastructure Investment Fund Board (KIIFB). ICID 2018 aimed to present the state-of-art in infrastructure development as it exists today, around the world and its applicability in the Indian scenario.\nThe conference was started with three pre conference workshops at different venues. It was inaugurated by Shri G Sudhakaran (Honorable Minister for Public works & Registration, Govt of Kerala) on 21 July 2018.\nThe conference also had an Exhibition open to all on 21 and 22 June, 2018 and Pre-conference workshops on 21 June 2018. The Pre conference workshop included\nWorkshop #1: Sustainable Pavements & Asset Management\nWorkshop #2: Structural Simulations using FEASTSMT Software\nWorkshop #3: A Technical Tour of Greenfield International Stadium, Kerala.\nThe official inauguration of conference was held at Mar Baselios College of Engineering and Technology, (MBCET) on 22 July 2018 by Dr. K. Jayakumar, MD & CEO, Vizhinjam International Seaport Ltd.\nThe key note speakers included\nDr. Rajib B Mallick Professor, Worcester Polytechnic Institute (WPI), Massachusetts, USA.\nDr. T Thyagaraj Associate Professor, Indian Institute of Technology Madras, India.\nDr. Gopu R Potty Professor, University of Rhode Island, USA.\nDr. Santosh G Thampi Professor, National Institute of Technology Calicut, India.\nDr. P K Sikdar President, Intercontinental Consultants & Technocrats Pvt. Ltd., New Delhi, India.\nMr. Immanual Jose Structural Engineer, Eco White/Advent Consulting Engineers, Thiruvananthapuram, India.\nDr. J Murali Krishnan Professor, Indian Institute of Technology Madras, India.\nMr. Shreeganesh V Nair MD, Ganesh Technical Consultancy Services (GTCS), Cochin, India.\nMr. Harikishan Koppula Reddy CEO, Cube Highways, Noida, India.\nThe conference was held with five different streams in Civil Engineering such as Structural, Geo-tech, Hydraulics, Transportation and Environmental Engineering with Keynote lecture from eminent persons around the globe.\nOn July 23, 2018 the valedictory function of the conference was held in Senatus Hall, MBCET with the best paper award and certificate.\nProceedings-\nClickhere\nNASE\nNASE 2019\nNASE 2019\nThe ‘National Conference on Advances in Structural Engineering (NASE 2019)’ was organized by the Department of Civil Engineering, Mar Baselios College of Engineering & Technology, Nalanchira in association with Indian Concrete Institute, Thiruvananthapuram Chapter. The three day conference was conducted from 2\nnd\nto 4\nth\nof May 2019. It was inaugurated by Dr. Rajasree M.S., Vice Chancellor, APJ Abdul Kalam Kerala Technological University. Rev. Fr. John Vilayil, Bursar, presented a memento to the guest of honour.  The inaugural function was presided over by Prof. S Viswanatha Rao, Vice-Principal and Dr. M Satyakumar, Head of the Department of Civil Engineering, welcomed the gathering.\nVarious sessions were handled by eminent personalities from industry, academia and research.\nThe forenoon session on May 2\nnd\nwas handled by Er. Jose Kurien, Team Leader, CDM Smith Pvt.Ltd. on the topic ‘Development of National Standards for Construction Project Management’\nThe afternoon session on May 2\nnd\nwas taken by Dr. N Ganesan, Professor (Retd.), NIT Calicut\non ‘Ultra High Performance Concrete for Durable Structures\nThe first keynote session on May 3\nrd\ndealt with the topic ‘Geopolymer- An Ecofriendly Alternative to Portland Cement’ by Dr. N P Rajamane, Head , CACR, SRM University. A handbook on Geopolymer concrete usage for practicing engineers by Dr. N P Rajamane was also released by Dr. M Satyakumar,Head of the Department of Civil Engineering, after the session.\nThe second session On May 3\nrd\nwas addressed by Dr. M Murugan, Assistant Professor, Government Engineering College, Theni, on the subject ‘Fibre Reinforced Polymer Strengthened Reinforced Concrete Piles under Lateral Loads’.\nAn industry student interaction programme was also arranged on May 3\nrd\nwith a team from UltraTech Cement Limited regarding the New codal provisions for Concrete Mix Design.\nOn May 4\nth\n, the first keynote session was handled by Dr. A K Ashraff, Group Director, SDAG-LPSC on the topic ‘A Brief History of Fracture Mechanics – From Glass to Copper’.\nA workshop on Tekla Software was also conducted on May 4\nth\nby Reliant Institute of Technology.\nNASE 2017\nNATIONAL CONFERENCE ON ADVANCES IN STRUCTURAL ENGINEERING (NASE 2017)\nThiruvananthapuram: The ‘National Conference on Advances in Structural Engineering (NASE 2017)’ was organized by the Department of Civil Engineering, Mar Baselios College of Engineering & Technology, Nalanchira in association with Kerala State Council for Science Technology and Environment, and Indian Concrete Institute Thiruvananthapuram Chapter. The three day conference from 21st to 23rd of February 2017 was inaugurated by Mr. Nitin Agrawal I.P.S., ADGP Crimes, who is also a renowned civil engineer. Rev. Fr. Wilson Thattaruthundil (Bursar, MBCET) presented a momento to the guest of honour.  The inaugural function was preceded over by Dr T. M. George (Principal). and Dr. M. Satyakumar (Head of the Department) welcomed the gathering.\nTalks by various eminent persons were organized for the delegates:\nDr. C.S. Manohar (Professor, IISc Bangalore), handled a session on ‘Uncertainty Modelling and Reliability Analysis’.\nDr. N. Ganesan (Professor, NIT Calicut), handled a session on ‘Non-destructive Testing’.\nEr. Jose Kurian (Team Leader, CDM Smith), handled a session on ‘Signature Bridge’.\nDr. J. Karthikeyan (Professor, NIT Thiruchirapally), handled a session on ‘New Codal Provisions on Pre-stressed Concrete Design’.\nDr. Jaya K. P. (Professor, Anna university Chennai), handled a session on ‘Earthquake Engineering’.\nStudents from various engineering institutions presented their research work.\nAn Experimental Testing Work was organised, which includes testing of RC beams, columns, beam column joints, durability test etc.\nUltraTech Cements conducted a workshop on ‘Mix Design’, during the last day of the conference.\nDr. AjitPrabhu (Joint Director and Nodal Officer, Patent Information Centre Kerala, KSCSTE) released the procceding and Er. VelapgyMadhu Mohan (Chairman, ICI Thiruvananthapuram Chapter) distributed the certificates during the valedictory function.\nNASE 2015-16\n“National Seminar on Advances in Structural Engineering (NASE 15-16)”\nA two day seminar was conducted on advances in structural engineering called “National Seminar on Advances in Structural Engineering (NASE)” on 7th and 8th of April 2016. It was attended by the B.Tech& M.Tech civil engineering students of Mar Baselios and eminent personalities holding key position in various civil engineering establishments delivered the talk. Inauguration was done by\nPadma Shri G Shankar\n, Architect, Habitat Group.\nOther speakers were\nDr. Ruby Abraham, Rtd. Principal, RIT Kotayam on the topic Geo-polymer Concrete\nDr. Saravanan U., Structural Division, IIT Madras on the topic Structural Health Monitoring of bridges\nDr. Smitha M.S., Associate Professor, Civil Engineering Dept., CET on the topic Steel-Concrete Composite Sections\nMr. P. Jayakumar., GM, Civil, Light Metro, DMRC on the topic Light Metro Project\nDr. Sunil Edward., Asst. Professor., Dept. of Architecture, CET on the topic Green architecture\nDr. Narayanan S., Vice Principal and HoD Civil, Mohandas College, Trivandrum, and Former Professor, University Technology Petronas, Malaysia on the topic Load Factor Calibration\nMr. A. K. Asraff, Head, Structural Division, LPSC Valyamala on the topic Structural Plasticity\nBoS\nThe People\nDAB\nFacilities\nNews & Events\nAchievements\nActivities\nFaculty Activities\nConferences\nResearch & Consultancy\nB. Tech PEOs, POs & PSOs\nPlacement\nCurriculum & Syllabus\nTime Table\nFormer HoDs\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}