{
    "filename": "mbcet.ac.in_faculty_ms-anjali-s_.html",
    "content": "Ms. Anjali S – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nComputer Science & Engineering\n>\nMs. Anjali S\nEmployee Code / ID No.\nAC20CS02 / 10220038\nQualifications\nM.Tech\nOrcid ID\nhttps://orcid.org/0000-0001-5798-6227\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9947666052\nAreas of Interest / Current Research\nComputer Vision and image processing\nResearch,  Consultancy, Publication\nSyam, N. E., Vempeny, A. S., Biju, A. M., Abraham, E. M., & Anjali, S. (2024, December). Speech Therapy Assistance through Gamification. In 2024 International Conference on Computing and Intelligent Reality Technologies (ICCIRT) (pp. 1-5). IEEE.\nAnjali, S., and S. Don. “Deep Learning-Based Video Anomaly Detection Using Optimised Attention-Enhanced Autoencoders.” ELCVIA Electronic Letters on Computer Vision and Image Analysis 24.1 (2025): 134-152.\nMs. Anjali. S, Ms.Vinny Pious, Joel J. Sebastian, J. Krishnanunni, Joveal K. Johnson,and Ashik Mujeeb have published a paper entitled “Multi-Stage Fruit Grading System” in the Springer Book series Lecture Notes in Networks and Systems (LNNS, volume 672), Electronic ISSN 2367-3389.\nPresented the paper entitled “Speech therapy assistance through gamification in the IEEE sponsored International conference on Computing and Intelligent Reality Technologies’ organised by Karunya Intitute of Technology and Sciences, Coimbatore, India.\nAdil, A.P., Anandhu, M.G., Joy, J.E., Karethara, T.S., Anjali, S., Poorna, B.R. (2023). Accident Detection in Surveillance Camera. In: Hemanth, J., Pelusi, D., Chen, J.IZ. (eds) Intelligent Cyber Physical Systems and Internet of Things. ICoICI 2022. Engineering Cyber-Physical Systems and Critical Infrastructures, vol 3. Springer, Cham. https://doi.org/10.1007/978-3-031-1849\nPublished the paper ‘Image Segmentation using Level set Based Active Contour Models’, in “The Proceedings of International Conference on Computer Vision and Robotics’ August 2011, Bhuvneshwar.\nPublished the paper ‘Comparative Analysis of Image segmentation methods’ in International Journal of Computer Science Trends and Technology, IJCST- Volume 6 Issue 4/July-Aug 2018.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\nISTE Life time membeship\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\nGATE Qualified (2009)\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}