{
    "filename": "mbcet.ac.in_departments_computer-science-engineering_research-consultancy_.html",
    "content": "Research and Consultancy – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nComputer Science & Engineering\n>\nResearch and Consultancy\nResearch and Consultancy\nResearch Activities\n“\nKSCSTE Student Projects Scheme “\nThe student project proposal entitled ” Parkinson’s Hand Stabilization Device” by Mr. Steve Thomas (S6CS2), Mr. Michael George Thomas(S6CS2), Mr. Kevin George Bino (S6CS2), Ms. Meghna Lekshman (S6CS1) guided by Dr. Jisha John, Associate Professor & Head, Dept of CSE, MBCET got approval for a funding of Rs 40,000/- from the Center of Excellence for Disability Studies for the year 2022-23.\nResearch\nResearch activities are carried out in the department in various fields like data mining, networks, software engineering, image processing and soft computing.\nResearch Groups\nThe department of Computer Science has conducted many seminars and workshops for students and faculties to promote research and there are many R&D activities and consultancy works undertaken by the department. There is a research lab in the department to facilitate and promote research activities.\nThere are three major research groups involved in the research activities namely\nSoftware Engineering\nData Analytics and Image Processing\nNetwork Security\nThe faculties are members of the above groups based on their area of expertise. These groups conduct regular meetings to discuss and decide on the activities to be conducted.\nCollaborative research work\nDept of CSE has initiated a Collaborative research work with the Institute for Communicative and Cognitive Neuro Sciences for developing and ‘Assistive Aid for Autism’ under the guidance of Dr. Tessy Mathew, Ms. Deepa P.L, Dr. Jesna Mohan and Dr. Jisha John. Following students from S4 CSE are also involved in the project: Mr. Rohan Renu John, Mr. Noel John Robert, Mr. Madhav Santhosh, Mr. Reuben Vinod Varghese, Mr. Allen Cyrias, Mr. Shawn Siby George, Mr. Abhijeet and Mr. Nithish G Saji.\nConsultancy and Research Work\nThe student project proposal entitled ” Parkinson’s Hand Stabilization Device” by Mr. Steve Thomas (S6CS2), Mr. Michael George Thomas(S6CS2), Mr. Kevin George Bino (S6CS2), Ms. Meghna Lekshman (S6CS1) guided by Dr. Jisha John, Associate Professor & Head, Dept of CSE, MBCET got approval for a funding of Rs 40,000/- from the Center of Excellence for Disability Studies for the year 2022-23.\nA research project titled ” Electrical Source Localization of epileptic focus ” submitted by  Ms.Elizabeth B Varghese and  Mr.VishnuKumar S in collaboration with Sree Chitra Thirunal Institute for Medical Science  and  Technology has been approved.\nThe project proposal entitled “Envision” Nibin Peter (CS), Akhil R (CS), Sathyajith (CS), Madhav M Nair (EC), Abhiram Anil (EC) by Mr. Raju K Gopalsubmitted underCenter of Disability Studies has been chosen for a financial assistance of Rs. 30000.\nThe project proposal entitled “Akshay A, Anandhakrishnan R.S, Hrishikeshan S, Ivin Vargheseby Ms. Asha S submitted underCenter of Disability Studies has been chosen for a financial assistance of Rs. 20000.\nMore project proposals are submitted by students to CeDS and KSCSTE. KSCSTE: Project proposal entitled ‘CCTV Image processing and Security System’ submitted under the INNOVATE scheme of TECHFEST 2016 has been provisionally chose foance of Rs.15,000/-.\nINHOUSE INTERNSHIP FOR STUDENTS\nFACULTY MENTORS\nPROJECT TOPIC\nDr. Tessy Mathew,Dr. Jesna Mohan\nProstate Segmentation using Deep learning\nMs. Jisha Jose, Dr. Shini Renjith\nAn IOT based secure smart farming\nMs. Anjali S.,  Ms. Vinny Pious,\nAutomated multi parameter fruit grading using machine intelligence technique\nMs.Poorna BR, Dr.Jesna Mohan\nHealth care Recommender system using Hybrid Filtering Technique\nDr. Veena Nair,Ms. Dhanya L.K\nTask Complexity in second language writing. -An analysis using Natural language processing Techniques.\nDetails of Sponsored Research\nSl. No.\nProject Details\nFunding Agency\nPrincipal Investigator\n1\nAccident Alert System\nKSCSTE\nDr. Jisha John\n2\nAutomated Detection of Liver Cancer using Deep Learning\nKSCSTE\nDr. Tessy Mathew\n3\nFood Computer\nCERD\nMs. Anjali C\n4\nHealth care Recommender system using hybrid Technology\nCERD\nMs.Poorna B.R\n5\nAugmented Reality Integrated Smart Math Solver\nKSCSTE\nMs.Poorna B.R\n6\nAnimal Trespassing Detection System\nKSCSTE\nMs.Jisha Jose\n7\nImplementation of an Intelligent Chatbot using Deep Reinforcement Learning\nKSCSTE\nMs.Dhanya L.K\nProjects Sponsored by College\n1.\nAnjali C., Devipriya V.S\nV-Coach\n2018\n2.\nPoorna B. R., Dr.Jesna Mohan\nAndroid Based Mobile Application using Fuzzy Logic for Ensuring safety for women\n2018\n3.\nDr.Jisha John, Aswathy Ravikumar\nComputer Aided Diagnosis for Prostate Cancer\n2018\n4.\nBinu Jose A., Dr.Tessy Mathew\nProstrate Segmentation for MR images using CNN\n2018\n5.\nKiran Baby, Gayathri K S\nNext – Gen News Experience for Augmented Reality Devices\n2018\n6.\nDr.Shini Renjith\nSMART: social media Based Recommender for Tourism\n2018\n7.\nMs. Anjali S  Ms. Vinny Pious\nAutomated Multi-parameter-based fruit Grading Using Machine Intelligence Techniques\n2021\n8.\nMs. Jisha jose Ms. Dr.Shini Renjith\nAn IoT based secure Smart Farming\n2021\n9.\nDr. Veena Nair\nMs. Dhanya L K\nTask Complexity in Second Language writing: An analysis using Natural language Processing Techniques\n2021\nKSCSTE Student Projects Scheme\nThe following student projects from the department of CSE got selected for funding by the Kerala State Council for Science – Technology and Environment (KSCSTE). The publication grant is provided under the ‘Student Project Scheme’ supported by the Department of Science and Technology, Govt of India. The projects were selected as the top 12 on a merit basis among various student projects submitted for Student Project Scheme from different colleges across the state.\nThe project titled, ‘Accident Alert System’ by Ms. Aswathy Ravikumar as the Principal Investigator and the team includes Advaith U., Alen S., Joveal K. Johnson, Kesia Mary Joies, and Rahul Sunil, and supported by Dr. Jisha John and for the project.\nThe project titled, ‘Automated Detection of Liver Tumor Using Deep Learning ‘ by Dr. Tessy Mathew as the Principal Investigator and the team includes Abhijith V., Biju M., Gopakumar S., Gomez S.A., Mathew T. (2021 passout).\nThe project titled, “Augmented Reality Integrated Smart Math Solver”, by Ms. Poorna.BR, Assistant Professor (Principal Investigator) and Mr. Abraham Tony Itty, Mr. Gokul Krishna JK, Mr. Gokul Krishna B, Mr. Jayaram R (Student Investigators).\nThe project titled, “Animal Trespassing Detection System”, Mrs. JISHA JOSE, Assistant Professor (Principal Investigator) and Anand Vinod, Mr.Mridhul Madhu, Mr. Roshan Daniel, Mr. Anand Rakesh (Student Investigators).\nThe project titled, “Implementation of an Intelligent Chatbot using Deep Reinforcement Learning”, – Mrs. DhanyaL.K, Assistant Professor (Principal Investigator) and Ms. Athira Susan George, Ms. Gowri Muralikrishnan, Ms. Leya Rachel Ninan, Mr. Pranav S Varrier(Student Investigators).\nCERD STUDENT PROJECT\nThe student project “Identifying texting idiolects using transformer” guided by\nDr.Tessy Mathew\n(HOD and Associate Professor,CSE) has been approved for CERD funding.The team members are Bharath TU,Kavya Suresh,Sikha Shaji and Subalesh S of S8 CSE.\nCERD FACULTY PROJECT\nThe faculty project proposal  “Health care recommender system  using hybrid filtering technique “ by\nMs. Poorna B.R, Asst.Professor,CSE\nhas been approved for CERD funding.\nResearch Group Activities\nData Analytics Group Activities\nOPENLABS.AI\nOpenlabsai, the AI club of Mar Baselios College of Engineering and Technology under the Department of Computer Science and Technology, has started the StudyJam 2021, a closed group AI learning program. The program covers key topics like python libraries, machine learning and deep learning along with mini projects and a group project after the completion of the program. The sessions are handled by the technical team of Openlabs.ai headed by Kesia Mary Joies of S6 CS1. The kick-off session was conducted on August 26, 2021 and an introduction to AI and ML was made. The StudyJam sessions are conducted every Thursday from 6:00 to 8:00 pm. There are a total of 21 participants for this year’s StudyJam from the departments of CSE, EC and EEE.\nOpenlabs.ai club launched a monthly talk series named TRAJECTAI in April, 2021 which is open to students and faculties of any college, and so far have completed 2 episodes of the talk series. It aims to spread knowledge about AI in a short and crisp manner. The first session, “An introduction to AI” was held on May 1, 2021. Mr Christy Abraham Joy, Data Scientist at IQVIA was the resource person for the session. The second session, “Overview of Computer Vision, NLP and time series forecasting” was held on June 12, 2021. Mr. Dheeraj Challil, Machine Learning Engineer (Intern) at ApesAI was the resource person for the session\nTALK SERIES ORGANIZED BY DATA ANALYTICS GROUP\nTopic\nDate\nResource Person\nVenue\nCNN using Matlab\nDeepa P.L\nKnowledge Lab\nRole of Linear Algebra in Data Mining\n02/08/2019\nAswathy Ravikumar\nKnowledge Lab\nMathematical Concepts in Dimensionality Reduction using PCA and its Applications in Clustering\n27/08/2019\nShini Renjith\nKnowledge Lab\nGenetic Algorithm and its Applications\n27/9/2019\nAnjali C\nKnowledge Lab\nRecurrent Neural Networks\n04/10/2019\nDr. Tessy Mathew\nKnowledge Lab\nDeep Learning over Traditional Machine Leraning\n01/11/2019\nJesna Mohan\nPG Lab\nHow to prepare data for Machine Learning\n22/11/2019\nDr. Tessy Mathew\nPG Lab\nPrincipal Component Analysis for Dimensionality Reduction\n29/11/2019\nShini Renjith\nPG Lab\nMathematical Concepts in Convolution\n06/12/2019\nProf Joseph Cherian\nPG Lab\nIntroduction to Linear and Logistic Regression\n09/01/2020\nProf Joseph Cherian\nKnowledge Lab\nA four-day workshop on Machine Learning and Deep Learning was organised by the ACM student’s chapter, MBCET in association with the Department of Computer Science and Engineering on September 20\nth\n& 21\nst\nand November 9\nth\n& 10\nth\n, 2019. The workshop was coordinated by the ACM chapter coordinator, Ms. Shini Renjith, Asst. Professor, Dept. of CSE. The course focused on the advanced topics of Machine Learning and Deep Learning and was targeted for the BTech students. The workshop came to an end with project presentations by the participants based on the theoretical and hands on sessions imparted during the course.\nInitiated a talk series with its first session on the topic “Familiarization of Deep Learning Tool box in Matlab” by Ms. Deepa P L, Assistant Professor, Department of ECE, MBCET on 30\nth\nJuly 2019.\nReport on National workshop on Advanced Deep Learning\nThe department of Computer Science and Engineering Mar Baselios College of Engineering and Technology Trivandrum has organized a three day national workshop on Advanced Deep Learning from May 20\nth\nto 22\nnd\n2019. The sessions were handled by eminent members from Benett University. There were 35 participants from various institutions in India.\nMBCET has joined hands with Bennett University as a lead zonal partner to inculcate skills for faculty and students in deep learning, machine learning and artificial intelligence. Dr.Tessy Mathew, Dr.Vishnukumar S, Dr.Jisha John, Ms.Aswathy Ravikumar and Mr. Binu Jose from the Data Analytics Group of CSE department has been nominated for doing project in these areas for Bennett University.\nDepartment of Computer Science and Engineering in association with ISTE organized a two day workshop on “Introduction to Machine learning and AI” for under graduate students on 30th and 31st July, 2018.\nData Analytics Group from department of CSE in association with IEDC organized a two day Faculty Development Programme on “Artificial Intelligence and Machine Learning” on 12th and 13th July 2018. The workshop was coordinated by Mr. Binu Jose and Ms.Aswathy Ravikumar.\nA one week workshop on “Machine Learning- Training the Trainers” organized by Additional Skill Acquisition Programme, Department of Higher Education, Governemnt of Kerala from 16th to 21st July 2018 at MBCET. The workshop was coordinated by   Mr. Sandeep S R.\nNetwork Security Research Group(NetSec) Activities\nCLOUD: WANT TO SHIP CONTAINERS\nAn invited expert talk on cloud computing ” CLOUD: WANT TO SHIP CONTAINERS ” was organized by Department of CSE in association with netsec research group for the third year cse students on 22 Dec 2021. Resource person: Ms. Devipriya VS, Research Scholar, VIT.\nCyber Security\nCybersecurity Webinar\nThe Department of Computer Science & Engineering and the Network Research group of MBCET are jointly organizing a series of webinars as part of the Cybersecurity Awareness Month on October. The second webinar was conducted on 18th October 2021 at 3.00 PM on the topic “Security in Social Networks”. The Speaker was Ms. Indu V (Assistant Professor, Department of CSE, MBCET).\nIEEE Computer Society Student Branch in association with Department of Computer Science and Engineering (NetSec  Group) of Mar Baselios College of Engineering and Technology conducted an online Webinar on “\nAzure Cloud Computing\n” on 12\nth\nJune 2021.The Webinar was driven by Mr. Mahesh Markose J ,Alumnus of  CSE  MBCET (2014- 2018 batch),Skilled expert and Associate consultant in Microsoft.Coordinator\n: Ms.Jisha Jose\nWEBINAR ON APPLICATIONS OF BLOCKCHAIN – A REPORT\nThe Department of Computer Science and Network Security Research group in association with ISTE MBCET chapter organized a webinar on\n“Applications of Blockchain”\non 10\nth\nJuly 2021 from 10 AM to 11 AM. The resource person for the event was Mr. Goutham Krishna, senior blockchain developer at Accubits Technologies, Trivandrum and an alumnus of our college of the 2013-2017 batch. The session was attended by 38 participants from interdisciplinary domain. The resource person started by giving an introduction to Blockchain, Bitcoin, and security aspects of Blockchain. He also differentiated the use of a secured traditional database and blockchain. Speaker gave a clear idea on the use cases of blockchain like supply chain, fraudulent detection, decentralized finance etc., He also gave a roadmap to start with Ethereum including Geth, Solidity, Truffle, Hardhat etc. The event was coordinated by\nMs. Gayathri K S,\nAssistant Professor, Department of CSE.\nOrganised webinar on “\nEvading Social Engineering Attacks:COVID’19”\nin association with CSI MBCET student chapter on 21\nst\nJULY 2020.\nIEEE Computer Society Student Branch in association with the Department of Computer Science and Engineering (NetSec Group) of Mar Baselios College of Engineering and Technology conducted an online webinar on “\nIntroduction of Git and GitHub\n” on 1\nst\nof September,2020\nThe research group of Computer Science and Engineering conducted a one day workshop on cloud computing on January 25\nth\n.The expert team  was from In-app Information Technologies .The workshop was coordinated by MS. Anne Dickson\nOrganized an Industrial Visit to UST Global on 20\nth\nMarch 2019 in association with ISTE. Ms. Asha S, Mr. Shibu V S, Ms. Devipriya V S, Ms. Divya R S, Ms. Gayathri K S and selected students from second and fourth semester CSE went for the IV.\nOrganized an Industrial Visit to Infosys on 29\nth\nMarch 2019 in association with ISTE. Ms.        Anne Dickson, Ms. Merin Kuriskose, Mr. Shon J Das, Ms. Kiran Baby and selected students from sixth semester CSE went for the IV.\nAn expert lecture on “Block Chain Technology” was organized by Network Security Research Group (NetSec) for S7 students on 13th August 2018. Mr. Jikku Jose, Co-Founder, Qucentics was the Speaker for the Expert Lecture.\nNetwork Security Research Group (NetSec) from department of CSE in association with IEDC, ACE(Association for Computer Engineers) organized a three day awareness programme on “Network and Information Security” from 9 to 11 July, 2018. The Programme was coordinated by Ms. DeviPriya V S.\nDepartment of Computer Science and Engineering organized a one week Faculty Development Programme on “Recent & Emerging Trends in Networks and Security(RETINAS’18)” from 23 to 27, April 2018. The FDP was coordinated by Mr.Shon J Das and Ms. Merin Kuriakose.\nConsultancy Activities\nEXPERIENCED RECRUITMENT THROUGH CAMPUSES\nParties Involved:\nThis consultancy agreement was executed on\nJanuary 10, 2025\n, between:\nClient\n:\nSimple Logic Solutions Pvt Ltd\n, Trivandrum, represented by COO, Mr. Pradeesh Kumar M.S.\nConsultant\n:\nMar Baselios College of Engineering and Technology (MBCET)\n, Thiruvananthapuram, represented by the Principal.\nNature of Consultancy Work:\nThe project titled\n“Experienced Recruitment Through Campuses”\naims to develop a digital recruitment platform that facilitates the hiring of experienced professionals via campus drives. The\nDepartment of Computer Science and Engineering, MBCET\n, was entrusted with designing and delivering key modules of the system.\nStudent Members from MBCET\nJohann Luke John\nThriambak S\nSanjith Brijmohan\nSameer Sha S\nFaculty mentors:\nMs. Prathibha S Nair, Dr. Priya Mariam Raju\nMoU's\nMoU\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nMOU SIGNED BETWEEN MAR BASELIOS COLLEGE OF\nENGINEERING AND TECHNOLOGY AND ADDITIONAL SKILL ACQUISITION PROGRAMME KERALA\nAn MOU was signed by  MBCET with Additional Skill Acquisition Programme Kerala, a State Public Sector Undertaking fully owned by Government of Kerala under Higher Education Department on 23\nrd\nApril 2025. Smt.  Preethy Leonold, Head Procurement, ASAP Kerala, and Dr. S. Viswanatha Rao, Principal, MBCET signed the MoU. Sijeesh P. I , Associate Director Training Division and Ms. Janaki Venukumar,  Product Head Training Division, ASAP Kerala were also present in the function. This partnership strengthens industry collaboration while providing access to industry-relevant skill training, certified trainers, and internship opportunities that significantly enhance employability and enrich learning experiences for both students and faculty.\nMOU SIGNED BETWEEN MAR BASELIOS COLLEGE OF ENGINEERING AND TECHNOLOGY & ALIBI GLOBAL PRIVATE LIMITED\nAn MOU was exchanged between\nMBCET\nand\nAlibi Global Private Limited\non 3\nrd\nApril 2025.\nShri. Bhadran V. K.\n, Director Alibi Global Private Limited and\nDr. S. Viswanatha Rao\n, Principal, MBCET signed the MoU.\nDr. Sunil S. P.\n, Director Operations and\nMs. Manju S. L.,\nHR Head\n,\nfrom Alibi Global were also present in the function\n.\nThis partnership marks a significant step toward bridging the gap between academia and industry, opening doors for collaborative research, skill development, internships, and enhanced learning opportunities for students and faculty.\nMoU Signing Between Mar Baselios College of Engineering and Technology & Simple Logic Solutions Pvt. Ltd.\nMar Baselios College of Engineering and Technology (MBCET) has signed a Memorandum of Understanding (MoU) with\nSimple Logic Solutions Pvt. Ltd\n. on February 3, 2025. Simple Logic Solutions, a Startup India-registered company funded by the Government of India through Nidhi Prayas, is based in Thiruvananthapuram, Kerala. The company specializes in Research & Development, Quality Assurance, Custom Application Development, and Biomedical Solutions. Their biomedical projects are incubated at Manipal.\nAs part of this collaboration, a consultancy agreement has also been established between the Department of Computer Science and Engineering (CSE) and Simple Logic Solutions. Under this initiative, the Department of CSE is actively engaged in a project titled “Experienced Recruitment through Campuses.” This project aims to streamline recruitment processes, enhance collaboration between academia and industry, and create more opportunities for experienced professionals.\nThe project is being carried out by the 6\nth\nSemester students:\nMr. Johann Luke John\n,\nMr. Thriambak S.\n,\nMr. Sanjith Brijmohan\n,\nMr. Sameer Shah S.\n, &\nMr. A. V. Abhinav\n. The students are mentored by\nMs. Prathibha S. Nair\nand\nDr. Priya Mariam Raju\n, (Assistant Professors, Department of CSE).\nNON-DISCLOSURE AGREEMENT WITH CDAC\nThe Department of CSE, MBCET has signed a non-disclosure agreement with CDAC on 21st June 2023. This is to enable data set sharing as part of the collaborative project work on AI and Machine Learning.\nMoU SIGNED WITH ICCONS\nThe department of CSE, MBCET has signed an MoU with ICCONS on 26th June 2023.  This will facilitate  collaborative research,  teaching and learning, and engagement for promoting inclusivity and  access to knowledge in the domains of mutual interest.\nMoU SIGNED WITH UST GLOBAL\nThe Department of CSE, MBCET has initiated an MoU with UST on 9th May,2023 at 11.30 am. They will be facilitating an industry supported lab, internship opportunity for students and technical support as a part of the MoU.\nMoU WAS SIGNED BETWEEN AJMAN UNIVERSITY, UAE AND MBCET\nMoU was signed between AJMAN UNIVERSITY, UAE AND MBCET on 18th July 2022. The purpose of this MOU is to formally express the common interest of Ajman University and MBCET to develop academic and educational cooperation in areas like Artificial Intelligence, Data Science, Cyber Security and Forensics, Cloud Computing\nRENEWAL OF  MoU BETWEEN MBCET AND  ICT ACADEMY\nMar Baselios College of Engineering and Technology renewed Academic Premium Membership with ICT Academy. Membership duration will be 1st August 2021 to 31st July 2022\nSigned MoU between Accubits and MBCET\nAccubits Fellowship Program (AFP) 2021:AFP follows a student-business fellowship program and is aimed at creating a generation of young entrepreneurs, scientists, and technologists equipped with the skills and knowledge in solving today’s problems with cutting-edge technologies. By being a part of this initiative, students will get exposure to industry-relevant scenarios along with hands-on experience.Launching of\nAccubits Fellowship Program (AFP) 2021\nand Induction program for the first year students (All branches) was held on 19/07/2021.Dr. Abraham T Mathew inaugurated the session.During the session the importance and experience of building a startup & Overview of AFP was covered.Point of Contact :Mr. Ramjith RP, Assistant Professor CSE\nIBM Speciality Lab\nin Emerging Technologies at MBCET\nMs. Shini Renjith\nhas coordinated setting up the\nIBM Speciality Lab\nin Emerging Technologies at MBCET. This includes an MoU with IBM India Pvt Ltd for conducting internationally valid training courses for students on the topics of Cyber Security, Data Science and Artificial Intelligence. The average duration for each course will be 50 hours which will include 25% concepts, 35% technologies and 40% group work activities. A total of 200 students are enrolments for this IBM skill academy course.\nMOU BETWEEN C-DAC AND MBCET\nAn\nMoU\nis made between\nC-DAC and MBCET\non 15, February 2021. C-DAC(T) has expertise in numerous areas of Electronics, Communication, Computer Science etc. C-DAC(T) can support MBCET for expert lectures, invited talks, staff and student training, industrial visits, sharing R and D projects etc.\nMoU signed with Curvelogics on 28th June 2019 for projects, internships and research related activities\nFaculty interaction with outside world\nMs. Vijitha Robinson, Asst. Professor, Dept. of CSE served as a resource person for the sessions on ” Numerical methods using CPP” for the MSc students of the Department of Physics at Mar Ivanios College, Trivandrum on Wednesday, 7th May 2025.\nDr. Neena Raj N. R., Assistant Professor, Dept. of CSE served as session chair on 24\nth\nMay 2025 for\n6th IEEE International Conference on Control, Communication and Computing-ICCC25\n, organized by College of Engineering, Trivandrum.\nDr. Jesna Mohan, Associate Professor, Dept. of CSE served as session chair on 25\nth\nMay 2025 for\n6th IEEE International Conference on Control, Communication and Computing-ICCC25\n, organized by College of Engineering, Trivandrum.\nVISIT TO DIGITAL UNIVERSITY\nDigital University of Kerala  hosted Dr. Koiti Hasida Director Decentralized Big Data Team & RIKEN Center for Advanced Intelligence Project (AIP), Japan and Ms. Sarada Balachandran Sumadevi, Scientist at RIKEN Center for Advanced Intelligence Project (AIP), Japan along with Dr. Tessy Mathew, Professor Computer Science Engineering and Dr Nidhi M B, Professor Mechanical Engineering,  Mar Baselios College of Engineering and Technology (Autonomous) | Thiruvananthapuram | Kerala.\nVISIT TO NISSAN\nNissan Digital India LLP hosted Dr. Koiti Hasida Director Decentralized Big Data Team & RIKEN Center for Advanced Intelligence Project (AIP), Japan and Ms. Sarada Balachandran Sumadevi, Scientist at RIKEN Center for Advanced Intelligence Project (AIP), Japan along with guests from our academic partner institute, Dr. Tessy Mathew, Professor Computer Science Engineering and Dr Nidhi M B, Professor Mechanical Engineering,  Mar Baselios College of Engineering and Technology (Autonomous) | Thiruvananthapuram | Kerala.\nMs. Jisha Jose\n, Assistant Professor, Department of CSE served as a resource person for the  “\nFamiliarisation and Demonstration of 8086 Microprocessor\n” sessions conducted for the fourth semester MSc Physics students of the Department of Physics, Mar Ivanios College (Autonomous), Thiruvananthapuram, on 21.03.2025 and 27.03.2025.\nSERVED AS JUDGE\nMs. Deepthi K. Moorthy\n, Assistant Professor, Department of CSE served as the Judge for the Paper Presentation hosted by Mohandas College of Engineering and Technology on 21/3/2025.\nDr. Tessy Mathew\n, Professor, Dept. of CSE, Mar Baselios College of Engineering and Technology  chaired a session in the International Conference on Emerging Technologies for Intelligent Systems ETIS 2025) organized by APJ Abdul Kalam Technological University during 7th to 9th February 2025, at Mar Baselios College of Engineering and Technology, Thiruvananthapuram, Kerala, India.\nDr. Merlin George\nfrom the Department of Computer Science & Engineering led a seminar for PhD, PG, and UG students at Chanakya University, Bangalore, on 27/02/2025, titled “When Healthcare Meets Blockchain: The Future of Secure and Smart Patient Care.” The session highlighted blockchain’s role in enhancing data security, empowering patients, and streamlining healthcare operations, offering insights into the future of a smarter and more secure healthcare ecosystem.\nDr. Merlin George\n, Assistant Professor, Department of Computer Science and Engineering, served as a resource person at the National Workshop on Blockchain in Health Care organized by the Department of Computer Science, Central University of Kerala, Kasaragod, on January 21, 2025. The session focused on the transformative potential of blockchain technology in the healthcare sector, engaging participants from both academia and industry.\nATTENDED INTERNATIONAL SEMINAR\nDr. Tessy Mathew, Dr. Jesna Mohan, Mr. Ramjith R P, Dr. Dishore S V attended two days international seminar on “Bharatiyasastra and Samskrtam: Bridging Traditional Wisdom & Modern Innovation for Vikasit Bharat” held at Rajiv Gandhi Centre for Biotechnology Poojappura. Resource persons include more than 10 Vice Chancellors from different universities in India, NIT Calicut director, NAAC chairman, UGC Secretary etc. Mr. Ramjith R P was a coordinator for this seminar.\nDr. Jesna Mohan, Associate Professor, Department of CSE, attended a workshop for designing a foundation module in Computer Science Engineering on 21.11.24, organized by K-DISC under Kerala Knowledge Economy Mission.\nThe Department of Computer Science and Applications at Christ Nagar College, Maranalloor, in collaboration with the Computer Society of India (CSI), organized an Expert Lecture Series on Natural Language Processing (NLP) on October 28, 2024.\nDr. Tessy Mathew\n(Professor, Dept. of Computer Science and Engineering) delivered an insightful session, covering key concepts and advancements in NLP.\nDr. Merlin George\n, Asst. Professor, Department of Computer Science and Engineering and\nMr. Vipinkumar K.C.\n, Chief Operating Officer for Corporate Relations, participated in the recent\nCII She Leads Business Conclave\n, representing our institution. The event featured inspiring sessions led by prominent businesswomen who shared their journeys and insights on resilience, innovation, and leadership.\nDr. Jisha John (HoD), Dr. Tessy Mathew, Prof. Raju K Gopal, and Mr. Shon J Das, Dept of CSE, visited The Liquid Propulsion Systems Centre (LPSC) , Valiayamala on 21.10.2024, for discussions regarding prospects of collaboration for their upcoming conference NetACT24.\nDr. Jisha John and Dr. Jesna Mohan attended the meeting convened at ICCC ( Integrated Command and Control Centre) to discuss about the projects initiated by the Department of CSE, MBCET with Smart City. A demo of the projects was given by the students to the officials.\nDr. Jesna Mohan, Associate Professor, Department of CSE served as resource person for the Faculty Development Program (FDP) on Deep Learning models and its application organized by Noorul Islam Centre for Higher Education on 21 May 2024.\nDr. Jisha John, Dr. Tessy Mathew, Dr. Anne Dickson, and Prof Raju K Gopal along with students of computer science and engineering visited CDAC on 6th May,2024 for a discussion on the collaborative project work being done with MBCET. During the meeting, the potential areas of research and contribution of MBCET to the field of private 5G were explored, with a specific focus on the development of the 5G Core Architecture. The possibility of submitting additions to the 5G Core Architecture for standardization was also discussed.\nDr. Jesna Mohan\n, Associate Professor, Department of CSE, served as the session chair, at the International Conference on\n“FOSS Approaches towards Computational  Intelligence and Language  Technology “\norganized  by ICFOSS on 22/03/2024.\nDr. Tessy Mathew , Professor, Department of CSE  was the external examiner for  PhD public Viva-Voce at Mahindra institution, Anna University, Chennai on 22\nnd\nMarch, 2024.\nMs. Dhanya L K\n(Assistant Professor, Dept of CSE)  was a Reviewer at the International Conference on FOSS Approaches towards Computational Intelligence and Language Technology (FOSS-CIL T24), organised by International Centre for Free and Open Source Solutions (ICFOSS) held on 21st and 22nd March 2024.\nMs.Asha S.\n(Associate Professor),\nMs. Poorna B. R.\n,\nMs Gayathri K. S.\n, Assistant Professors, Department of Computer Science and Engineering and\nMs. Shilpa Susan Peter\n, Assistant Professor, Department of Electrical and Electronics Engineering attended the 34\nth\nAnnual Faculty Convention of ISTE Kerala section on 20-1-2024 at FISAT,Angamaly.\nMr. Shibu V. S.\nAsst. Professor, Department of Computer Science and Engineering served as resource person on “Advanced C Programming” for the placement training programme for the S6 Computer Science students held at at FISAT Engineering College, Angamaly.\nMs. Dhanya L K,\nAssistant Professor, Department of Computer Science and Engineering, served as the resource person for the 2-day workshop on Machine Learning Using Python, for the S3 and S1 BCA Students at Christ College, Vizhinjam, on the 18th & 19th of October 2023.\nDr. Neena Raj N R\n, Assistant Professor, Department of CSE served as resource person for the workshop on “Let’s Learn LaTex” organized by Department of Computer Applications Christ College Vizhinjam on 25th October 2023.\nMr. Robin Joseph\n, Assistant Professor, Department of CSE served as resource person for the Placement Training Programme organized by CGP Career Avenues, from 14\nth\nAugust 2023 to 16\nth\nAugust 2023.\nDr. Jesna Mohan\n, Assistant Professor, Department of CSE served as resource person for the workshop on “Unlock Technology on Computer Vision” organized by HI team, National Institute of Speech and Hearing on 7th August 2023.\nMs. Deepthi K. Moorthy\n, Asst. Professor, Dept. of CSE, served as the resource person for the add-on course on “Computer Training for Law Students” organized in  collaboration with Mar Baselios College of Engineering and Technology, and IQAC of Mar Gregorios College of Law, at Mar Gregorios College of Law, on 21\nst\nJuly 2023.\nMs. Vijitha Robinson\n, Asst. Professor, Dept. of CSE, served as the resource person for the session on “Functions, Pointers and Files in C” organized by the Department of Mechanical Engineering at College of Engineering, Trivandrum on 10th July 2023.\nMs. Jisha Jose & Mr. Shon J Das\n, Assistant Professor, Department of computer science and engineering served as resource persons on the topic “Familiarization and Demonstration of 8086 Microprocessor” to 4th semester MSc Physics students on  14/6/2023 and 15/6/2023 at the Department of Physics, Mar Ivanios College (Autonomous), Thiruvananthapuram.\nMs. Dhanya L K\n, Assistant Professor, Department of Computer Science & Engineering handled a session on “Deep Learning in NLP” on 15th May 2023, in the 12 day long training programme on “Summer School 2023”, organized and conducted by the International Centre for Free and Open Source Solutions (ICFOSS).\nMs. Asha S.,\nAssociate Professor, Department of CSE served as a resource person for the session on “Cloud Computing in Smart Grid” in the STTP on Smart Grid Technologies, organized by the Department of Electrical and Electronics Engineering, MBCET.\nDr. Tessy Mathew\n, Professor, Department of CSE and Dr. Jesna Mohan, Assistant Professor, Department of CSE served as resource persons for the hands-on session on AI in the STTP on\nSmart Grid Technologies\n, organized by the Department of Electrical and Electronics Engineering, MBCET.\nMr. Shibu V. S. and Mr. Robin Joseph\n, Assistant Professors, Department of CSE served as resource persons for the placement training programme held at TKM College of Engineering, Kollam on 28th March,2023 and at LBSITW from 29th March to 31st March,2023.\nDr. Tessy Mathew\n, Professor, Department of Computer Science and Engineering, has delivered an invited lecture on  the topic “Data Analytics” in the BODHI Interdisciplinary Seminar Series 2023, organized by the PG Department of Mathematics and Department of Statistics, Kumbalathu Sankupillai Memorial Devaswom Board College on 13-3-2023.\nMs. Deepthi K Moorthy, Ms. Lino Zachariah, Ms. Vishagini V and Ms. Gauri shree VK\n, Assistant Professors, Department of Computer Science and Engineering handled the sessions for the “Add-On Course on Computer Training for Law Students” organized at the Centre for Skill Development and Entrepreneurship of Mar Gregorios College of Law, Thiruvananthapuram, from  13th March 2023.\nMr. Shibu V. S,\nAssistant Professor, Department of Computer Science & Engineering, served as the resource person for the session on “Wireshark” at TKM college of Engineering, Kollam for the sixth semester computer science and engineering students, on 28th February 2023.\nDr. Tessy Mathew\n, Professor, Dept. of CSE, served as the Chief Guest at the Valedictory function of Computing Fest at Sarvodaya Vidyalaya, Thiruvananthapuram, on 3rd March 2023.\nMs. Dhanya L. K.\n, Asst. Professor, Dept. of CSE, served as a reviewer at the International Conference on FOSS Approaches towards Computational Intelligence and Language Technology (FOSS-CIL T23), organized by International Centre for Free and Open-Source Solutions (ICFOSS) held on 22nd and 23rd February 2023.\nMr. Ramjith R P\n, Assistant Professor, Department of Computer Science & Engineering handled session on “Telecommunication in modern era” on 23rd February 2023, conducted by the Kerala Police Telecommunication department.\nMs. Dhanya L K\n, Assistant Professor, Department of Computer Science & Engineering handled a session on “Neural Machine Translation” on 14th February 2023, in the 12-day long training programme on “Winter School for Women 2023”, organized and conducted by the International Centre for Free and Open Source Solutions (ICFOSS).\nMs. Sreeja S. R\n, Assistant Professor, Dept. of Computer Science & Engineering, handled a session on “Reinforcement Learning – An integration of Artificial Intelligence and Neuroscience” organized by the Department of Computer Science and Engineering, Amrita School of Engineering and Technology, on 16th January 2023.\nDr. Tessy Mathew, Dr. Jesna Mohan and Dr. Jisha John\n, Dept of CSE were resource persons for the 5 day FDP on “Artificial Intelligence” – based on KTU S7 B. Tech CSE Syllabus, organized by CSE department of Lourde Matha College of Engineering &Technology from 26 to 31st August,2022.\nMs.Jisha Jose\n, Assistant Professor,  Department of computer science and engineering has been a resource person for “Familiarisation and Demonstration of 8086 Microprocessor”  to 4\nth\nsemester  MSc Physics students on 21.7.2022 and 22.07.2022 at the Department of Physics, Mar Ivanios College (Autonomous), Thiruvananthapuram.\nMs. Dhanya L K\n, Assistant Professor, CSE department delivered a session on “Text analytics” as part of Summer School 2022, which was scheduled  from 4th May 2022 to 17th May 2022 on the  theme “\nApplied NLP and Unstructured Data Analytics”\norganized by International center for Free and open-source software.\nDr. Jesna Mohan\n, Assistant Professor, Department of CSE was the resource person for the AICTE sponsored 5 days Online Short-Term Training Programme on\n“HIGH-PERFORMANCE COMPUTING AND DEEP LEARNING FOR IMAGE AND TEXT ANALYSIS SESSION-2”\norganized by the Department of Computer Science and Engineering, Mar Baselios College of Engineering. The program was open to Faculty, Research Scholars of Engineering Colleges, Universities, and other allied disciplines and Industry persons.\nMs.\nIndu V\n, Asst. Professor, Dept. of CSE served as Judge for the DuK Innofest conducted by the Innovation Club of Kerala University of Digital Sciences, Innovation and Technology(Digital University Kerala) on 27\nth\nMarch 2022 as part of the Smart India Hackathon (SIH) which is a flagship event organized by the Ministry of Human Resource Department. The main aim of the event was to encourage students to find innovative solutions to the societal problems around them based on the problem statements provided by SIH2022 on various themes on Blockchain, Cybersecurity, Disaster Management, Smart Automation and Green Technology.\nMr. Robin Joseph, Asst. Professor, CSED, MBCET Served as External Inspector for evaluation of Computer Teachers of St.Thomas Schools on 22 Feb 2022.\nMs. Elizabeth B Varghese, Asst. Professor, CSED, MBCET handled a hands-on session on “Machine Learning with Python” on 19th February 2022 as a part of the workshop on “Artificial Intelligence and Applications” organized by Department of Computer Applications in association with IEDC and IIC of St. George’s College, Aruvithara.\nMs. Indu V, Asst. Professor, Department of CSE, MBCET delivered a talk on the topic ” Information Security” on 19th January 2022 as part of the Virtual IT\nCadre Training Program for the officials from the Registration Department, Government of Kerala at the Kerala University of Digital Sciences, Innovation and Technology (Digital University, Kerala).\nA paper titled ‘An Empirical Research and Comparative Analysis of Clustering Performance for Processing Categorical and Numerical Data Extracts from\nSocial Media’ authored by Dr. Shini Renjith, Asst. Prof, Dept. of CSE, Dr. Sreekumar A., Professor,  CUSAT and Dr. Jathavedan M, Emeritus Professor, CUSAT, has been accepted for publication in the peer reviewed SCIE and Scopus indexed, open access Journal Acta Scientiarum – Technology , published by UEM (State University of Maringá, Brazil).\nMs. Sreeja. S. R, Assistant Professor, Department of Computer Science and Engineering presented her work entitled “A study on Parkinson’s Disease under the context of Reinforcement Learning” in the 8th Annual Conference on Cognitive Science, from 20-22\nth\nJan 2022\nDr Jesna Mohan (Asst. Professor, CSE, Mbcet) and Mr Robin Joseph (Asst. Professor, CSE, Mbcet) were the resource persons for the AICTE-ISTE sponsored faculty development program on AI in power and energy utilities organized by the Dept of EEE from 18 – 24 January 2022\nMs. Elizabeth B Varghese, Asst. Professor, Department of cse delivered an expert talk on the topic “Smart Video Surveillance and Its Research Trends ” on 16th December 2021 to the M.Tech and Ph.D. students of Kerala University of Digital Sciences, Innovation and Technology (Digital Unive*rsity, Kerala).\nMs. Indu V, Asst. Professor, Department of cse delivered an expert talk on the topic “Social Networks: Research Opportunities and Challenges” on 17th December 2021 to the M.Tech and Ph.D. students of Kerala University of Digital Sciences, Innovation and Technology (Digital University, Kerala).\nMs Dhanya L K, Asst Professor, Department of Computer Science and Engineering delivered a session in the Faculty Development Program of College of Engineering, Thalassery on “Unstructured data Analysis” which is scheduled to be held from 8th to 12th November 2021\nMs.Devipriya V.S\n(Asst.Professor,CSE)and Ms.Asha S  (Associate Professor,CSE) delivered sessions on the topics\nCyber security  and Cyber forensics\nrespectively for the webinar session organized in conjunction with the 2\nnd\nInternational Conference on Information Security and Computer Technology (ICISCT)during 24-25 July ,2021.\nMs.Anne Dickson\n(Asst.Professor,CSE)delivered a session on ” Machine learning ” for CDAC as part of NetSec research group activity on 22/7/21.\nDr.Tessy Mathew\n(HOD and Associate Professor,CSE)delivered an expert lecture on the topic “Artificial Intelligence and influence of Mathematics” in the Webinar on Recent trends in applied mathematics conducted by Dept.of Mathematics,Kumbalathu Sankupillai Memorial,Devaswom Board College.Sasthamkotta during 24-28,May 2021.\nDr.Jisha John,Associate  Professor,CSE\nhandled an orientation session “A walkthrough on CSI” at college of Engineering,Perumon on 22-6-21.\nFACULTY JUDGE FOR CSI-InApp AWARDS\nDr.Tessy Mathew,HOD and Associate Professor,CSE\nis selected as faculty judge for the 10\nth\nCSI-InApp, International Student Project Awards,2021.\nRESOURCE PERSON IN STTP\nDr.Jisha John (Associate Professor, CSE) and Dr.Jesna Mohan\n(\nAssistant Professor, CSE)\nhandled sessions on topics\n“\nGAN -Generative Adversarial Network“\nand\n“\nCNN and Advanced topics in CNN- 3D CNN\n“respectively for the STTP on Artificial Intelligence and Application organized by  Marian Engineering College during 26th  to 31st  July 2021.\nTRAINERS OF FDP\nMs.Anjali C,Ms.Shini Renjith,Mr.Robin Joseph, Ms.Jayalekshmi J, Mr.Ramjith R.P\nhandled classes for the 5 days workshop on\nPython for machine learning\norganized by Robotics club of University  College of Engineering,Muttom during 1-7-21 to 5-7-21.D\nr. Tessy Mathew\n(Head and Associate Professor, CSE) delivered a talk on “Reinforcement learning” for the STTP on” Recent Advances and research domains in machine learning”, organized by Department of CSE, LBS INSTITUTE OF TECHNOLOGY FOR WOMEN on 02-01-21.\nDr. Tessy Mathew\nhandled a session on the topic “Machine Learning and Deep Learning for Renewable Energy Systems” for the IET sponsored Faculty Development Programme on “Performance Improvement in Smart Grid using Artificial Intelligence Techniques”- PISGAI’ 2020’, organized by Department of electrical & electronics engineering ,MBCET from 23rd Nov to 28th Nov, 2020. This FDP was designed to update the participants on the development of advanced technologies and novel methods using state-of-the-art artificial intelligence to deal with problems in the smart grid.\nMs. Dhanya L K\ndeliverd a session on “Text analytics using NLTK” on WINTER SCHOOL FOR WOMEN 2021 on “Unstructured Data analytics and Natural Language Processing” organized by International center for Free and open-source software on February 4th 2021.\nDr. Jisha John\nhas delivered an invited talk on “Generative adversarial networks” for the TEQIP sponsored 6-day online FDP on “Applications of Artificial Intelligence and IoT in Engineering” from February 1-6,2021, organized by the Dept of CSE, College of Engineering, Perumon.\nDr. Tessy Mathew, Dr. Jisha John and Dr.Jesna Mohan\nhas delivered sessions on 6 day online AICTE sponsored STTP on “\nHigh Performance Computing and Deep Learning for Image, Text Analysis\n” from February 22 – 27 ,2021.Dr.Tessy Mathew delivered the topic “Recurrent Neural Network” and Dr. Jisha John handled the topic “Generative adversarial networks”. The topic “Autoencoders, Variational encoders and its hand-on” were handled by Dr. Jesna Mohan\nDr.Jisha John\ndelivered an expert lecture on\n“Medical Imaging”\nat College of Engineering, Perumon organized by Department of CS/IT on 25\nth\nFebruary 2019\nDr. Vishnukumar S delivered an expert lecture on “Advanced Computer Science” at Government Sanskrit College, Tripunithura, Eranakulam on 6th July 2018.\nMr. Shibu V S has delivered expert lectures and conducted Workshop on the topic related to Network Programming Lab of KTU as part of the TEQIP sponsored faculty development programme titled on “Computer Network Challenges and Implementation” on 24th January 2018, organized by Department of Computer Science & Engineering, TKM, Kollam.\nDr. Vishnukumar S was a resource person of the National Workshop on The Basics of Computers, organized by Government Sanskrit College, Tripunithura with the financial assistance from the Directorate of Collegiate Education from 23rd to 29th October 2017.\nMr. Praveen G L delivered an expert lecture in a Faculty Development Program on “THEORY OF COMPUTATION” during 5th July and 7th July 2017 at Marian Engineering College, organized by Dept. of Computer Science and Engineering.\nMr. Robin Joseph had given an expert lecture on “PYTHON PROGRAMMING” at Mar Ivanios College on March 25th and 30th, 2017.\nJisha John\nwas resource person for 3 day FDP on Agile Methodologies, IT Security and Deep Generative Models” Conducted by Dept. of Information Technology, Panimalar Institute of Technology, Chennai\nTessy Mathew, Ms. Jesna Mohan\nwere resource persons for 4 day FDP on “Recent trends in Computing Technologies and Tools” Conducted by Dept. of Information Technology, Panimalar Institute of Technology, Chennai.\nMr Shibu V.S\nwas appointed as External Examiner by Cochin University of Science and Technology(CUSAT) for the project evaluation of fourth-semester M.Sc Degree Examination June 2020, at IIITMK, Technopark\nJisha John\nis selected as KTU Curriculum committee member\nJisha John\nwas the External Doctoral Committee member of research scholar Mrs. Hima Vijayan V P under the guidance of Dr. M. Abdul Rahman, Director, LBS Centre for Science & Technology, Thiruvananthapuram\nJisha John\nwas the Subject Expert for the Conduct of Comprehensive Viva voce of  research scholar Ms.Jini Raju under the guidance of Dr. Usha Devi Amma, Professor, Dept of Electrical and Electronics Engineering, TKM, Kollam\nJisha John\nwas the Subject Expert for the Conduct of Comprehensive Viva voce of  research scholar Ms.Anju S Mohan, under the guidance of Dr. Lizy Abraham, Dean (Research & Consultancy),  LBS Institute of Technology for Women, Poojappura, Trivandrum\nDr.Jisha John\nwas the Subject Expert for the Conduct of  Comprehensive Viva voce research scholar Ms. Suma under the guidance of Dr. P P Joby, Professor & Head, Department of Computer Science and Engineering, St. Joseph’s College of Engineering and Technology, Palai, Kottayam\nWith a focus on disseminating leading edge technology, “Openlabs.ai” – AI community of Mar Baselios College of Engineering and Technology, Trivandrum has organized an awareness session on Artificial Intelligence (AI) for 11th and 12th school students of St. John’s HSS, Nalanchira on 23\nrd\nOctober 2018.\nPublications\nPublications\nMr. Aromal.M, Ms. Ananya Pramod, Ms. Bhavana.S.Moorthy, Ms. Fathima Gesny (S6 CS) and Ms. Jisha Jose (Assistant Professor, Dept. of Computer Science and Engineering) presented a paper titled “Alumni Connect” in the International Conference on Future of Connected Systems – IoT, AI, and 5G (FoCS-2025) Organized by Department of Computer Science and Engineering, Department of Artificial Intelligence & Data Science, & Department of Software Engineering, at Noorul Islam Centre for Higher Education, Kumaracoil, Kanyakumari, India held on May 2nd 2025.\nThe paper titled “\nEnhancing Stroke Recovery: Rehabilitation using MRI and Predictive Modelling\n” authored by\nMs. Anna G. Samuel, Ms. Angel T. John, Ms. Anna Biju Abraham, Ms. Vismaya C. P.\n(2021-2025 batch, Dept. of CSE) &\nDr. Jisha John\n(Professor & HoD, Dept. of CSE) was presented at the\n6th IEEE International Conference on Control, Communication and Computing-ICCC25\n, organized by College of Engineering, Trivandrum held during 23\nrd\n– 25\nth\nMay 2025.\nMs. Neethi Narayanan\n, Asst. Professor, Dept of CSE, has presented a paper titled “\nA Survey on Enhancing Cloud Data Security Using Blockchain Technology\n” at the 16th IEEE International Conference on Intelligence and Communication Networks (CICN-2024) held on 22\nnd\n& 23\nrd\nDecember 2024 at Indore, India, and is published in IEEE Xplore on January 2025.\nMs. Anjali S.\n, Assistant Professor, Department of Computer Science and Engineering, presented a paper titled “\nSpeech Therapy Assistance through Gamification\n” in the International Conference on Computing and Intelligent Reality Technologies (ICCIRT 2024) organized by the Division of Computer Science and Engineering & Artificial Intelligence and Machine Learning, held during 5\nth\n& 6\nth\nDecember 2024 at Karunya Institute of Technology and Sciences, Coimbatore.\nMr Praveen GL\n(Assistant Professor, Dept of CSE) presented a paper titled\n“Towards the recognition of restricted linear languages”\nin the three-day international conference on theoretical and applied computing  (ICTAC-2024).jointly organized by the Departments of Basic Sciences & Computer Applications, Amal Jyothi College of Engineering sponsored by DST SERB from 14th to 16th February 2024.\nDr. Neena Raj N. R.\n(Assistant Professor, Dept. of CSE) and Ms. Saeeda Sulfi published a paper entitled “A Secure Watermarking Based Image Integrity Verification in IoMT” in the  proceedings of IEEE International Conference on Computing, Communication, and Intelligent Systems (ICCCIS) which is organized by Sharda School of Engineering & Technology, Sharda University, Gr. Noida, India. DOI:10.1109/ICCCIS60361.2023.10425401\nMs. Anjali. S\n(Asst. Professor, Dept. of CSE) ,\nMs.Vinny Pious\n,\nMr. Joel J. Sebastian\n,\nMr.  J. Krishnanunni\n,\nMr. Joveal K. Johnson\n, and\nMr. Ashik Mujeeb\nhave published a paper entitled “Multi-Stage Fruit Grading System”  in the Springer Book series  Lecture Notes in Networks and Systems (LNNS, volume 672), Electronic ISSN 2367-3389.\nMr. Adinath Ajith Naik\n,\nMr. Adarsh Joseph Kalief\n,\nMs. Gouripriya S A\n,\nMr. Raef Abdul Nazir\nand\nMs. Jisha Jose\n(Asst. Professor), Dept. of Computer Science and Engineering,  presented a paper titled “\nSmart Vehicle Parking Management System Using Machine Learning and IOT\n” in the 1st International conference on Applied Artificial intelligence and Machine Learning organized by the Department of CSE, IT, CSE (AI&ML), CSE (DS) and AI & DS at Vignan Institute of Technology and Science, Hyderabad, Telangana, India., held on 30th & 31st August 2024.\nMs. Sreeja S. R.,\n(Asst. Professor, Dept. of CSE) published the work “ A  study on modelling the dopaminergic pathways on Parkinson’s Disease “ in the American Institute of Physics(AIP) conference Proceedings Recent Advances in Industry 4.0 Technologies.(AIP Conf. Proc. 2917, 050008 (2023)).\nMs. Devipriya V. S.\n(Asst. Professor, Dept. of CSE) co-authored a book chapter titled “\nKnowledge-Twin: Addressing the Current Challenges of Knowledge Management in Industry 4.0 Using Digital Twins\n” in ‘Digital Twins’ (ISBN: 979-8-89113-057-9), and is published on September 2023.\nMs. Lino Zachariah, Assistant Professor, Dept. of CSE, presented the paper entitled ‘ Review on vision based human motion detection using Deep Learning’ at International Conference held at Kongunadu College of Engineering and Technology, Trichy on 20th September 2023.\nMs. Prathibha S Nair, Assistant Professor, Department of CSE presented the paper entitled “\nRecent Trends in Deep Learning Based Omnidirectional Image Super Resolution\n”, at the 3rd Asian Conference on Innovation in Technology (ASIANCON) during 25th & 27th August 2023 sponsored by IEEE Bombay Section.\nMs. Deepthi K Moorthy, Assistant Professor, Department of CSE presented the paper entitled\n“The Review of Alzheimer’s Disease Detection Using Machine Learning\n” at International Conference held at CARE college Trichy 0n 25th August.\nMs. Jisha Jose (Assistant Professor, Dept of CSE), Mr. Melvin Joseph K,  Mr. Kashyap Sanal,  Ms. Megha K Saji, Ms. Jini Johnson,  Ms. Jibi Ann Mathew, Ms. Jeena Sharon Philip, presented a paper titled\n“An IoT  Based Secure Smart Farming”\nin the IEEE International Conference on Circuit Power and Computing Technologies organized by Baselios Mathew II College of Engineering, Kollam, held on 10th and 11th August 2023.\nMs. Jisha Jose (Assistant professor, Dept. of CSE), Ms. Kesia Mary Joies (CSE), Mr\n.\nRahul Sunil (CSE), Mr. Vishnu P. Kumar(ECE) ( Students of 2018 – 2022 batch), published a paper entitled “\nUnmanned Ground Vehicle for Survey of Endangered Species\n”, in the “Communication and Intelligent Systems” Journal part of the Lecture Notes in Networks and Systems springer book series, Proceedings of ICCIS 2022, Volume 2, pp 411–418, July 2023.\nMs. Jisha Jose (Assistant professor, Dept. of CSE), presented the paper entitled “\nA Review on Optimization and Feature Selection Techniques for Data Security in IoT”\nin third International Conference on Pervasive Computing and Social Networking (ICPCSN 2023) organised by Narasu’s Sarathy Institute of Technology, Salem, India on 19-20, June 2023.\nDr. Jesna Mohan published a paper entitled “\nComputer-Aided detection of tuberculosis from X-ray images using CNN and Pattern Net classifier”\nin Journal of X-Ray Science and Technology ,IOS Press (SCIE).\nMs. Anjali. S, Ms. Vinny Pious, Mr. Joel J. Sebastian, Mr. J. Krishnanunni, Mr. Joveal K. Johnson, and Mr. Ashik Mujeeb have published a paper entitled “\nMulti-Stage Fruit Grading System\n” in the Springer Book series  Lecture Notes in Networks and Systems (LNNS, volume 672), Electronic ISSN 2367-3389.\nMr. Ashwin Abraham, Ms.Bhavya Suseelan, Mr. Jesin Mathew, Mr. Sabarinath P. presented a paper titled\n“ A Study on Meta Verse in Education”\non 7th International Conference On Computing Methodologies and Communication(ICCMC 2023) and the paper will be published in IEEE XPLORE. The project is being guided by Mr. Arun K, Assistant Professor, Dept. of CSE.\nRex Rony Jacob, Rohit Mahesh, Shannon Gomez, Syed Sahabuddin, (Alumni 2018-2022 CSE Batch) and Vijitha Robinson (Asst. Professor, Dept. of CSE) published a paper titled, “\nEverTrack: A System to Track History of Used Cars Using Blockchain\n.” in Inventive Computation and Information Technologies: Proceedings of ICICIT 2022, pp. 415-423., Springer Nature Singapore, 2023.\nMs Anjali S, Ms Vinny Pious, Joel J Sebastian, Krishnanunni J, Joveal K Johnson, and Ashik Mujeeb have presented a paper entitled “\nMulti stage fruit grading system\n” in the Springer International Conference on Inventive systems and Control (ICISC 2023), held at JCT college of Engineering, Coimbatore on 30-31 Jan 2023.\nMs.Jisha Jose, Assistant professor, Department of CSE, has presented a paper titled\n‘A Comprehensive Analysis of Hybrid Machine Learning Algorithms for Securing IoT Data’\nin the international conference organised by the Baselios Mathews II College of Engineering held on 18th November 2022.\nMs.Preethi Vijayakumar, Ms. Elizabeth Mathew, Ms. M.Gayathri Devi, Ms. Monisha P.T,  Ms. Anjali C & Dr. Jisha John has presented a paper entitled\n” Image Forgery Detection: A Review”\nat the 4th International Conference on Inventive Computation and Information Technologies ( ICICIT 2022) organized by RVS Technical Campus, Coimbatore,India held on August 25-26, 2022.\nMs. Sreeja S R, Assistant Professor, Department of Computer Science and Engineering had presented her work “\nA study on Modelling the Dopaminergic Pathways of Parkinson’s Disease\n“ in the International Conference On Recent Advances in Industry 4.0 Technologies(ICRAIT 2022), September 14-16, organized by National Institute of Technology Puducherry. The presented manuscript will be published in Scopus Indexed AIP proceedings.\nMs. Surya B. Jyothi(S8 CSE, 2021passout) and Dr Shini Renjith, Assistant Professor, Department of CSE, have presented a technical paper titled “\nA Deep Learning Model for Detecting Suicide Threat Posts in Social Platforms\n” in the 4th International Conference on “Data & Information Sciences (ICDIS 2022)” held at Raja Balwant Singh Engineering Technical Campus, Bichpuri, Agra, India organized by the Post Graduate Department of Computer Science & Engineering, RBSET. The same has been selected for publication in the “Springer Book Series on Lecture Notes in Networks and Systems”.\nMr. Anand Rakesh, Mr. Anand Vinod, Mr. Mridhul Madhu, Mr. Roshan Daniel (CSE 2021passout) and Ms. Jisha Jose, Mr. Robin Joseph, Assistant Professor, Department of CSE, have presented a paper titled “\nAnimal Trespassing Detection System\n“, in International Conference on Computational Intelligence and Digital Technologies (ICCIDT 2K22) organized by Department of Computer Science and Engineering, Mangalam College of Engineering, Ettumanoor, Kerala.\nMr. Rex Rony Jacob, Mr. Rohit Mahesh, Mr. Shannon Gomez, Mr. Syed Sahabuddin (CSE 2022 Pass out) and Ms. Vijitha Robinson (Asst. Professor, CSE) have presented the paper entitled\n“Evertrack: A system to Track History of Used Cars using Blockchain”\nat the International Conference on Inventive Computation and Information Technologies, 2022 organized by RVS Technical Campus, Coimbatore, held on August 25-26, 2022.\nMr. Adil A.P., Mr. Anandhu M.G., Ms. Jeovan Elsa Joy , Ms.Twinkle S Karethara(S8 CSE, 2022), Ms. Anjali S. and Ms. Poorna B.R. (Assistant Professors,CSED) have presented a paper entitled\n“Accident Detection in Surveillance Camera\n” at the Springer International Conference on Intelligent Cyber Physical Systems and Internet of Things organized by the Department of EEE, JCT College of Engineering and Technology, held on 11,August 2022 at Coimbatore\nMr. Adil A.P., Mr. Anandhu M.G., Ms. Jeovan Elsa Joy , Ms.Twinkle S Karethara(S8 CSE, 2022) , Ms. Anjali S. and Ms. Poorna B.R (Assistant Professors,CSED) have presented a paper entitled “ACCIDENT DETECTION IN SURVEILLANCE CAMERA”  at the Springer International Conference on Intelligent Cyber Physical Systems and Internet of Things organized by the Department of EEE, JCT College of Engineering and Technology, held  on 11,August 2022 at Coimbatore\nMr. Praveen JS, Asst. Professor, CSE , Mr. Arun jiju Joseph, Mr. Sharan George Mammen, Mr. Fleming B Vinu, Mr. Aromal M, S8 CSE has presented a research paper entitled “Traffic Violation Data Security System” at  International Conference on machines, Competing and management technologies -ICMCMT 2022 on 17th and 18th June 2022.\nMs. Ajmi N S, Ms. Diya Ann George, Ms. Megha M B( S8 CSE) and Dr. Jesna Mohan,,  Assistant Professor, CSE published a paper titled “A Review of Machine Learning Techniques for Detecting Autism   Spectrum Disorders”  in IEEExplore. The work has been presented in International Conference on Sustainable Computing and Data Communication Systems, November 2021.\nA paper titled “Disaster Management Using Artificial Intelligence”, by\nMr. K. Savio Rajan, Mr. Amith Abraham Rajan, Mr. Steve Maria Waltin, Mr. Tom Joseph\n(2017-2021 CSE) and\nMs. Anjali C\n(Assistant Professor, Department of CSE ), is selected for publication in Lecture Notes in Electrical Engineering (LNEE, volume 869).\nMr. Abraham Tony , Mr. Jayaram R, Mr. Gokul Krishna J.K, Mr. Gokul Krishna B\n(2017-2021 CSE) and\nMs. Poorna B.R\n(Assistant Professor, Department of CSE )has presented a paper  titled “Augmented Reality Integrated Smart Math Solver” at the Springer International Conference on Smart Data Intelligence organized by Department of CSE and IT, Kongunadu College of Engineering and Technology, Trichy on 11th and 12th ,April 2022.\nA paper titled “MuteMe : An automatic audio playback controller during emergencies” authored by\nMr. Jeremy D’souza, Mr.Akhil Madhu, Mr.Venkitesh S\n(S8 CSE students) and\nDr. Shini Renjith\n, Asst. Professor, Dept. of CSE MBCET was presented in the Springer International Conference on Emerging Trends and Technologies on Intelligent Systems (ETTIS-2022) in association with the Petroleum-Gas University of Ploiesti, Romania.\nMs. Anjali C\n, Assistant Professor, Department of CSE presented a paper entitled  “ A study of change impact analysis techniques based on requirement defects during the software development process” on\nIEEE spices-2022.\nA paper titled “Using Computer Vision to Detect Violation of Social Distancing in Queues” ” authored by\nMr.\nIsmail M., Mr.\nNajeeb T., Mr.\nAnzar N.S., Mr.\nAditya A\n. (2017-2021 Batch of CSE) ,\nMs. Poorna B.R\n, Asst. Prof, Dept. of CSE, Mbcet was published in: Smys S., Balas V.E., Palanisamy R. (eds) Inventive Computation and Information Technologies, Lecture Notes in Networks and Systems, Springer Singapore.\nArun H.C, Dr. Jisha John, Ms. Aswathy Ravikumar\npublished research paper entitled “DRIVE SAFE:Lane Deviation Detection and Alert System using Image Processing Techniques”, in the International Conference Data Intelligence and Cognitive Informatics (ICDICI- 2020) , published in Springer Book Series, Algorithm for Intelligent Systems.\nMs. Shini Renjith\n, Ms. Mable Biju and Ms. Monica Merin Mathew have published the paper “A Sentiment-Based Recommender System Framework for Social Media Big Data Using Open-Source Tech Stack” in Springer Advances in Intelligent Systems and Computing (ISSN: 2194-5357, Scopus) in October 2020.\nMirya Robin,\nDr. Jisha John\n,\nAswathy Ravikumar\n, has published paper entitled “Transfer Learning Techniques for Skin Cancer Classification”, in the 4th International Conference On Computational Vision and Bio Inspired Computing (ICCVBIC 2020) published in Springer – Advances in Intelligent Systems and Computing Series.\nMs. Shini Renjith\n, Assistant professor, Dept. of CSE has published the paper titled “SMaRT: A Framework for Social Media Based Recommender for Tourism” in Springer Transactions on Computational Science and Computational Intelligence (ISSN: 2569-7080) in February 2021.\nAlen S, Advaith U, Joveal K. Johnson, Kesia Mary Joies, Rahul Sunil,\nMs\n.\nAswathy Ravikumar, Dr. Jisha.John\nhas published paper entitled “IoT based Accident Alert System” in the 3rd International Conference on Computer Networks, Big Data and IoT (ICCBI 2020) published in Springer “Lecture Notes in Data Engineering and Communication Technologies”.\nMr. Abhijit S, Mr. Deekshit Gangadhar, Mr. Nebu Thomas Mathew, Mr. T  M Sreenath and Dr. Jesna Mohan, Assistant Professor, Department of Computer Science and Engineering published a paper titled “AR CARD: Interactive Cards using Augmented Reality,” in IEEE explore. The work was accepted in International Conference on Smart Generation Computing, Communication and Networking (SMART GENCON), 2021\nAthulya Roy, Aiswarya D.R, Vighnesh Muraly, Rohit Renne Varghese and Dr. Shini Renjith, Assistant Professor, Department of cse, presented a research paper entitled “A novel approach to predict success of online games using random forest regress or for time series data” in the Third International Conference on Advances in Electrical Computer Technologies 2021 (ICAECT 2021) organized by PSR Engineering College, Sivakasi, Tamil Nadu, India during 29 – 30, October 2021.\nElizabeth  B Varghese, Assistant  Professor , Department of Computer Science and Engineering  presented a paper entitled “Visual Attention based Cognitive Informative Frame Extraction Method for Smart Crowd Surveillance” in  IEEE SSIT 3rd International Conference on Nobert Wiener in the 21st Century (21CW)..held at Chennai from 22- 24 July 2021 and the same was published in IEEE Xplore.\nMr. Alex P L Albin Thomas, Mr. Alen K Varghese, Mr. Bobby Joseph Mathews, Ms. Dhanya LK of department of CSE published a paper entitled “Analysis of Machine Learning Algorithms for Predicting the Suitable Career after High School” in International Conference on Communication and Electronics Systems (ICCCES), 2021.\nMr. Rahul Sunil, Ms. Kesia Mary Joies, (S7, CSE), Mr. Abhijeet Cherungottil, Mr. Bharath T U, and Dr. Shini Renjith (Asst. Professor, CSE) has successfully presented a paper entitled\n“BitMedi: An application to store medical records efficiently and securely”\nat Springer International Conference on Evolutionary Computing and Mobile Sustainable Networks  [ICECSMN-2021] organized by Department of CSE/ISE and Department of ECE, RV Institute of Technology and Management, Bengaluru, India on 28 & 29th  September 2021\nDr, Jisha John\n(Associate. Professor, CSE, Mbcet),\nMs.Aswathy Ravikumar\n(Asst.Professor, CSE, Mbcet) and\nDr. Bejoy Abraham\n(Associate. Professor, CSE, College of Engineering Perumon). “Prostate cancer prediction from multiple pretrained computer vision models ”\nHealth and Technology\n(2021): Vol 11, Issue 4, pp 1-9.\nMs. Elizabeth B. Varghese\n(Asst.Professor, CSE),\nDr. Sabu M. Thampi\n(Professor, Digital University Kerala, Digital University Kerala) published a research paper entitled “A multimodal deep fusion graph framework to detect social distancing violations and FCGs in pandemic surveillance” in the journal Elsevier Engineering Applications of Artificial Intelligence, Volume 103, August 2021.\nRahul Sunil\n, S6 CSE was a co-author along with Dr.Krishnamohan G. P. for the journal DJMol: An open-source modelling platform for computational chemistry and materials science with a Python interpreter which got published in the Journal of Computational Chemistry. It was published by Wiley Periodicals on 18 August 2021.\nThe collaborative project “Malformation Risk Prediction with Machine Learning Modelling for Pregnant Women with Epilepsy “with Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) and MBCET was presented in 34th International Epilepsy Congress (IEC),2021 organized by International League Against Epilepsy (ILAE) and International Bureau for Epilepsy, on 31st August 2021 at Dublin, Ireland. The team comprises of\nDr.Tessy Mathew\n,\nDr.Jisha John\n,\nDr.Jesna Mohan\n(Dept. of CSE)\n,Ms. Deepa P.L\n(Dept. of ECE) and\nDr Sanjeev V Thomas\n(Professor of Neurology (Sr. Grade) Head of the Department of Neurology SCTIMST).\nMs.ShiniRenjith\n,Asst.Professor,CSE has presented a research paper entitled “Comparison of Word Embeddings in Text Classification Based on RNN and CNN” in the 2021 Global Conference on Recent Development in Computer and Communication Technologies (GC-RDCT 2021) held at Mangalore, Karnataka, India during 29-30, July 2021.\nS8 CSE Project titled “Using Computer Vision to detect violation of social distancing in Queues” by\nMr.AdithyaA, Mr.MuhammedIsmail,Mr.NajeebT,Mr.Anzar N.S\n(S8,CSE) guided by\nMs.PoornaB.R\n(Asst.Professor ,CSE) was presented at the Springer International Conference on Inventive Computation and Information Technologies(ICICIT-2021) organised by RVS Technical Campus,Coimbatore on 12 August 2021\nMs.Dhanya L.K(Asst.Professor,CSE)\npresented a technical paper “\nHate Speech Detection in Asian Languages-A survey\n” in IEEE International Conference on Communication, Control and Information Sciences(ICCISc-2021)organized by Govt.Engineering College, Idukki.\nMs. Shini Renjith\nhas published a paper titled “SemRec – An Efficient Ensemble Recommender with Sentiment based Clustering for Social Media Text Corpus ” in the Wiley Journal ” Concurrency and Computation: Practice and Experience” (SCI  and Scopus Indexed) in the month of May 20.\nMr.V Abhijith,Ms.Mable Biju.Mr.Sachin Gopakumar,Ms.Sharon Andrea ,Dr.Tessy Mathew(HOD,CSE)\npublished a conference paper “\nAutomated Detection of Liver Tumor Using Deep Learning\n“in  the Springer  book\nAdvances in Computing and Network Communications\n: June2021.\nAthira Susan George, Gowri Muralikrishnan, Leya Rachel Ninan, Pranav S.Varrier, Dhanya L.K ,(CSE )\nPublished a technical paper titled “Survey on the Design and Development of Indian Language Chatbots” in IEEE International Conference on Communication, Control and Information Sciences (ICCISc-2021) June 2021.\nKiran Baby\npublished a Paper titled “Smart Farming” with Anjitha Anoop,Merin Jose ,Reshma Joseph and Shwetha Merin Thomas in IJSER,Volume 11, Issue 6, June 2020.ISSN:2229-5518\nJisha Jose\npublished a Paper Titled ” PAWTOPIA: A Virtual Animal Sanctuary”, paper ID- IJREAM-V06-I03-63115 with Kaya Nivedh Kumar in International Journal for Research in Engineering Application & Management (IJREAM), ISSN : 2454-9150 Vol-06, Issue-03, June 2020.\nPoorna B.R,Ms,Jesna Mohan\nand J Haripriya Published a research paper titled wSafe24/7- A Personalized Women Safety Application in IRJAES, Volume 5, Issue 3, 2020 .\nVysakh Jayan, Nikhil Anilkumar.Augustine B,Amal Saji Varghese,\nPoorna B.R\nhas published a research paper titled” Personal Journal with Emotional Intelligence and Sentiment Tracking” in IJSER,June 2020.\nArun H.C,\nJisha John\n,\nAswathy Ravikumar\npublished research paper entitled “DRIVE SAFE:Lane Deviation Detection and Alert System using Image Processing Techniques” , in the International Conference Data Intelligence and Cognitive Informatics (ICDICI- 2020) , published in Springer Book Series, Algorithm for Intelligent Systems\nAiswarya Padman.G and\nShon J Das\npublished a paper titled “Android Application Based Robotic Arm Control System Using Raspberry Pi” in IJSER Volume 11, Issue 7, July 2020 Edition.\nShini Renjith\npublished a research paper entitled “A Sentiment based Recommender System Framework for Social Media Big Data using Open Source Tech Stack” with Mable Biju and Monica Merin Mathew in ICMISC 2020, Hyderabad, published in Springer Advances in Intelligent Systems & Computing.\nAnne Dickson\n,Marcia Rajan, Bhavya Nair,Hema Joy,Lithin K Devasia published a research paper titled”Automated car parking system using optical character recognition” in IJSER,July,2020.\nBharath H, Rahul N, Shylash S and\nMs.Vinny Pious\npublished a paper titled “Patient Data Management Using Blockchain” in IJSRP, Volume 10, Issue 7, ISSN 2250-3153, July 2020.\nMs.Anne Dickson published a research paper”Improved PSO for optimizing  the performance of IDS” in Journal of Intelligent and Fuzzy Systems.\nMr.Vishnu Kumar S published  a research paper “A Hybrid approach to generate visually seamless aerial mosaics from unmanned aerial vehicles” in journal of intelligent and fuzzy systems,IOS press.\nMerlin Susan David, Mirya Robin, Riya Mariam Babu, Reshma Susan Abraham, Ms. Aswathy Ravikumar , Dr. Jisha John ,“Review on Computer Aided prognosis of Prostate cancer using Deep Neural Network”, International Conference on Intelligent Computing and Control Systems (ICICCS 2019), Vaigai College of Engineering, Madurai, Tamil Nadu, India, May 2019.\nMs. Shini Renjith, Sreekumar A and Jathavedan M, “An Extensive Study on the Evolution of Context-Aware Personalized Travel Recommender Systems”, Journal of Information Processing and Management\nMs. Shini Renjith, Sreekumar A and Jathavedan M, “A Comparative Analysis of Clustering Quality Based on Internal Validation Indices for Dimensionally Reduced Social Media Data”, Proceedings of the International Conference on Artificial Intelligence and Data Engineering (AIDE-2019), held on May 2019.\nMs. Shini Renjith, Sreekumar A and Jathavedan M, “Pragmatic Evaluation of the Impact of Dimensionality Reduction in the Performance of Clustering Algorithms”, Proceeding of the International Conference on Advances in Electrical and Computing Technologies (ICAECT 2019), April 2019.\nMs. Shini Renjith, Sreekumar A and Jathavedan M, “Performance Evaluation of Clustering Algorithms for Varying Cardinality and Dimensionality of Data Sets”, Proceedings of the International Conference on Advances in Electrical and Computing Technologies (ICAECT 2019),  April 2019.\nDhanusha T. John, Kavya S. Kumar, Vaishak T. Nair, P. Visakh, Ms. B. R. Poorna, “ Cricket Scoreboard Automation using Umpire Gestures”, International Journal of Research in Engineering, Science and Management,  Volume-2, Issue-7, July-2019.\nMs. Shini Renjith, Sreekumar A and Jathavedan M, “SMaRT: Social Media based Recommender for Tourism” Proceedings of the International Conference on Networks and Advances in Computational Technologies (NetACT 19), July 2019.\nVivek Jude, Nayana A, Reshma Pillai and Dr. Jisha John published the paper titled “Personalized Educational Platform”, Fourth International Symposium on Intelligent Systems Technologies and Applications (ISTA’18), Springer Advances in Intelligent Systems and Computing Series.\nAswathy Ashok, Dr. Jisha John published the paper titled ” “Facial Expression Recognition System for Visually Impaired”,  Springer International Conference on Intelligent Data Communication Technologies and Internet of Things (ICICI 2018).\nMs. Jisha Jose published the paper titled “COLLEGE BUS TRACKER” in International Journal of Science, Engineering and Technology Research , Volume 7, Issue 5, pp.309-316,ISSN: 2278 – 7798, May-2018.\nMs.Shini Renjith published the paper titled “Detection of Fraudulent Sellers in Online Marketplaces Using Support Vector Machine Approach” in International Journal of Engineering Trends and Technology, on March 2018.\nMs. Shini Renjith, Sreekumar A, Mr. Jathavedan M published the paper titled “Evaluation of Partitioning Clustering Algorithm for Processing Social Media Data in Tourism Domain”, IEEE Recent Advances in Intelligent Computational System (RAICS2018), MASCOT Hotel, Trivandrum, 6\nth\nto 8\nth\nDecember, 2018\nTessy Mathew, L. Jeganathan and  U. Srinivasa Rao;“A cellular automata model for safe investment based on expert’s recommendations”; International Journal of Economics and Business Research, Vol. 14, Issue 3-4, 2017\nTessy Mathew, U. Srinivasa Rao and  L. Jeganathan ; “Error Bounds for Darboux Integral of Continuous Functions with Supremum Norm Using Cellular Automaton”; International Journal of Control Theory and Application ( ISSN : 0974-5572), Vol. 9, 2017.\nMs. Shini Renjith; “B2C E-Commerce Customer Churn Management: Churn Detection using Support Vector Machine and Personalized Retention using Hybrid Recommendations”; International Journal on Future Revolution in Computer Science & Communication Engineering (ISSN: 2454-4248), Vol. 3, Issue: 11, November 2017.\nVishnukumar S and M. Wilscy. “Single image super-resolution based on compressive sensing and improved TV minimization sparse recovery.” Optics Communications, Elsevier June 2017 (SCI Impact Factor: 1.588).\nVikraman Nair published a paper titled “Ontology for Launch Vehicle Mission Simulation”, JOURNAL OF AEROSPACE INFORMATION SYSTEMS, Vol. 14, No. 3, March 2017.\nDhananjay J, Jayajith J.J, Meenu Chandran, Jisha Jose published a paper titled “OpenBot” in International Journal of Science, Engineering and Technology Research, Volume 6,Issue 6,June 2017,pp.012-1015.ISSN: 2278 – 7798.\nRaju K Gopal published a paper titled “A Novel Data Storage Solution for Cloud”, International Journal of Engineering Research & Technology, January 2017.\nMs. Jayalekshmi and Dr. Tessy Mathew has published a paper  ” Multimodal Sentimental Analysis-A study on classification Techniques for Multimodal Sentimental Analysis” in International Journal of Innovative Research in Computer and Communication Engineering (IJIRCCE) Vol. 4, Issue 9, September 2016.\nVivek Jude, Nayana A, Reshma Pillai and Jisha John published the paper titled “Personalized Educational Platform”, Fourth International Symposium on Intelligent Systems Technologies and Applications (ISTA’18), Springer Advances in Intelligent Systems and Computing Series.\nShini Renjith, Sreekumar A. and Jathavedan M. have presented the paper “Pragmatic Evaluation of the Impact of Dimensionality Reduction in the Performance of Clustering Algorithms” at International Conference in Advances in Electrical and Computer Technologies 2019 (ICAECT 2019), Apr 2019 and published in “Advances in Electrical and Computer Technologies”, Springer Lecture Notes in Electrical Engineering (LNEE) series.\nShini Renjith, Sreekumar A. and Jathavedan M. have presented the paper “Performance Evaluation of Clustering Algorithms for Varying Cardinality and Dimensionality of Data Sets” at International Conference in Advances in Electrical and Computer Technologies 2019 (ICAECT 2019), Apr 2019 and published in “Advances in Electrical and Computer Technologies”, Springer Lecture Notes in Electrical Engineering (LNEE) series.\nShini Renjith,Alpana Gopi, Divya P R, Litty Rajan and Surya Rajan have published a paper titled “Accident Tracking and Visual Sharing Using RFID and SDN” in International Journal of Computer Engineering in Research Trends, Vol. 3 Issue 10, Oct 2016.\nShini Renjith and Dhanya Sudhakaran have published a paper titled “Context Aware Community Detection Scheme for Identification of Community in Multi-dimensional Networks” in International Journal of ICTAK (Convergence), Vol. 2 Issue 1, Jun 2016.\nShini Renjith and Dhanya Sudhakaran have published a paper titled “Multi Comm_Plus: A Community Detection System for Identification of Community in Multi-Dimensional Networks” in International Journal of Innovative Research in Computer and Communication Engineering, Vol. 4 Issue 5, May 2016.\nShini Renjith and Dhanya Sudhakaran have published a paper titled “Survey of Community Detection Algorithms to Identify the Best Community in Real-Time Networks” in International Journal of Scientific Engineering and Applied Science, Vol. 2 Issue 1, Jan 2016.\nShiniRenjith and DhanyaSudhakaran have published a paper titled “Phase based Resource Aware Scheduler with Job Profiling for MapReduce” in International Journal of Latest Trends in Engineering and Technology, Vol. 6 Issue 2, Nov 2015.\nShiniRenjith has published a paper titled “An Integrated Framework to Recommend Personalized Retention Actions to Control B2C E-Commerce Customer Churn” in International Journal of Engineering Trends and Technology, Vol. 27 Issue 3, Sep 2015.\nShiniRenjith and K.G. Jijimol have presented the paper “Load Balanced Optimal Client Server Assignment for Internet Distributed Systems” in International Conference on Advances in Computing, Communications and Informatics 2015 (ICACCI-2015), Jul 2015 and published in International Journal of Applied Engineering Research, Vol. 10 Issue 69.\nShiniRenjith and Anjali C. have presented the paper “A Personalized Mobile Travel Recommender System using Hybrid Algorithm” in International Conference on Computational Systems and Communications 2014 (ICCSC2014), Dec 2014 and published in IEEE Xplore.\nShiniRenjith and Anjali C have presented the paper “A Personalized Travel Recommender Model Based on Content-based Prediction and Collaborative Recommendation” in International Conference on Mobility in Computing (ICMiC13), Dec 2013 and published in International Journal of Computer Science and Mobile Computing, ICMIC13. This paper has also secured the Best Paper Award in ICMIC13.\nShiniRenjith and Anjali C have presented the paper “Fitness Function in Genetic Algorithm based Information Filtering – A Survey” in International Conference on Mobility in Computing (ICMiC13), Dec 2013 and published in International Journal of Computer Science and Mobile Computing, ICMIC13.\nSrividhya S and Divya R.S has published a paper  “A survey on Various IP Mobility Solutions”, in International Journal of Innovative Research in Science, Engineering and Technology(IJIRSET), Volume 5, Issue 10, October 2016.\nMohis M and S has published the paper “An Improved Approach for  Enhancing Public Cloud Data Security through Steganographic  Technique ” , IEEE International Conference on Inventive Computation Technologies (ICICT) , 26-27 August 2016.\nMohis M and Devipriya V.S has published a paper ” A Survey on Secure Data Sharing Methods in Cloud Storage”, in the International Journal of  Innovative Research in Computer and Communication Engineering(IJIRCCE), August 2016.\nVijitha Robinsonand Elizabeth B Varghese has published a paper ” A Novel Approach for ensuring the privacy of EEG signals using Applications specific feature extraction and AES algorithm”, in the International Conference on Inventive Computation Technologies (ICICT) , 26-27 August 2016.\nNeenu J S and Elizabeth B Varghese has published a paper ” A Novel Approach for SCC Algorithm using pattern Based Image Steganography”, IEEE International Conference on Inventive Computation Technologies (ICICT) , 26-27 August 2016.\nJesna Mohan and Madhu S. Nair, “Domain Independent Static Video Summarization using Sparse Autoencoders and K-means Clustering”, Journal of Intelligent and Fuzzy Systems, IOS Press, 2018.\nAdil A.P, Anandhu M.G, Jeovan Elsa Joy,Twinkle.S.Karethara, Anjali.S and Poorna B.R published a paper entitled  “\nACCIDENT DETECTION IN SURVEILLANCE CAMERA\n” in the Springer book series ‘Engineering Cyber-Physical Systems and Critical Infrastructures’.\nDr. Jesna Mohan, Asst. Professor, Dept. of CSE, published a paper entitled “\nA Novel Light Weight CNN framework integrated with Marine Predator Optimization for the assessment of Tear Film-Lipid layer\n” in CMES-Computer Modelling in Engineering & Sciences Volume 136, Number 1, 2023. (SCI Expanded 2.027).\nBOOK PUBLICATION\nMs. Vijitha Robinson\n&\nMs. Prathibha S. Nair\n(Asst. Professors, Dept. of CSE) coauthored a book titled “\nFoundations of Computing: From Hardware Essentials to Web Design\n” which was published on 27\nth\nJanuary 2025. ISBN:  978-93-342-1525-0\nMs.  Prathibha S Nair and Ms. Vijitha Robinson\n, Assistant Professors, Department of CSE co-authored a book titled\n“Algorithmic Thinking with Python”\ncovering problem solving techniques and the basics of Python  programming language.\nMr. Abhijith K P\n,\nMr. Partha Santosh\n,\nMr. R Sarath\n, &\nDr. Jesna Mohan\n(Associate Professor, Dept. of CSE)  published a book chapter titled ”\nA Computer Aided Diagnosis System for the Detection of Parkinson Disease\n” in  Computational Intelligence for Oncology and Neurological Disorders in Intelligent Informatics by Springer.\nVijitha Robinson, Assistant Professor, Department of CSE has co-authored a book titled ‘Programming in C’ (ISBN: 978-93-5627-840-0), covering the basics of C programming language.\nPATENT PUBLISHED\nDESIGN PATENTS REGISTERED\nMs. Sreeja S. R.\n, Asst. Professor, Dept. of CSE secured Design Patent for her work on “\nSurround perception and Audio Assistant Device\n” (\nDesign No. 431786-001\n) on 25\nth\nNovember 2024. This is the second patent to her credit.\nDESIGN PATENT REGISTERED\nMs. Deepthi K. Moorthy\n(Asst. Professor, Dept. of CSE),\nMr. Shibin Shibu\n,\nMr. Gopal S.\n,\nMr. Ashwin A.\nand\nMr. Adithya Anil\n(2024 CSE Passout Batch) have secured a design patent registration for  “\nSmart energy forecasting and management Device\n”, on October 2024.\nDr. Sibi Chakkaravarthy Sethuraman (VIT-AP) and Ms. Devipriya V. S.\n(Assistant Professor, Dept of CSE, MBCET) published a patent titled “\nVikrant: Open source indigenous Honeypot\n-A container based approach to provide an additional layer of isolation and security of honeypots”.\nVision\nTo be a Centre of Excellence in Computer Science and Engineering providing quality education and research for the betterment of the society.\nMission\nTo impart sound knowledge in theoretical and applied foundations of Computer Science and Engineering, and to train the students to solve real life issues to effectively define and shape life.\nBoS\nThe People\nDepartment Advisory Board\nFacilities\nNews & Events\nWorkshops & Seminars\nResearch and Consultancy\nPlacements\nActivities\nVideo Lectures\nB. Tech PEOs POs & PSOs\nSyllabus\nTime Table\nCSE Blog\nFormer HoDs"
}