{
    "filename": "mbcet.ac.in_alumni_youth-excellence-award_.html",
    "content": "Youth Excellence Award – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAlumni\n>\nYouth Excellence Award\nYouth Excellence Award\nMar Baselios Youth Excellence Award has been instituted in honour of the late His Beatitude Moran Mor Cyril Baselios, the Major Archbishop Catholicos and Founder of the Mar Baselios College of Engineering and Technology. The award is intended to identify and promote the pursuit of Innovation, entrepreneurship and overall excellence among the outgoing final year Engineering students in Kerala. It is instituted by Mar Baselios College of Engineering and Technology (MBCET) and sponsored by the MBCET Alumni Association (MBCETAA). The award comprises of a Prize Money of Rs. 1,00,000/-, Certificate, and Momento.\nMar Baselios Youth Excellence Award 2019\nThe 9th Mar Baselios Youth Excellence Award – 2019 was presented to Smt. Irene Tenison, TKM College of Engineering, Kollam on 14 November 2019 by Shri. Arif Mohammad Khan, Hon’ble Governor of Kerala.\nMar Baselios Youth Excellence Award 2018\nThe 8th Mar Baselios Youth Excellence Award – 2018 was presented to Shri. Jerrin George James, College of Engineering Trivandrum on 23 November 2018 by Shri. P. H. Kurien IAS, Additional Secretary, Revenue and Disaster Management, Environment, Government of Kerala.\nMar Baselios Youth Excellence Award 2017\nThe 7th Mar Baselios Youth Excellence Award – 2017 was presented to Shri. U. Balagopal, College of Engineering Trivandrum on 10 November 2017 by Prof. C. Ravindranath, Hon’ble Minister for Education Govt. of Kerala.\nMar Baselios Youth Excellence Award 2016\nThe 6th Mar Baselios Youth Excellence Award – 2016 was presented to Ms. Nisha Mariam Johnson, Electronics & Communication Engineering, College of Engineering Trivandrum on 5 August 2016 by Shri. PinarayiVijayan, the Hon’ble Chief Minister of Kerala. His Beatitude Moran Mor Baselios Cardinal CleemisCatholicos, the Major Archbishop of the Malankara Syrian Catholic Church presided over the function.\nMar Baselios Youth Excellence Award 2015\nThe 5th Mar Baselios Youth Excellence Award – 2015 was presented to Shri. Anandhu SB, Govt Engineering College, Barton Hill on 13th October 2015 at 11.00 am by Dr. E Sreedharan, Principal advisor, DMRC. His Excellency Most. Rev.Dr. Samuel Mar Irenios presided over the function.\nMar Baselios Youth Excellence Award 2014\nThe 4th Mar Baselios Youth Excellence Award – 2014 was presented to Shri.Rahul R., Computer Science & Engineering, College of Engineering Trivandrum on 20th January 2014 at 3.00 PM by Sri. Ramesh Chennithala, Hon’ble Minister for Home and Vigilance, Govt of Kerala. His Beatitude Moran Mor Baselios Cardinal CleemisCatholicos, Major Archbishop of Trivandrum & Patron of MBCET presided over the function.\nMar Baselios Youth Excellence Award 2013\nThe 3rd Mar Baselios Youth Excellence Award – 2013 was presented to Mr. Sidharth K. Varma of College of Engineering Trivandrum, receives the 2013 award.\nMar Baselios Youth Excellence Award 2012\nThe 2nd Mar Baselios Youth Excellence Award – 2012 was presented to Ms. Hanna Paulose of Mar Athanasius College of Engineering, receives the 2012 award.\nMar Baselios Youth Excellence Award 2011\nThe 1st Mar Baselios Youth Excellence Award – 2011 was presented Ms. AnuKuncheria of College of Engineering Trivandrum, receives the 2011 award.\nAbout us\nMBCETAA Contributions\nExecutive Committee\nMBCETAA-Middle East Chapter\nMBCETAA - North America Chapter\nDistinguished Alumni\nGet Involved\nMBCETAA Awards\nYouth Excellence Award\nStay in Touch\nContact Us\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}