{
    "filename": "mbcet.ac.in_faculty_ms-jaya-s-pillai_.html",
    "content": "Dr. Jaya S. Pillai – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nCivil Engineering\n>\nDr. Jaya S. Pillai\nEmployee Code / ID No.\n10114051\nQualifications\nPh.D\nOrcid ID\nhttps://orcid.org/0000-0002-2471-8354\nIndustry / R & D Experience\nIndustry experience: 5 years\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9633265828/  190\nAreas of Interest / Current Research\nEcological  Wastewater Treatment , Water Supply and Sanitation, , Air Quality Management, Environmental Impact Assessment, Solid Waste Management\nResearch, Consultancy, Publication\nJaya S. Pillai and Brijesh Nair, A.N. (2022), ‘Constructed Wetlands planted with Lignocellulosic Grass Species for Wastewater Treatment and Biomass Utilisation ‘, Research Journal of Chemistry and Environment, 26 (4), 86-98\nJaya S. Pillai and Brijesh Nair, A. N. (2021), ‘Performance of Vertical Flow Constructed Wetlands Planted with Indigenous Species for Decentralized Wastewater Treatment and Biomass Production in Kerala, India’, Nature Environment and Pollution Technology 20(2), 541-550.\nJaya S. Pillai  and Brijesh Nair, A.N. (2015), ‘Subsurface Flow Constructed Wetlands: Review of Applications and Recent Developments’, Pollution Research, 34 (4), 95-105.\nJaya S. Pillai and Vijayan, N. (2013), ‘Wastewater Treatment: An Ecological Sanitation Approach in a Constructed Wetland’, International Journal of Innovative Research in Science, Engineering and Technology, 2 (10), 5193-5204.\nJaya S. Pillai and Vijayan, N. (2013), ‘Wastewater treatment coupled with biomass production in a Constructed Wetland’, in Proceedings of the National Conference on Technological Trends NCTT, College of Engineering Trivandrum.\nJaya S. Pillai and Vijayan, N. (2012), ‘Decentralized greywater treatment for non-potable reuse in a vertical flow constructed wetland’, in Proceedings of the International Conference on Green Technologies (ICGT), Trivandrum, India, IEEE Xplore, 058-063, doi: 10.1109/ICGT.2012.6477948.\nPh.D Research Guidance (Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\n–\nMembership in Professional bodies/ organizations\nLife Member ISTE\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\n1. Second Rank Holder, M. Tech Environmental Engineering (2011-13), College of Engineering Trivandrum.\n2. Best Paper Award , 14th National Conference on Technological Trends (NCTT), August 2013, College of Engineering Trivandrum.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}