{
    "filename": "mbcet.ac.in_home_professional-socities_iet_.html",
    "content": "IET – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nProfessional Societies\n>\nIET\nIET\nTHE IET-MBCET ON CAMPUS CHAPTER was re-inaugurated on 23rd Aug’16, with 60 new Student members and 2 Faculty members from Dept. of EEE. Since then, the chapter has grown to be a driving force for many young aspiring engineers in and around Trivandrum, providing quality opportunities. The Faculty members have increased to 6 and Ms. Soumya A v (Asst. Professor) is the On Campus Facilitator of the chapter. The chapter has around 200 members from EEE, ECE, CSE and ME streams and is an integral part of IET Kanyakumari Local Network since its induction.\nThe chapter has been very active and successful in conducting technical workshops, talks by eminent personalities, internships, techno-cultural fests, etc.\nOfficial website\n:\nclick here\nInstagram:\nclick here\nLinkedIn:\nclick here\nFacebook:\nclick here\nThe IET Ingress selection process was done through a set of two interviews and a few offline sessions. The process started on the 17th of May and extended till the 2nd of June. Through this time period, interviews and offline sessions were conducted. The announcement of the result was on the 5th of June with Sanna Pramod from the department of computer science leading the team as the chairperson. The team is advised by Soumya A.V from the electrical and electronics department. The present team is bustling with ideas and they are planning a quiz program accompanied by an offline session for students from various schools as an outreach program.\nReports\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2019-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2018-2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2017-2018\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2016-2017\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nDownload [791.22 KB]\nActivities\nActivities\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nISHARE\nASME\nIET\nIEEE Activities\nSAE MBCET\nComputer Society of India\nISTE\nACM\nInvited Talks\nCourses\nTechnical Events\nWorkshops\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}