{
    "filename": "mbcet.ac.in_outreach_spadanam_.html",
    "content": "Spandanam – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nOutreach\n>\nSpandanam\nSpandanam\nSocial Serive Organisation of Department of Electronics and Communications Engineering (SPANDANAM)\nSpandanam, the social service wing of the ECE department, conducted an activity on the occasion of school reopening and distributed school bags (16 in number) to the children of our housekeeping staff on 30th May 2025.\nThe Spandanam social service initiative of the ECE department extended financial support to Salini, a cancer patient from Chenkottukonam, to aid her medical treatment on February 7th, 2025.\nAs part of the Spandanam (Social Service wing of Dept. of ECE, MBCET) activity,spandanam student members, along with teachers, visited Assisi Niketan Old-Age Home, Sreekaryam on 14th October 2024. Heartfelt interactions filled with stories and laughter brought joy to residents. The team sponsored lunch, spreading love and warmth.\nThe Spandanam team from the ECE department visited the family of a bedridden patient residing near Parottukonam and donated an amount to support their medical needs.\nFaculty members:Dr. MJ Jayashree, Ms Teena Rajan, Mr. Jinu Baby and Ms. Merin Philip\nStudent members : Aleena Maria Sam, Deepak G Thomas, Ann Mary Biju\nThe Spandanam, social service wing of the ECE department, distributed school bags to the children of the housekeeping staff on May 29, 2024.\nAs part of the Spandanam (Social Service wing of Dept. of ECE, MBCET) activity donated 107 food kits at RCC, Trivandrum in collaboration with NSS unit on 1st March 2024.\nAs part of the Spandanam (Social Service wing of Dept. of ECE, MBCET) activity, hosted a vital blood donation camp, showcasing the collective effort of the college community towards a noble cause in collaboration  with E-nix,Sree Chithra Thirunal Institute of Medical Science and Technology, Phoenix MBCET, and Illumina MBCET on 30 November 2023 at our college.\nAs part of the Spandanam (Social Service wing of Dept. of ECE, MBCET) activity, monetary support was given to  a needy patient who undergoes dialysis twice a week in Powdikonam,Thiruvananthapuram on 11th October 2023.\nAs part of the Spandanam (Social Service wing of Dept. of ECE, MBCET) activity, Onam kits sponsored by S6 EC students were distributed to the supporting staff of our college on 23 August 2023.\nAs part of Spandanam (Social Service wing of Dept. of ECE, MBCET) activity, 25 school bags were distributed to the needy students residing in Pazhakutty Lakshamveedu colony near Nedumangad, on 01 June 2023.\nAs part of Spandanam (Social Service wing of Dept. of ECE, MBCET) activity, a mobile phone was donated to kumari. Siva Ganga, Priya Nivas, Punchakkari, Thiruvalla who is a nursing student in Good Shepherd College on 12\nth\nNovember 2022.\nThe Social Service Wing of the Department of Electronics and Communication has been christened “Spandanam”.\nAs part of the spandanam activity, bags were distributed to the needy children, at Sacred Heart Malankara Catholic Church, Kallayam, on 31 July 2022.\nFaculty representatives (\nDr. M.J. Jayashree\n,\nMs. Teena Rajan\n,\nMs. Anu Susan Philip\n,\nMs. Salga Ann Jacob\n, and student representatives (\nJoshin Samuel\nand\nJobin J.,\nS8 EC2)  from the department of ECE, distributed  school bags, umbrellas and instrument boxes to the children,  at Pappala near Kilimanoor, on 21 May 2022.\nAs part of the SPANDANAM (Social service wing of Department of Electronics and Communication Engineering) activity, the team comprising\nDr. M.J. Jayashree\n, Prof., Dept. of ECE, along with\nSri. D. Joykutty\n, Sr. Office Assistant, distributed food to the needy patients and their bystanders at Thiruvananthapuram Govt. Medical College, on 14 March, 2022, at 5 pm.\nFaculty from the department of ECE contributed towards donating lungis and towels, to the inmates of ‘Sneha Veedu’ near Nalanchira, on 23 December 2021.\nAs part of the\nSPANDANAM\nactivity, faculty from the Department of ECE contributed towards donating 2 normal wheelchairs and one commode wheelchair, to MIND (Mobility In Dystrophy) Trust. MIND Trust formed in 2017 is a non-governmental organisation working to promote and raise awareness in the areas of education, employment opportunities, and rehabilitation of individuals with physical disabilities, such as muscular dystrophy and spinal muscular atrophy (SMA).\nAs part of the SPANDANAM activity, faculty representatives from the Department of ECE (\nMs. Teena Rajan\n,\nMs. Luxy Mathews\nand\nMr. Anoop K. Johnson\n) visited the Central Institute on Mental Retardation (CIMR – A national Level NGO in India), Murinjapalam, Trivandrum, on 19\nth\nFebruary 2021 and handed over stationary items and  toys, to facilitate the teaching – learning process in CIMR.\nIn association with Unnat Bharat Abhiyan (UBA) cell, MBCET, SPANDANAM distributed masks and sanitizers to the students of Government Boys High School, Kanniakulangara, on 6\nth\nJanuary 2021.\nAs part of the SPANDANAM activity, student representatives from S3 EC2 (\nAlenso Rooby\nand\nAswen A.M.\n),\nMs. Teena Rajan\n, and\nMr. Anoop K. Johnson\n, Assistant Professors in the department of ECE, visited Mrs. Radha’s house at Nalanchira on 18\nth\nDecember 2020. She belongs to a poor family and is suffering from acute diabetes.  Rs. 5000 has been donated for her treatment purpose.\nOn 3\nrd\nOctober 2020, SPANDANAM took the initiative to provide essential commodity kit to Mr. Shivakumar’s family residing at Thiruvallom. Mr. Shivakumar, the only earning member in the family, met with an accident, and the family was struggling to make ends meet.\nA talk by Aswathy Nair, Founder of Jwala Foundation, an NGO that provides food and shelter for the needy had been organised on 6 March 2020 for ECE students.\nStaff members and students visited the Shalom Special School for mentally challenged situated in the village of Vembayam, Kaniyapuram block, Thiruvananthapuram district on 23 November 2019. The team spent half day with the inmates of the school, engaging them with entertainment programs and interactive games.\nSpandanam team, in association with UBA (Unnath Bharat Abhiyan) cell visited St. John’s Medical Village, Pirappancode, on 2 October 2019. They took surveys on education, health sanitation, electricity, etc, and elucidated why plastic eradication is the need of the hour.\nStaff members and students visited Snehabhavan near Kattakada on 19 January 2019 and handed over few immediate requirements for the inmates.\nStaff members of ECE department purchased and distributed onam kits for around 12 needy families in and around Kilimanoor, Trivandrum. The kits were distributed on August 18\nth\n, 2018 by the staff members of the department.\nSpandanam organized a collection drive for the flood affected under the #DoforKerala campaign. The staff and students of the Department of Electronics & Communication Engineering pooled in flood relief materials worth Rs. 25000/- and gave it to the collection centre at B-hub, Mar Ivanios Vidya Nagar, Trivandrum which was then transported to the collection centre under the District Administration.\nStaff members of ECE department collected and handed over an amount to the Devaki Warrier Memorial Women’s Studies & Empowerment entre, where free accommodation and food was provided for cancer patients on February 18th, 2018.\nDr. Bipin T. Varghese, Surgeon, Regional Cancer Centre rendered a talk on cancer awareness on 31st January 2018.\nStudents of S6 EC1 sponsored a one day meal for the inmates of Kerala State Council for Child Welfare on 23rd December 2017.\nFaculty and students of EC department joined the community outreach program for the welfare of children at Poonthura, a rural coastal area in Trivandrum organized by Worldvision along with MBCET on 18th February 2017.\nSpandanam members distributed meals at Medical college with the help of Mr. D. Joykutty.\nFaculty and students of EC Department visited the inmates of “Unity House” and took classes on various subjects like Physics, Chemistry, History, Maths etc. on 24\nth\nAugust 2016.\nFaculty and students of EC department visited the inmates of “Unity House” and took classes on jewellery making and handicrafts on 28 August 2016.\nFaculty of ECE Dept. visited the inmates of “Snehaveedu” and distributed House hold items on May, 2016. This was organized by the department social service wing Spandanam.\nSpandanam members visited families at Karette and donated Onam kits to the families in September 2016.\nThe staff of EC department visited the inmates of Unity House, Chittazha on May 30, 2015 and Ananthashayi Balasadanam, Trivandrum on August 21st 2015.\nFaculty and students of EC department joined the community outreach program for the welfare of children at Poonthura, a rural coastal area in Trivandrum organized by Worldvision along with MBCET on 18th February 2017.\nSpandanam members distributed meals at Medical college with the help of Sri. D. Joykutty.\nSpandanam members visited families at Karette and donated Onam kits to the families in September 2016.\nFaculty and students of EC department visited the inmates of “Unity House” and took classes on jewellery making and handicrafts on 28th August 2016.\nFaculty and students of EC Department visited the inmates of “Unity House” and took classes on various subjects like Physics, Chemistry, History, Maths etc. on 24th August 2016.\nNSS\nUBA\nAARDRAM\nChirag\nSpandanam\nSPARSHAM\nThanal\nKaruthal\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}