{
    "filename": "mbcet.ac.in_departments_mechanical-engineering_facilities_.html",
    "content": "Facilities – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nMechanical Engineering\n>\nFacilities\nFacilities\nWorkshop\nAll the students are given a basic training in various sections like fitting, foundry, sheet metal, smithy, carpentry, plumbing, welding etc.\nMachine shop\nThe students are given an excellent opportunity to familiarize themselves and acquire hands-on experience in machine tools like Lathe, Shaper, Milling Machine, Drilling Machine, Cylindrical & Surface Grinding Machines etc.\nLaboratories\nMechanical Engineering Lab\nThe Mechanical Engineering lab includes the study of basic principles involved in Metrology and Instrumentation and Metallographic Testing. The students are provided excellent facilities to make them understand the importance of precision instruments, their principles and operation and application of various measuring techniques. The lab is well equipped with machines including Autocollimator, Tool maker’s Microscope, Polishing Machines, Lathe Tool Dynamometer etc.\nThermal Lab\nThe aim of the lab is to give a practical insight to the students about various modes of Heat transfer and to conduct experimental tests for the better understanding of thermal engineering principles. The lab is well equipped with test rigs for various studies including the principle of ccomposite wall, natural convection and forced convection, heat exchangers, compressors, blowers etc.\nFluid Mechanics and Hydraulic Machines Lab\nFluid Mechanics is one of the core areas in the field of Mechanical Engineering. The students are given an opportunity to understand the various principles in Fluid Mechanics and their practical applications through a well equipped laboratory.\nHydraulic Machines is another important area that deals with the working and application of different types of Hydraulic Machines in the various fields of Engineering. The lab is well equipped with turbines used in hydro-electric power plants and pumps used in various practical applications. Students are given hands on training on these machines.\nSome of the important test rigs available in the lab are Venturimeter, Orificemeter, Pumps, Turbines etc. Cut models of reciprocating pump, various impellers, different runners & guide vanes, pipe fittings & joints are also displayed in the lab.\nHeat Engines Lab\nThe lab aims at providing the students hands-on experience on the working of various heat engines. The lab is well equipped with single and multi cylinder engines, MPFI engine and other experimental set ups to determine viscosity of liquids, calorific value of fuel etc.\nProduction Engineering Lab and Engineering Workshop\nProduction Engineering is an important area in the field of Mechanical Engineering. The students are exposed to various machine tools used in industries through a well equipped machine shop.\nThe machine shop is well equipped with various types of CNC machines, lathes, surface grinders, milling machines etc. Students are given hands on training on these machines.\nLab in charges\nSI No\nLab / Workshop\nFaculty in-Charge\nLab in-Charge\nRoom No\n1\nMechanical Engineering Workshop\nDr. P.S. Prasanth\nMr. Shaji D.\nWS 1,2,3\n2\nMachine Shop\nDr. Vinod V.\nMr. Aneesh Rajan A T\nH 001\n3\nCNC Lab\nMr. Bipin Sankar\nMr. Balamurali D.\nH 002\n4\nHeat Engines Lab\nMr. Vaisakh S Nair\nMr. Sijo Thomas\nH 101\n5\nFluid Mechanics & Machines Lab\nMr. Roshan George Koshy\nMr. Anil Kumar R. S.\nH 102\n6\nMetrology Lab\nMr. Ayswer A. S.\nMr. Shijin Kumar\nH 401\n7\nThermal Engineering Lab\nDr. Rajesh T. N.\nMr. Biju Androose\nH 402\n8\nCAD Lab\nMs. Ruby Maria Syriac\nMr. Aravind M. S.\nH 202 A\n9\nDynamics Lab\nMr. Deepak B.S.\nMr. Aneesh S. C.\nH 302 A\nVision\nTo be a Centre of Excellence in Education and Research, imparting ethical values for the betterment of mankind.\nMission\nTo impart Technical Knowledge and Values through continuous Training and Research for the overall development of the Stakeholders.\nBoS\nThe People\nDAB\nFacilities\nNews and Events\nActivities\nResearch\nPlacement\nB. Tech PEOs, POs & PSOs\nVideo Lectures\nSyllabus\nStudent Achievements and Activities\nTime Table\nFormer HoDs"
}