{
    "filename": "mbcet.ac.in_iqac_.html",
    "content": "IQAC – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nIQAC\nINTERNAL QUALITY ASSURANCE CELL (IQAC)\nVISION\nExcellence in the quality of academics and research.\nMISSION\nTo encourage the stakeholders to imbibe and interweave quality in academics and research.\nTo undertake concurrent audit and internal/peer evaluation of the processes and the outcomes.\nTo promote the values of inclusivity, independence, self-evaluation, accountability, and innovations from the quality perspective for individual, peer and institution.\nTo arrange for accreditation by national and international accreditation bodies.\nTo collaborate with other institutions in the pursuit of institutional quality benchmarking and quality consciousness.\nObjective of IQAC:\nThe prime task of the IQAC is to seamlessly work for developing a system for conscious, consistent and catalytic improvement in the overall performance of the academic institutions by enabling quality improvement in both the domains of academics and administration.\nIQAC acts as an internal mechanism for sustenance, assurance and enhancement of the quality culture. For this, during the post accreditation period, it will channelize all efforts and measures of the institution towards promoting its holistic academic excellence.\nTemplates :\nClickhere\n(To Login)\nStrategies:\nIQAC shall, through an egalitarian approach, evolve the formal mechanisms and procedures for:\nEnsuring timely, efficient and progressive performance of academic, administrative and financial tasks.\nOptimization and integration of modern methods of teaching, learning and evaluation.\nEnsuring the adequacy, maintenance and functioning of the support structure.\nThe functions of IQAC are:\nPlanning, guiding and monitoring of Quality Assurance (QA) and Quality Enhancement (QE) activities of the Higher Education Institutions(HEI)\nDevelopment of Quality Culture in HEI\nPreparation of the Annual Quality Assurance Report (AQAR) of the HEI based on the quality parameters / assessment criteria developed by the relevant quality assurance body (like NAAC) in the prescribed format\nChannelize and systematize the efforts and measures of an institution towards academic excellence\nDevelopment and application of quality benchmarks/parameters for various academic and administrative activities of the institution\nArrangement for feedback response from students, parents and other stakeholders on quality-related institutional processes and its follow up\nDissemination of information on various quality parameters of higher education\nActing as a nodal agency of the Institution for coordinating quality-related activities, including adoption and dissemination of best practices\nDevelopment and maintenance of institutional database ( Data centre) through MIS for the purpose of maintaining/enhancing the institutional quality by documenting various programmes/activities leading to quality improvement\nPeriodical conduct of Academic and Administrative Audit and its follow-up\nFacilitating the creation of a learner-centered environment conducive for imparting quality education and faculty maturation to adopt the required knowledge and technology for participatory teaching and learning process to remain at the cutting edge of science and technology.\nOrganization of inter and intra institutional workshops, seminars on quality related themes and promotion of quality circles\nOrganizing orientation programmes for Staff and Administrative Staff in association with Teaching learning centre\nRendering feedback to the functionalities for enabling the changes and improvements.\nOutcomes of IQAC Activities\nStrategic Plan and Organizational Planning\nAccreditation – NAAC, NBA\nNational Ranking – NIRF, ARIIA\nAICTE Approval for professional courses\nUGC Graded autonomy reports\nMedia Rankings\nFeedback from stakeholders and Action Taken Reports\nAcademic and Administrative Audits\nPromotion of Technology Enhanced Learning\nAnnual Quality Assurance Report\nWorkshops/Seminars on Academic Quality and Quality Assurance measures\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}