{
    "filename": "mbcet.ac.in_faculty_dr-veena-nair_.html",
    "content": "Dr. Veena Nair – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nScience & Humanities\n>\nDr. Veena Nair\nEmployee Code / ID No.\n10717044\nQualifications\nM.A, M.Phil, Ph.D\nOrcid ID\n—–\nIndustry / R & D Experience\n4 years/11 months\nEmail ID\n[email protected]\nAlternate E-mail ID\n—–\nMobile No (Optional) / Intercom Extension No.\n137\nAreas of Interest / Current Research\nCognition and Second Language Writing, English Language Teaching, Second Language Acquisition, Bilingualism/ NLP and writing, Assistive Technology, Project based teaching\nResearch,  Consultancy, Publication\nWorkshops\nCoordinated an expert talk and orientation session for the first year B.Tech students, ‘Industry Campus Connect: Wheels of the Future’ in collaboration with the MBCET-Corporate Relations and Acsia Academy on October 16, 2024.\nCoordinated the CII- Yi(Young Indians) ‘The Future 4.0″, the flagship event of Yuva on August 10, 2024.\nCoordinated a workshop on ‘Understand the Indian Securities Market and Create Wealth’ on 27 March 2024 for S6 students.\nCoordinated a workshop on Universal Human Values for MBCET Technical Staff on July 11, 2023.\nCoordinator of the workshop “Academic Writing” organized by the Department of Science and Humanities of MBCET College (Autonomous) on November 1-November 6, 2021.\nCoordinator of the workshop “Some Applications of Mathematics in Engineering” organized by the Department of Science and Humanities of MBCET College (Autonomous) on April 28-29, 2021.\nCoordinator of a motivational talk (WSU-IIC, MBCET),\nMy Entrepreneurial Life Journey.\nResource Person: Ms. Joshila Ramesh, Founder and CEO, Aspire HR Solutions, Kochi on February 11, 2021.\nCoordinator of the workshop “Role of Science and Humanities Department in an Engineering College” organized by the Department of Science and Humanities of MBCET College (Autonomous) on 27th November, 2020.\nPresentations\nPresented a paper titled “Importance of Universal Human Values in Higher Education” at the two day National Conference organized by Mar Ivanios, MBCET and Mar Theophilus College in collaboration with KSHEC, Govt. of  Kerala (14-15 March, 2024).\nPresented a paper on at International Conference of Linguistic Society of India ICOLSI-40, CIIL, Mysore (5-7 December 2018).\nPresented a poster on ‘Task complexity and Second language writing’ at Cognition, Emotion and Action at IIT Gandhinagar (6-8 December 2013).\nPresented a paper at 1\nst\nInternational Conference of the Linguistics Society (ICOLSI), Mysore (27-29 November 2013).\nPresented a paper at Language, Education and Diversity conference, Auckland University, Auckland, New Zealand, 2011 (22-26 November 2011).\nPresented a paper at Task Based Language Teaching Conference, Auckland, New Zealand (18-20 November 2011).\nPresented a paper at 6\nth\nInternational ELTAI conference, VIT University, Vellore (16-18 June 2011).\nPresented a paper at 31\nst\nAll India Conference of Linguistics, University of Hyderabad, Hyderabad (15-17 December 2009).\nPresented a paper at National Seminar on Quality Education, EFL University, Hyderabad (16-17 November 2009).\nPresented a paper at the First international ESL EFL conference, Janardhan Rai Nagar University, Udaipur (5-7 November 2009).\nFDPs\nParticipated in a  Faculty Development Program on “Engineering Entrepreneurship and IPR” organized by KTU in association with Kerala Startup Mission and Udhyam Foundation, held from 5 to 26 March, 2025.\nParticipated in a three day virtual\nInternational Faculty Development Programme (IFDP)\non\nEmpowering English Educators: Balancing Digital Engagement, Research Innovations, and Well-being\n, held from\nFebruary 19\n.02.2025 – 21.02.2025 organised by KPRIET, Coimbatore.\npassed the 4 weeks NPTEL course “Effective Engineering Teaching in Practice” offered by IIT, Madras.\nParticipated in a 7 day FDP titled ‘Psychological Skills For Teaching & Learning’ (Oct. 10, 2023 – Oct 16,2023) offered by TLC, Ramanujan College, Delhi University\nParticipated in a workshop titled “AI-Powered Academic Writing: Exploring Opportunities for Researchers and Educators” organized by Department of Research & Publications, A2Z EduLearningHub LLP on 10th October 2023.\nparticipated in the 10-day international online workshop titled “AI for Academics: 75 Essential Tools”  organized by Fatima Mata National College, Assumption College, Bharat Mata College, Rajagiri College of Management and Applied Science and Lore and Ed Research (26 Sep-9 Oct 2023) .\nParticipated in a 7 day FDP titled ‘Psychological Skills For Teaching & Learning’ (Oct. 10, 2023 – Oct 16,2023) offered by TLC, Ramanujan College, Delhi University\nparticipated in the 10-day international online workshop titled “AI for Academics: 75 Essential Tools”  organized by Fatima Mata National College, Assumption College, Bharat Mata College, Rajagiri College of Management and Applied Science and Lore and Ed Research (26 Sep-9 Oct 2023) .\nvolunteered in the AICTE sponsored UHV Introductory FDP held from August 29- September 2, 2022 at MBCET, Thiruvananthapuram.\nparticipated in the 6 days – UHV-II FDP conducted online during 20 Jun – 25 Jun, 2022.\nParticipated in an online FDP on OBE and Application of Generative AI in Teaching and Research (SPMVV University, Tirupati & IPSR) – 18-24 Mar 24.\nDr. Veena Nair participated in a 8 day (June 26-July 3, 2024) AICTE sponsored FDP on UHV-2 at TKMCE, Kollam.\nParticipated and successfully completed 5 days Faculty Development Program- Student Induction on UHV Refresher1 (Part 1)  conducted online during 7-11 February, 2022.\nParticipated and successfully completed 5 days Faculty Development Program- Student Induction on UHV conducted online during 4-8 October, 2021.\nParticipated in the the Two Week Online Faculty Development Programme on Continuing Professional Development: Practising,  Researching and Publishing organised by the Department of Humanities and Social Sciences, National  Institute of Technology, Tiruchirappalli from 12- 23July, 2021.\nParticipated in a seven day FDP on English Language and Research  organized by Kumaraguru College of Technology, Coimbatore May 17-May  23, 2021.\nParticipated in a seven day FDP on Academic Writing organized by MHRD,  Ramanujan College, Delhi University from March 12-18 March, 2021\nParticipated in a Faculty Enablement Program organized by Infosys, Hyderabad from February 22-24, 2021.\nParticipated in a one month FDP on Faculty in Universities/ Colleges/ Higher Education  organized by MHRD,  Ramanujan College, Delhi University from November 10-December 9, 2020\nOne Week AICTE sponsored STTP on Harmony in the Workplace: Effective Interpersonal & Communication Skills held from October 26- 31,2020 organised by Department of Science & Humanities, Sri Venkateswara Engineering College, Tirupati\nParticipated in FDP on E-contents and ICT tools for innovative and Effective Teaching and Learning Process organized by Roorkee College of Management and Computer Applications, Roorkee, Uttarakhand from August 8-14, 2020.\nParticipated in Short term Faculty Development Programme (Interdisciplinary) on “Towards a Digital Era of Teaching and Learning”   organized by UGC-HRDC, University of Kerala, Thiruvananthapuram in collaboration with KSMDB College, Sasthamcotta from August 12-18, 2020.\nParticipated in FDP on “Outcome Based Education in Higher Education Sector” organized by MBITS, Kothamangalam from 23-25 July 2020.\nParticipated in International Digital Conclave on Innovations in Teaching-Learning: A global perspective organized by Marian College Kuttikkanam & Amal Jyothi College of Engineering from 14-16 July 2020.\nParticipated in FDP on Effective and Efficient Online Teaching and Content Development  organized by Audyogik Tantra Shikshan Sansthas, Institute of Industrial and Computer Management and Research, Pune, Maharashtra from July 8-9, 2020.\nParticipated in a FDP on Moodle Learning Management System organized by ICT-MHRD, Sree Narayana College, Chengannur  from  May 25-29, 2020.\nParticipated in a FDP on “Curriculum Development” organised by Children’s University, Gandhinagar and MHRD, Savitri Bai Phule University, Pune from 19 May-26 May,2020.\nFDP coordinated\nCoordinated a UHV cell-TLC workshop titled ‘Effective Administrative Governance through behavioural skills (Nov 4, 2023). Resource Person: Dr. Mary Matilda , Former Principal, Maharaja’s College.\nWorkshop\nParticipated in a workshop titled “AI-Powered Academic Writing: Exploring Opportunities for Researchers and Educators” organized by Department of Research & Publications, A2Z EduLearningHub LLP on 10th October 2023.\nparticipated in the online workshop on ‘Neuroscience in Education’ organized by Centre of Professional Education, Navrachana University, Vadodara held on August 27, 2022.\nConferences/Workshops\nParticipated in a workshop titled “AI-Powered Academic Writing: Exploring Opportunities for Researchers and Educators” organized by Department of Research & Publications, A2Z EduLearningHub LLP on 10th October 2023.\nparticipated in the online workshop on ‘Neuroscience in Education’ organized by Centre of Professional Education, Navrachana University, Vadodara held on August 27, 2022.\nParticipated in STRIDE – Social Technology and Research for Inclusive Design Excellence, an initiative under K-DISC (Kerala Development and Innovation Strategic Council), Government of Kerala on March 7, 2025 at KINFRA Park, Kalamassery, Ernakulam.\nParticipated in the One Day workshop on Biomedical innovations at SCTIMST, Poojapura on March 5, 2025.\nParticipated in UDYAMA 1.0, a three day Educational conclave  organised by the Directorate of Technical Education, Kerala from 7-10 December 2024.\nParticipated in the three day conference ‘EMPOWER-Assistive Technology Conference’ organized by NISH, Thiruvananthapuram (October 17-October 19, 2024).\nParticipated in  a half day workshop, “Digital Defenders- Strengthening Security Awareness”  at MBCET  on March 18, 2024  organized by KSAAC. Digital University Kerala.\nParticipated in an online FDP on OBE and Application of Generative AI in Teaching and Research (SPMVV University, Tirupati & IPSR) – 18-23 Mar 24.\nParticipated in the UHV Regional Conference organized by AICTE at RV College of Engineering, Bengaluru from 28\nth\nto 30\nth\nApril, 2022\nParticipated in\nDigital Assessment Tools: Let’s Be Independent Learners-webinar organised by\nCenturion University of Technology and Management,\nBhubaneswar on May 14, 2021\nParticipated in the Workshop on Course delivery cycle organized by MBCET-TLC on March 20, 2021.\nParticipated in\nThe International Education and Skill Summit – TIESS Virtual held from 27\nth\n– 30\nth\nJanuary 2021.\nParticipated in\nDesign Thinking in ELT\norganised by the\nEnglish Language Teachers’ Association of India (ELTAI)\non 13\nth\nDecember 2020\n.\nParticipated in Virtual Blended Learning: Making it Real!organised by the English Language Teachers’ Association of India (ELTAI) on 08\nth\nNovember 2020\nParticipated in Questioning Skills for the Classroomorganised by the English Language Teachers’ Association of India (ELTAI) on 01\nst\nNovember 2020.\nParticipated in the webinar on Internet and Communication Revolution, organized as part of the national webinar series Expert Voices, by Department of Basic Sciences & Humanities, Rajagiri School of Engineering & Technology (Autonomous), Kochi on 31\nst\nOctober 2020\nParticipated in Textual Appreciation: From Stylistics to Critical Stylisticsorganised by the English Language Teachers’ Association of India (ELTAI) on 25\nth\nOctober 2020.\nParticipated in the webinar on Speaking your Way Throughorganised by the English Language Teachers’ Association of India\n(\nELTAI\n)\non 18\nth\nOctober 2020.\nParticipated in a webinar Choosing Materials while Language Teaching organised by SSN college, Chennai on 17\nth\nOctober 2020.\nParticipated in the webinar on Dynamics of Teaching English Onlineorganised by the English Language Teachers’ Association of India (ELTAI) on 11 October 2020.\nParticipated in the webinar on Constructing Multiple Choice Questionsorganised by the English Language Teachers’ Association of India (ELTAI) on 04\nth\nOctober 2020\nParticipated in International Webinar on  “Second Language Acquisition Research and Insights for Effective English Language Teaching” on August 13, 2020.\nParticipated in webinar on Multiple Techniques for Learning English as a Second Language organized by ELTAI, India on August 9, 2020.\nParticipated in Catalyst Chats organized by MBCET from August 3-7 2020.\nParticipated in an Online workshop on EFFECTIVE ONLINE TEACHING TOOLS  organized by Teaching and Learning Centre and Department of Civil Engineering Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in One Day National Workshop on “The Importance of ICT and its tools”  organized by Saradha Gangadharan College, Puducherry on 23rd July 2020\nParticipated in webinar on E-Readiness by Educational Institutions during Covid-19 organized by RSET on July 21, 2020.\nParticipated in webinar on Teaching Language and Literature: Need for Meaningful Integration organized by ELTAI, India on July 12, 2020.\nParticipated in webinar on Communicative English skills for Engineering Students and Faculty organized by MBITS in association with ASAP, Govt. of Kerala and TCS from June 28-30, 2020.\nParticipated in webinar on Attentive and Focused Listening: Some Strategies organized by ELTAI, India on June 28, 2020.\nParticipated in webinar on Introducing new online self-access materials for B2 First for Schools and C1 Advanced learners organized by Cambridge Assessment English on 25 June 2020\nParticipated in webinar on Speaking at C1 and C2 organized by Cambridge Assessment English on 19 June 2020\nParticipated in webinar on Listening at C1 and C2 organized by Cambridge Assessment English on June 7, 2020.\nParticipated in webinar on Writing at C1 and C2 organized by Cambridge Online Experience Asia on June 5, 2020.\nParticipated in webinar on Assessing Speaking Online organized by Cambridge Assessment English on May 28, 2020.\nParticipated in webinar on Innovative Teaching Strategies for Intellectually Diverse Students organized by Teresa’s College Ernakulam on May 27, 2020.\nParticipated in webinar on Teaching Live English Lessons Online organized by British Council on May 25, 2020.\nParticipated in webinar on The New Normal in Education organized by Internal Quality Assurance Cell, St. Albert’s College (Autonomous) on May 23, 2020\nParticipated in webinar on Future learners need learning strategies organized by Cambridge Online Experience Asia on May 20, 2020.\nParticipated in webinar on Strategies For Academic Publications organized by Internal Quality Assurance Cell (IQAC) & IETE Student’s Forum  of  Sree Ayyappa College, Chengannur, Kerala on May 20, 2020.\nParticipated in webinar on Managing interaction and feedback in the virtual classroom organized by Cambridge Assessment English on April 23, 2020.\nParticipated in Online Learning Workshop for Faculty organized by Qaspir from April 1-3, 2020.\nParticipated in the tutorial ‘Experimental Psycholinguistics with special focus on Language Processing and Reading’, CIIL, Mysore (4 December 2018).\nParticipated in a workshop on ‘Socio-Pragmatics focusing language data of the social media’ at ICOLSI-40, CIIL, Mysore (8 December 2018).\nParticipated in “ELT methods and materials: How can we make them interesting” seminar at University of Hyderabad, Hyderabad (3-4 March 2009).\nParticipated in First International English Language Teacher Educator’s conference (British Council-EFLU), Hyderabad (22-24 January 2011).\nParticipated in Continuous Comprehensive Evaluation workshop (British Council), Hyderabad (6-10 March 2012).\nPublications\nPublished a book chapter titled ‘ Task Complexity and Language Proficiency: Its Effect on L2 Writing Production’ in Task-Based Language Teaching and Assessment: Contemporary Reflections from Across the World, Springer Singapore, pp. 139-161. ISBN No. 978\n–\n981\n–\n16\n–\n4225-8.\nPublished a paper ‘Role of Pre-Tasks in Second Language Writing’ in BELTA Journal, Volume 2, Issue 2, 2018.\nPublished a paper, “Structural Complexity, Lexical Variety and Accuracy: ‘Developmental’ or ‘Proficiency’ measures?” in EFL Journal (EFLU), 2009\nWorked as Project Associate on a U. G. C Major Research Project, “Language Across the Curriculum”; Ph.D: Cognition and Second Language Writing: An Exploratory study, 5 publications (2 journals, authored 2 Macmillan school textbooks and 1 book chapter)\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nAcademic / Professional Outreach Activities\nCoordinator of Aksharakootam club, Tensorz club and Samvaadam Club. Co-coordinator of TLC, Member of UHV cell.\nMembership in Professional bodies/ organizations\nELTAI,  ELTIF, AINET\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nDr. Veena Nair took a session on ‘Importance of Technical English and communication skills’ in IEEE-EBSCO Knowledge Feast  at Taj Vivanta.\nValue-Added course\n: Completed IPR Course (One credit course) organized by MNLU/MGCL/MBCET from March 20-24, 2021.\n86% in “Developing Soft Skills and Personality” course at IIT Madras as part of NPTEL online certification courses, 2017.\nWorked with Macmillan Publishers, Delhi as an author for English textbook (Fusion I and Fusion II) for Class VI (Project completed on November 30, 2014).\nDistinction (98.6%) in “English as Foreign Language Assessment” course at UMBC, Maryland as part of RELO E-teacher scholarship course, 2014.\nWorked as Project Associate on a U. G. C Major Research Project, “Language Across the Curriculum”, from October 1, 2008 to17 August 2009.\nCertificate Course of Proficiency in Spanish Language at C.I.E.F.L (2006).\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}