{
    "filename": "mbcet.ac.in_alumni_distinguished-alumni_.html",
    "content": "Distinguished Alumni – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAlumni\n>\nDistinguished Alumni\nDistinguished Alumni\nMs.Gayathri  Krishnan\nC.S.E( 2002-2006  )\nCleared civil service exam and works as Sub Collector, Pollachi, TN\nMr.Ramit Chennithala\nCSE 2010-2014\nSecured IRS in 2017.Presently works as Asst.Commissioner,Income Tax.\nMr,Fariq Naushad\nCSE2011-2015\nCofounder & Business Head of Teczium Solutions LTD  (Headquarters in Rwanda & operations in Kenya, South Africa , Ethiopia & Zambia )\nHe was shorlisted among the best 5 in the country for the young entrepreneur category for Rwanda Business Excellency Awards (2017) .\nCurrent Position – Cofounder & CEO Invento Technology Solutions Pvt.LTD , India\nMr.Ben John\nCSE 2007-2011\nM.Tech in Computer Technology  from\nIndian Institute of Technology Delhi  and\nMS Quantitative Finance from University of Maryland College Park.\nCurrent position :\nCitibank NA\nVice President\nCredit Portfolio Sr Analyst\nMs.Arathy Krishnan\nB.Tech ,IT,First rank (University of Kerala). M.S in Information Technology and Management from the University of Texas at Dallas, USA .\nMr.Abhijith V\nC.S.E 2013-2017\nAssociate Project Manager, Old Trafford, United Kingdom.\nMr.Savio Victor\nCSE 2012-2016\nCo-founded NEUROPLEX.Their product ‘Eyes Age’, a video intelligence software ,is used in partnership with Kerala Police.\nMr. Vishnu Anilkumar\nC.S.E 2007-2011\nMS in Computer science and is continuing as research assistant in the field of parallel computing in Technical university of Munich.\nMr.Alfred Eby Isaac\nCSE  2007-2011\nSemi-Finalist of Gandharva Sangeetham, Kairali TV and one of the finalist in Superstar 2,Amrita TV.\nPlay back singer in movies Solo,Roseguitarinal\nPresently performs in noted music bands.\nFm radio professional for 6 years\nMr. Pradeep Krishnan\nMS in Computer Science from University at buffalo,State university of New York .\nPresently ,Escalation Engineer at Netskope.\nMr.Arun Chand V\nCSE (2002-2006)\nWorks as\nPrincipal Consultant at IBS Software Services\nMs.Swathy Suresh\nCSE (2009-2013)\nSenior Software Engineer at Teradata India Pvt Ltd.\nMr.SajuAsokan\nCSE(2003-2007)\nProject lead, Java, Fusion Applications devp.Oracle,India.\nMr. Sreedish P. S.\nCSE (2004-2008)\nCompleted M. Tech in Computer Science from Indian Institute of Technology (IIT) Guwahati and currently working as a Software Engineer in Facebook London\nMr.Ajith Kumar G.S\nCSE(2007-11)\nTechnical Director, Genilok Computer Solutions\nMr. Noel Mammen\nIT (2003-2007)\nPrincipal Member of Technical Staff, Oracle USA Inc.\nHe has been working in the Silicon Valley for over 12 years and has a wide experience in software development spread across various industry domains. His experience and background includes exposure to Govt/Public sectors, Banking, Finance, High Tech and Startups.\nMs. Sajna Samad\nECE (2002-2006)\nSupply chain consultant, Oracle,\nMr. Shankar R.\nECE (2002-2006)\nGlobal Head of Marketing & Partnerships for Transportation, Tata Elxsi,\nMr. Shibu Shajahan\nECE (2003-2007)\nGeneral Manager in Al TAJ Electronics, President of the Youth wing of World Malayalee Council, Middle East Region Chairperson of MBCETAA Middle East.,\nDr. Sherin B. M\nECE (2003-2007)\nScientist B, Kerala State Council for Science Technology and Environment\nMs. Elza John\nECE (2003-2007)\nSenior Training Engineer at MathWorks\nMs. Shajeena Shahul Hameed\nECE(2004-2008)\nManager SQASFO Technologies, NeST Group\nMs. Arun Raj\nECE(2005-2009)\nSenior Product Manager, Pramata Knowledge Solutions\nMr. Varun Raj\nECE(2005-2009)\nDirector – Global Enterprise Business, Exotel\nMs. Anita Oommen\nECE(2005-2009)\nProject lead for hardware department, Vinvish Technologies\nMr. Nijo Varghese\nECE (2006-2010)\n(IIS), Deputy Director, Ministry of I&B, New Delhi\nMr. Sanju Mathew\nECE (2007-2011)\nCEO, Code of Duty Innovations, Pvt Ltd\nMr. Renjith Henry\nECE (2007-2011)\nSquadron Leader in IAF,\nMr. Jerrin Thomas Panachakel\nECE (2008-2012)\nPursuing PhD in IISC,\nMr. Ajay Thomas Mathew\nECE(2009-2013)\nExecutive officer, Ministry of Home Affair,\nMs. Gopika M. S\nECE(2011- 2015)\nInsights Analyst, LinkedIn,\nMr. Akhilesh Variar\nME (2005-2009)\nAkhilesh Variar was a researcher at a think tank in New Delhi where he worked on Chinese economy, foreign policy and international water disputes with Pakistan. Having appeared for the Civil services exam in 2011, he qualified in 2012 and joined the\nIndian Police Service (IPS). Borne to the Jharkhand Cadre\n, he has served in different districts of West SInghbhum, Giridih and Chatra where he is currently the Superintendent of Police, dealing with left wing extremism, crime control, public order, narcotics and development security\nMr. Alen Aloysius\nME (2005-2009)\nAlen Aloysius worked as Systems Engineering at Infosys till 2012. In 2012 he qualified CAT with a score of 98.47 percentile, following which he joined for Post Graduate Diploma in Industrial Management from National Institute of Industrial Engineering. In 2015 he joined\nKotak Mahindra Bank\nand presently he is designated as\nSenior Product Manager- Mobile Banking\n. He is the product head of Kotak Mahindra Mobile banking App which has a rating of 4.5 in Google play store and 4.8 in Apple store. He has Made it to the\nEconomic Times Young Leaders list 2017\n.\nMr. Siddharth G\nME (2005-2009)\nSiddharth G worked as Systems Engineering at Infosys till 2012. He joined for Masters at College of Engineering Trivandrum. In 2013 he joined as Scientist/Engineer at Indian Space Research Organization (ISRO). Presently working as\nscientist/engineer ‘SD’ at  Quality Control Division, MVIT,VSSC Trivandrum ISRO\n.\nMr.Rachin UR\nME (2005-2009)\nRachin UR\njoined AMW Motors ltd as Design Engineer. In April 2012 he got promoted as Assistant Manager at AMW Motors ltd R&D. In 2014 he joined TATA Motors ltd, ERC, Pune as Manager. In 2017 he joined\nMahindra Research Valley as Senior Design Engineer in vehicle integration department\nMr. Vishak Subramanian\nME (2005-2009)\nVishak Subramanian is a successful\nentrepreneur\nand owner of\nproduction company Merryland cinemas and Sreevisakh creations\n. He leads a film production unit name Fantastic films in association with cine actors Aju Varghese and Dhyan Sreenivasan. First film Love Action Drama\nMr.Rajaram R\nME (2006-2010)\nRajaram R has worked as Area manager- Trade marketing in Wipro Consumer Care and Lightning till 2015. After which he joined TI Cycle of India as Associate Brand Manager – Hercules/ Bsa Roadsters. He received the “\nPride of Murugappa award\n” (Group level award where 28 business units compete) for the best Digital Marketing and Communications manager in the group for year 2017. He was Promoted to Pan India Brand Manager (Hercules Roadeo).  Presently he is employed as\nSenior Manager (Performance Marketing & Digital Consumer Experience) In Flipkart India Pvt. Limited (Walmart India)\nMr. Gokul V Nath\nME (2006-2010)\nGokul V Nath started his career in robotics starting with a project he did during his college days on amphibian robot. That project was selected in national and international competitions, which helped him to build his startup to one of the most promising startups in the country. Their innovative product Gojal [smart sustainable water management system based on IOT] gained national and international attention among industrial experts.\nThey installed the device for several clients in India and abroad, which includes Delhi metro railway corporation [DMRC], cochin metro railway limited [KMRL] and static company Maldivies. He also bagged a national award from the Indian railway minister shri.Suresh Prabhu for installing gojal in KMRL.  He has also attended a management development program in IIM-K in 2018.\nHe is currently developing his dream project and looks forward to revolutionize robotics\nFlt Lt Joseph Koshy\nME (2009-2013)\nFlt Lt Joseph Koshy joined Air Force Academy Dundigal Hyderabad. All were given option to choose from the three streams of Fighters Transports and Helicopters. And being inspired by the Operational Exposure he chose Helicopters. He trained in French made Aérospatiale Alouette III in HTS Helicopter training School. Hyderabad. Thereafter in 2014 got commissioned into the Air Force and further went to train in Russian made Mil Mi8 at Bangalore, Karnataka and advanced training in Russian made Mi17v5 at UP. Thereafter was posted to Srinagar J&K. Where in he flew extensively in support of Army and various missions ranging from escalated tensions between neighbors and also in the high altitude inhospitable region of Siachen.\nHe got posted to Sulur Coimbatore in 2018 and is part of Helicopter unit which handles all operations in the southern peninsula. He was a part of Op Karuna, i.e Kerala Floods and got deployed in Pathanamthitta district.\nLieutenant Commander Reuben S Jones\nME (2008-2012)\nLieutenant Commander Reuben S Jones Cleared UGC NET JRF in 2012 and has worked as a Maintenance Engineer in MRF Ltd. Was involved in fabrication, production and maintenance wing of its fully automised plant at Ankenpally, Hyderabad.Having cleared Staff Selection Board (SSB) in 2013, he was inducted as a\nPilot into the aviation cadre of The Indian Navy\nas a Commissioned Officer. An alumini of The Indian Naval Academy and was trained in Air Force Academy, he was deployed in various missions in both Western and Eastern Fleets. Has been part of dignitaries to foreign establishments carrying out roles of benign, constabulary and diplomatic in nature.He has served in various Major and Minor Warships at Mumbai, Visakhapatnam, Kochi and Porbander carrying out various duties. Presently serving as Second-in-Command of a Naval Warship.A passionate musician, loves travelling and involves in adventure sports. His interests include squash, basketball and debates\nMr. Ashin Xavier Philip\nME (2008-2012)\nAshin Xavier Philip joined KSEB Ltd as Assistant engineer. He represented and captained the  National team, KSEB team, Senior states team in various tournaments. He is currently working at the Chief Engineer, Civil – (Investigation and Construction Central)Department, KSEB Ltd at Thiruvananthapuram. His duties involve the investigation and identification of hydro power potential in Kerala state. For his professional empowerment he is currently pursuing AMIE in Civil Engineering. His passion for the game and studies still remain as an epitome for all the Baselians\nMr. Nijo Wilson\nME (2008-2012)\nNijo Wilson worked as graduate intern in (ANERT) Agency for Non conventional Energy and Renewable Technology, Dept. of Power, Govt. of Kerala for a period of around 4 months. Works included tender preparation and compilation of project proposals for new standalone and grid connected solar photovoltaic (SPV) system.Site visits to make project proposals for new SPV systems in kannur collectorate, Medical college trivandrum and some other government schools/buildings, checking SPV systems and solar water heaters for clearing issuance of subsidies​ after installation by various dealers. In 2013, Joined School of Engineering, Cochin University of Science and Technology for M. tech in Mechanical Engineering (Thermal).\nIn 2014 Joined as\nEngineer/Officer Technical in Bank Note Paper Mill India Pvt. Ltd.\n[a 50:50 Joint venture of Security Printing and Minting Corporation of India (under ministry of Finance, Govt. of India) and Bharathiya Reserve Bank Note Mudran Private Limited (a subsidiary of Reserve Bank of India)] a special purpose vehicle created for indigenous production of Bank Note Paper in India.\nWorks included\na) supervision of erection, testing and commissioning of utilities like HVAC, Fire protection system, Pipeline works and Effluent Treatment Plant (Zero liquid Discharge -ZLD plant).\nb) Took up and completed project on multi effect evaporator (MEE) in BNPM to complete the M. Tech degree requirements in 2017.\nc) Currently dealing with operation, maintenance and process improvement activities of effluent treatment plant (ETP).\nMr. Aravind GP\nME (2008-2012)\nAravind GP did his post-graduation in Turbomachines from National Institute of Technology, Surat. Worked in the area of High-pressure ratio airfoils and designed a High Pressure Ratio Airfoil from an existing CDA Airfoil, by parameterization and Optimization using Genetic Algorithm. The existing CDA can withstand up to pressure ratio of 1.4. By using this method up to 3.0 pressure ratio is obtained with low total pressure loss coefficient and without any flow separation. Successfully completed MTech with 2nd rank.\nNow\npursuing PhD in Computational Fluid Dynamics from Indian Institute of Space Science and Technology.\nMainly working in the area of Heat and Mass Transfer Enhancement Studies in High Speed Flows. Mass transfer enhancement is often achieved by generating secondary flows, reducing boundary layer thickness, flow manipulation, and swirling motion that develop favorable gradients. Novel methods for improving convective mass transfer in high-speed flows are essential due to its inherent shortage of residence time.\nPublished several technical papers in reputed international journals and international conferences.  International Journal of Heat and Mass Transfer, International Journal of Thermal Sciences,  4th Thermal and Fluids Engineering Conference (TFEC), April 14-17, 2019, Las Vegas, Nevada, USA, International Symposium on Advances in Computational Heat Transfer, May 28 – June 1, 2017, Napoli, Italy and 15th Asian Congress on Fluid Mechanics, organized by Institution of Engineers, Malaysia, Nov 21-23, 2016 are some. Other interests include travelling photography and reading\nMr. Prabin K C\nME (2008-2012)\nPrabin K C worked as MEP site engineer for  Marriott hotel project with a  consultancy. Cleared RRB/JE  2014 exam and joined railways in 2015.Currently posted as\njunior engineer/diesel mechanical at diesel locomotive shed, Erode, Southern railway\n. Deals with load testing and maintenance of diesel locomotives\nMs. Maggy\nEEE (2006-2010)\nSolution Specialist, Microsoft India\nMr. Subin Sudhir\nEEE (2002-2006)\nAssistant Professor, Marketing, Indian Institute of Management Indore.\nHe completed his Fellow Program in Management (FPM) from the Indian Institute of Management Kozhikode and earned an MBA from the Kerala University.\nSubin has been associated with various organizations prior to joining IIM Indore, which include Indian Institute of Management Trichy, Institute for Financial Management and Research (IFMR), Institute for Customer Relationship Management (iCRM), Tata Elxsi Limited, and Wipro Technologies. His academic and non-academic experience has been highlighted with multiple projects in domains such as consumer research and insights, digital marketing, marketing automation, marketing of high-technology services, etc.\nHis research interests include consumer behavior, word of mouth, rumor research in marketing, customer relationship management, e-commerce and digital marketing. He has presented his research work in reputed academic conferences globally, and has published in leading international journals. He teaches courses such as Marketing Management, Retail Management, Customer Relationship Management, Social Media and Digital Marketing at IIM Indore.\nApart from his academic role he is also an ardent photographer, enjoys traveling and playing basketball.\nMr. Daniel T. Varghese\nProject Manager, 3S Lighting Solutions Dubai.\nHe heads the Projects Department at the firm. He was the Project Manager for Burj Khalifa Media Facade Installation commissioned on January 1, 2018. He holds about 4 years of experience in the field of Lighting Design. He is also the Founder of Sodfos Engineering Consultancy, an Architectural Lighting Design firm at Trivandrum, Kerala.\nProject Highlights\nBurj Khalifa Media Facade Installation\nAl Wasl Expo 2020 Main Plaza\nBee’ah Headquarters\nAvoki Resorts, Trivandrum\nAl Rajhi Bank – Facade Lighting\nMr. Abin Zacharia\nTerritory Manager, OBO Bettermann India Pvt. Ltd. (a 109 years old German Company)\nProducts Manufacturing- Lightning Protection System, Surge Protection Devices, Earthing System, Cable Management System, Fire Protection System\nMr. Vishnu R. S.\nDesign Engineer (Electrical), Q-Tec Switchgear W.L.L\nRoad 702, Light Industrial Area, Mesaieed Industrial City, PB No. 24477, Doha – Qatar\nwww.qtecswitchgear.com\nMr. Bobin Chandra\nEEE 2005-2009\nEntrepreneur & Co-Founder of Embright Infotech.\nMBA from College of Engineering Trivandrum, Business Venture Management from IIM Kozhikode.\nWith 9 years of industry experience in Managerial positions, he started his own venture, providing technology solutions through VR, AI and XR Technology and consultancy services, impacting education to medical fields.\nHis business skills made his venture achieve several milestones and prestigious awards in a very short span, including,\nBIRAC BIG 15 (Biotechnology Ignition Grant), highest Innovation grant awarded by the Department of Science and Technology, Government of India for year 2020.\nNidhiprayas Grant from Department of Science and Technology, Government of India.\nRecipient of TMA Adani Best Startup Award\nMs Nithya Susan Varghese\nEEE 2009-2013\nAPAC Lead Engineer, Energy Group, Canadian Solar Inc.\nCurrently heads the engineering for utility scale power projects (Solar and  Energy storage) for  the Asia – Pacific Project Business wing of Canadian Solar Inc.\nGW- scale, global design experience over running projects in Japan, Australia, Korea, Taiwan, Singapore, Malaysia and India. Having initially gained multi-domain experience in renewables in India, she pursued a Master Diploma in Renewable Energy (TERI) and other certifications in Energy Storage, Electrical vehicles, Energy trading, Carbon Tax, Project Finance etc. Currently based in Tokyo, Japan. Interests include Drones (UAVs), learning foreign languages, art and travelling\nMr. Anoop Babu\nEEE 2003-2007\nEnergy Efficiency & Renewables Office, RAK Municipality\nAnoop Babu is the Head of Renewable Energy at the Energy Efficiency and Renewable Energy Office in the Emirate of Ras Al Khaimah, UAE, responsible for all renewable energy projects in the Emirate. These responsibilities support directly the overall Ras Al Khaimah Energy Efficiency and Renewable Energy Strategy 2040, established under the patronage of His Highness Sheikh Saud bin Saqr Al Qasimi, Supreme Council Member and Ruler of Ras Al Khaimah.\nHe has over ten years of experience in the renewable energy sector, of which six years in the UAE since the launch of solar programs in 2014. Before joining Ras Al Khaimah Municipality, he worked as Head of Renewable Energy at GOPA International Energy Consultants GmBH one of the leading energy consultants in Europe and the Middle East. Played a leading consultant role in some of the major solar projects such as Mohammed Bin Rashid Solar Park Phase 3 as Owners Engineer and Phase 5 as Technical Advisor to Dubai Electricity and Water Authority (DEWA). Expo 2020 and New DEWA Headquarter Net Zero Energy Building are few projects which he has handled under Shams Dubai regulation.\nAnoop holds a master’s degree in business management and a bachelors degree in Electrical and Electronics from India. He holds a Lifetime Member (MEI) and Chartered Engineer (C.Eng) title from Institution of Engineers (India). He is also a nominated advisory board member in Innovations and Networks Executive Agency (INEA) an EU-funded project in the solar sector\nMr. Aneesh Rajendran\nEEE 2003-07\nEnergy Technologist, Energy Management Centre – Kerala, Department of Power, Govt. of Kerala\n.\nAneesh is currently pursuing M.Tech specialized in Power Systems at College of Engineering Trivandrum. He is a Certified Energy Auditor and deployed in the NMEEE & DSM division of EMC. He is handling various Energy Efficiency projects and Energy conservation activities including Energy Audits in various sectors like MSME, Utilities, DISCOMs, Transport and Climate Change. His role was instrumental in Energy efficient school schemes, Energy conservation awareness and energy efficient technology programmes including power quality, renewable energy, energy auditing etc. to educational institutions, general public, academicians.\nPrior to EMC, he has worked in the capacity of Assistant Executive Engineer (Electrical) at KTDC Ltd. and handled various construction and maintenance projects where he has more than 7 Years’ experience in the field of Energy Auditing, Renewable Energy, Design Estimation Costing & Erection of MEP works related to construction and maintenance of large-scale buildings. He was honoured with the Best Energy Manager Award in National level in the year of 2016 by SEEM. He has contributed the State Energy Conservation Awards 2016 to KTDC Ltd.He has completed and handed over more than 200 guest rooms, Convention Centres, Restaurants, HT Substations, MEP & Plant rooms at various sites of KTDC Ltd with Energy efficient greener technologies.\nHe has worked as a Technical Officer (Electrical) for Canara Bank and have managed operation and maintenance of central air-conditioned Data centre and Bangalore. Before this he has worked as Software Engineer for Satyam Computer Services Ltd. Hyderabad for 2 years and handled maintenance and support of ASP.NET – SQL server based Automotive R&D module of NISSAN, Japan client in offshore location. His professional experience spans over a total period of 13 years\nMs. Parvathy A\n2005-2009\nParvathy A (2005-2009 Batch) ,Technical Officer, Central Public Health and Environmental Engineering Organization\nMr. Renjith S Anand\n2008-2012\nRenjith S Anand (2008-2012), Assistant Engineer Kerala Public Works Department\nAbout us\nMBCETAA Contributions\nExecutive Committee\nMBCETAA-Middle East Chapter\nMBCETAA - North America Chapter\nDistinguished Alumni\nGet Involved\nMBCETAA Awards\nYouth Excellence Award\nStay in Touch\nContact Us\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}