{
    "filename": "mbcet.ac.in_innovation-entrepreneurship_skill-development-programmes_.html",
    "content": "µLearn and Skill Development Program(SDP) – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nInnovation & Entrepreneurship\n>\nµLearn and Skill Development Program(SDP)\nµLearn and Skill Development Program(SDP)\nµLearn: The Skilling Backbone of IEDC\nThe µLearn Foundation, a GTech initiative, is a futuristic learning ecosystem that blends peer-to-peer learning, community engagement, and digital skilling to cultivate a generation that’s industry-ready, self-driven, and constantly evolving. µLearn is a community-first platform that encourages students and professionals to upskill themselves in a self-paced, structured, and collaborative environment. The core idea is simple — learning should be accessible, enjoyable, and continuous.\nWhat is µLearn?\nµLearn MBCET, established in 2022, is the first-ever campus chapter of the µLearn Foundation. Born out of a shared vision to foster consistent upskilling and peer-led learning, this chapter was initiated at Mar Baselios College of Engineering and Technology (MBCET) under Catalyst Mar Baselios IEDC to equip students with industry-relevant skills through a community-first approach.\nWhy µLearn?\nIn today’s fast-changing world, traditional education alone is no longer enough. µLearn was created to bridge the gap between academics and industry-ready skills by fostering a culture of self-driven, peer-supported, and interest-based learning.\nHow µLearn works?\nLearn by Doing\n: Practical, hands-on tasks that build real-world skills.\nCommunity-Led\n: Learn together, grow together — through peer support and learning circles.\nInterest-Based\n: Explore what you love — from UI/UX to AI/ML, cybersecurity, and beyond.\nKarma System\n: A gamified learning experience that rewards consistency and contributions.\nIndustry-Connected\n: Backed by GTech and supported by real opportunities like internships, mentorship, and live projects.\nLevel-Based Growth\n: Track your journey and unlock new opportunities as you upskill.\nKarma Points\nare µLearn’s unique way of tracking your progress and contributions. You earn karma by completing tasks, participating in learning circles, helping peers, and staying consistent. The more karma you earn, the more you unlock perks, gain visibility, and get opportunities like internships, project showcases, and leadership roles.\nYour\nµID\nis your unique identity within the µLearn ecosystem — like your digital learning passport. It tracks your achievements, karma, activity history, and learning journey. Think of it as your portfolio + resume + leaderboard status — all in one.\nLeaderboards\nGetting started with µLearn\nOnboarding into µLearn –\nhttps://app.mulearn.org/\nCampus Kit –\nhttps://mulearn.org/r/campuskit\nµLearn MBCET Instagram Page –\nhttps://instagram.com/mulearn.mbcet\nµLearn Foundation Instagram Page –\nhttps://instagram.com/mulearn.official\nµLearn MBCET Discord Server –\nhttps://mulearnmbcet.bio/discord\nThe µLearn MBCET Team\nµLearn MBCET Execom 2024-25\nOur Achievements\n1st Campus to reach 2 Million Karma Points Milestone.\nµLearn MBCET proudly became the first campus chapter to cross the 2 Million Karma Points milestone in December 2024, marking a record-breaking journey of consistent learning, collaboration, and community-driven growth.\nBest Lead Enabler in 2024 – Mr. Arun J S (Assistant Professor, EC)\nMr. Arun J S,\nAssistant Professor in the Department of Electronics & Communication Engineering at MBCET, was honoured with the Best Lead Enabler in 2024 award, celebrating his outstanding leadership, dedication to empowering students and colleagues, and his pivotal role in fostering a collaborative, innovation-driven academic environment.\nBest Campus Lead in 2024 – Ms. Jyothsna P Nair (CT)\nMs. Jyothsna P Nair\n, a student of the Department of Computer Science & Engineering – Artificial Intelligence at MBCET, was awarded the Best Campus Lead in 2024 in recognition of her exceptional leadership, initiative, and dedication in driving student-led activities, promoting collaboration, and creating a vibrant and inclusive campus community.\nBest Campus Chapter in 2024 – Mar Baselios College of Engineering & Technology, Thiruvananthapuram\nMar Baselios College of Engineering & Technology (MBCET), Thiruvananthapuram, earned the Best Campus Chapter title in 2024 for its vibrant chapter activities, consistent engagement in technical and professional programs, and its strong culture of collaboration and excellence, which empowered students to grow as dynamic and future-ready professionals.\nMultiple students won the award for “Best Student of the Year 2024”.\nMultiple students from µLearn MBCET were honoured with the prestigious “Best Student of the Year 2024” title in recognition of their exceptional Karma Point achievements and active involvement in the learning community. The awardees included\nAparna G Raj\n(CS),\nV S Sabarinath\n(ME),\nArdra A Nair\n(EC), Agnivesh P S (CS),\nVasundhara S R\n(CS),\nJyothsna P Nair\n(CT), and\nVedha Mahadevan\n(CS), all of whom demonstrated remarkable dedication and initiative throughout the year.\nOnly Campus to mine 1 Million Karma Points in 2024 alone.\nµLearn MBCET stands out as the only campus to mine 1 Million Karma Points in 2024 alone, showcasing unmatched consistency and commitment to peer learning and upskilling.\nArt of Teaching 3.0 Winner – Dr. Merlin George (Assistant Professor, CS)\nDr. Merlin George\n, faculty of the Department of Computer Science & Engineering – MBCET, was honoured as the Winner of Art of Teaching 3.0, recognising her excellence in innovative, student-centric teaching and her impactful role in shaping future-ready learners.\n2nd Campus to reach 1 Million Karma Points Milestone.\nIn January 2024, µLearn MBCET became the second campus to reach the 1 Million Karma Points milestone, setting the pace for a year of impactful learning and collaboration.\nMar Baselios College of Engineering and Technology provides Skill Development Programmes to the students during the four year B. Tech course. Skill Development Programmes are envisaged to provide a sequential upgradation of knowledge which helps a novice grow to expert level.\nSDP is divided into two phases:\nFoundation Skill Certification:\nIt will be in association with Professional Bodies of the College like IEEE, IET, CSI, ISTE, ACM.\nFuture Technology Skill Certification:\nIt will be driven by Future Technologies Lab.\nWe are in discussions with TCS and UST Innovation labs for Future Technology associations. Future Technology Communities will assemble every week for knowledge sharing and learning. The College will subscribe multiple courses and the students can sit together and learn. To this group of learners, we will pool mentors and Technology experts from each vertical.\nInnovation & Entrepreneurship Development Centre (IEDC)\nMaker Space\nµLearn and Skill Development Program(SDP)\nInstitution's Innovation Council (IIC)\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}