{
    "filename": "mbcet.ac.in_faculty_dr-paul-thomas_.html",
    "content": "Dr. Paul Thomas – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nDr. Paul Thomas\nEmployee Code / ID No.\nQualifications\nB.Sc (Engg), M.Tech, Ph.D\nOrcid ID\nhttps://orcid.org/0000-0001-8587-3828\nIndustry / R & D Experience\n10.5 yrs/ 20 yrs\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9037845069 / 114\nAreas of Interest / Current Research\nSignal processing\nResearch, Consultancy, Publication\nPUBLICATIONS\nNumber of Publications: 14\nPaul Thomas, Dr. R.S. Moni, “Methods for Improving the Classification Accuracy of Biomedical Signals Based on Spectral Features”, International Journal of Advanced Research in Engineering and   Technology (IJARET),  Volume 7, Issue 1, pp 105–116, Jan–Feb 2016.\nPaul Thomas, Dr. R.S. Moni, “ANN based Multilevel classification technique with Optimum measurement period for Accurate diagnosis using    Biomedical signals”, International Journal of Engineering and          Advanced       Technology (IJEAT), Vol. 6, Issue 2, pp 63-70, Dec 2016.\nNeethu S. Ravi, Paul Thomas, “A Modular Approach to Finer Classification of ECG Signals”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering (IJAREEIE), Vol. 5, Issue 10, pp      8220-8229, Oct 2016.\nShijiya S., Paul Thomas, “A Modular Approach to Finer Classification of EMG Signals”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering (IJAREEIE), Vol. 5, Issue 10,            pp 7893-7900, Oct 2016.\nNeethu S. Ravi, Paul Thomas, “An Improved Method to Detect Common Cardiac Disorders from ECG Signals using Artificial Neural Network and Fuzzy Logic”, International Journal of Review in Electronics and Communication Engineering (IJRECE), Vol. 4, Issue 3, pp 24-28, Jun 2016.\nGayathri V. K., Paul Thomas, “EEG Compression Using Wavelet Based EBCOT Algorithm”, International Journal of Advanced Technology in Engineering and Science (IJATES), Vol. 4 Issue 6, pp 411-418, June 2016.\nShijiya S., Paul Thomas, “An Improved Method to Detect Common Muscular Disorders from EMG Signals using Artificial Neural Network and Fuzzy Logic”, International Journal of Advanced Technology in Engineering and Science (IJATES), Vol. 4 Issue 7, pp 68-75, July 2016.\nAnju Krishna, Paul Thomas, “An Improved Method for Classifying EMG Signals Based on Spectral Features Using k-NN”, International Journal of Engineering Technology and Management (IJETM), Vol 2, Issue 4, pp 108- 114, July-August 2015.\nAnu V.S, Paul Thomas, “An Improved Method for Classification of Epileptic EEG Signals based on Spectral Features using k-NN”, SSRG International Journal of Electronics and Communication Engineering (SSRG-IJECE),  2 Issue 7, pp 35-38, July 2015.\nAnju G. Nair, Paul Thomas, “A Novel Method for ECG Feature Extraction and Classification using ANN”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering (IJAREEIE), Vol. 4, Issue 7, pp 5970-5976, July 2015.\nAnju Krishna, Paul Thomas, “Classification of EMG Signals Using Spectral Features Extracted from Dominant Motor Unit Action Potential”, International       Journal of Engineering and Advanced Technology (IJEAT), Vol. 4, Issue 5, pp 196-200, June 2015.\nAnu V.S, Paul Thomas, “Classification of Epileptic EEG Signals Based on Spectral Features using k-NN”, International Journal of Research In Electronics And Computer Engineering (IJRECE), Vol. 3, Issue 2, pp 142-      145, Apr-June 2015.\nAnju G. Nair, Paul Thomas, “Feature Extraction and Classification of ECG Signal using Independent Component Analysis”, International Journal of Research In Electronics And Computer Engineering (IJRECE), Vol. 3, Issue 2, pp 155-158, Apr-June 2015.\nPaul Thomas, Dr. R.S. Moni, “Improved accuracy in detecting common health disorders from Biomedical signals by using Artificial Neural networks and Fuzzy logic”, Proceedings of International Conference on Information Systems, Energy, Environment and Safety (ISEES2016) – Sponsored by TEQIP-II, Organized by GEC, Barton Hill, Trivandrum, pp 123-128, 29-30 Sept 2016.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nAcademic / Professional Outreach Activities\nMembership in Professional bodies/ organizations\nFellow (IE), Life member (NIQR), Life member (ASI)\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}