{
    "filename": "mbcet.ac.in_faculty_mr-anil-j_.html",
    "content": "Dr. Anil J. – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nDr. Anil J.\nEmployee Code / ID No.\n10322062\nQualifications\nB TECH (Electrical & Electronics Engineering), M Tech (Computer and Information Technology), PhD\nOrcid ID\nhttps://orcid.org/0000-0002-5801-6350\nIndustry / R & D Experience\n1 year (Industry)\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9895109050/ 9074979505/408\nAreas of Interest / Current Research\nDigital Image Processing\nResearch,  Consultancy, Publication\nPublications\nAnil J , Padma Suresh L., P. Muthukumar , Krishna Veni S. H., P. Asha, Rajesh Prasad,\n” Literature Survey on Face Recognition of Occluded Faces\n”  7th International Conference on Circuit Power and Computing Technologies (ICCPCT-2024), Kollam, Kerala, India, 8tℎ- 9th August 2024.\nAnil J, Padma Suresh L.,\n” A novel fast hybrid face recognition approach using convolutional Kernel extreme learning machine with HOG feature extractor\n“, Measurement: Sensors, 2023, 30, 100907\n“Literature Survey on Application of Deep Learning in Face Recognition” in Literature Survey on Application of Deep Learning in Face Recognition (ICICICT 2022), Volume 4; August 2022\n“A Novel Approach to Enhance Face Feature Extraction using Pencil Sketches” in International Journal of Recent Technology and Engineering (IJRTE 2019), Volume 8; Issue- 1S5; June 2019\n“Soft Computing and Face Recognition: A Survey” in the Springer sponsored International Conference on Soft Computing Systems [ICSCS 2018], I. Zelinka et al. (Eds.): ICSCS 2018, CCIS 837, pp. 1–11, 2018.\n“Literature Survey on Face and Face Expression Recognition” in the IEEE conference, 2016 International Conference on Circuit, Power and Computing Technologies (ICCPCT) DOI. 10.1109/ICCPCT.2016.7530173\n“Container Tag Character Recognition using Shape representation by Fourier Descriptors” International Journal of Service Computing and Computational Intelligence (IJSCCI) ISSN: 2162 – 514X, Volume-2, Sep-2013\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\nIEEE PES Faculty Sub coordinator\nNAAC Criteria IV Dept. Sub coordinator from 22.11.2024 till date.\nNBA Criteria VII Dept. Sub coordinator from 22.11.2024 till date\nNAAC Criteria 7 Dept coordinator from 06.02.2023 to 01.02.2024\nResource person\nfor a seminar on\n‘Generative AI for symbolic reasoning’\nat Baselios Mathews II College of Engineering , Kollam on 28/2/2025.\nServed as\nResearch Workshop Session Speaker\nin the International Conference on Emerging Technologies for Intelligent Systems (ETIS 2025) organized by APJ Abdul Kalam Technological University during 7 to 9 February 2025\nReviewer\nof International Conference on Circuit Power and Computing Technologies\n(ICCPCT 24)\norganized by Baselios Mathews II College of Engineering, Sasthamcotta, Kollam on 7 and 8 August 2024.\nReviewer\nof 2024 International Conference on E-Mobility, Power Control and Smart Systems\n(ICEMPS 2024)\nco sponsored by IEEE Kerala Section and APJ Abdul Kalam Technological University and organised by dept. of Electrical and Electronics Engineering, MBCET held from 18 to 20 April 2024\nServed as\nChief Guest and Resource Person in the National Level Technical Symbosium\non Big Data Analytics and Artificial Intelligence organized by Department of Computer Science (ALACS ’24), St Alphonsa College of Arts and Science, Soosaipuram, Karinkal on 20 March 2024.\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\nIllumina activities\nAwards / Distinctions / Rank / Other Achievements if any\nOutstanding IEEE Volunteer Award 2011\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}