{
    "filename": "mbcet.ac.in_departments_science-humanities_news-and-events_.html",
    "content": "News and Events – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nScience & Humanities\n>\nNews and Events\nNews and Events\nUpcoming Events\nPast Events\nThe department is organising a three day FDP on ‘ Mentoring Matters: Strategies for Effective Academic Counselling” from May 19, 2025 to May 21, 2025 in the offline mode. For more details, please check the brochure below:\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nMs. Lakshmi J.S., Asst. Professor(S & H) successfully defended her PhD thesis titled “Synthesis, low temperature sintering and characterization of nanostructured vanadium based ceramic oxides for their applications as LTCC materials” at the Department of Physics, University of Kerala, Karyavattom campus today. Hearty Congratulations to Dr. Lakshmi J.S.\nThe department is organizing a 5 day International FDP on ‘Engineering Next-Gen Materials’ in online mode. See below brochure for more details:\nMs. Preethi P. C. , Assistant Professor, Chemistry, Department of Science and Humanities successfully defended her Ph.D. thesis entitled\n“SYNTHESIS, CHARACTERIZATION, STRUCTURAL STUDIES AND APPLICATIONS OF METAL CARBOXYLATES AND COMPOSITE MATERIALS”,\nat the Department of Chemistry, University of Kerala, Kariavattom Campus, Thiruvananthapuram on January 11, 2024. Hearty congratulations to Dr. Preethi P C.\nThe Department of Science and Humanities organized a two day (May 20-21, 2022) seminar on the topic “Graph Theory and its Applications in Engineering” for faculty and researchers. The resource persons for the seminar were Dr. Abraham T. Mathew, Principal, MBCET, Dr. Indulal G,Associate Professor ,St.Aloysius College,Edathua and Dr. Aparna Lakshman, Asst. Professor CUSAT. The first session was taken by Dr. Abraham T. Mathew on “Introduction of Graph theory‘’. The second session was taken by Dr. Indulal on “Matrix representations on Graph”. The final, full day session was handled by Dr. Aparna Lakshman on ‘Graph parameters and labelling”. Coordinator: Ms. Sabitha S. Nair, Assistant Professor, S & H Department.\nVision\nSustained excellence as a leading Centre for Basic Sciences and Humanities education imbibing its essential concepts, thereby enabling the future Engineers to have a competitive edge with a strong sense of Values.\nMission\nEnhance scientific temper among students in creating Technological and Engineering solutions and further develop analytical skills, soft skills, management skills and entrepreneurship skills, to mould them into better Professionals.\nBoS\nInstitute electives\nMinor Baskets\nThe People\nFacilities\nNews and Events\nDepartmental Activities\nPublications, Workshops & Conferences/Seminars\nFormer HoDs"
}