{
    "filename": "mbcet.ac.in_departments_physical-education_departmental-activities_.html",
    "content": "Departmental Activities – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nPhysical Education\n>\nDepartmental Activities\nDepartmental Activities\nInaugural function of Intra Mural Cricket League ‘BIG BASH’\nInter Mural Volleyball Championship 2023\nInter Mural Volleyball Championship started on 2 April 2023 in College Volleyball Arena. A total of 10 teams are participating in this championship.\nBaselion Premier League 2022-23\nBASELION PREMIER LEAGUE\nMar Baselios College of Engineering And Technology, TVM recently hosted the Baselion Premier League, a football tournament that took place from March 22 nd to March 28 th . The tournament saw the participation of 6 teams with there respective captains from our college. The team names and their captains are :\nAnanda Narayan A B (S8EC1) – GODFATHERS FC\nKrishnadas K S (S8 EC1) – ELITE 7\nPranav PS (S8 EC2) – NEXUS FC\nAlen Babu (S8 ME1) – REAL VN\nArshak Nahas (S8 CS1) – SOUTH BATALLIONS\nMadhav Saji (S8 CE1) – SPORTING QUILION\nThe tournament started with a group stage were each team played with the other teams in the group once, with the top team qualifying directly to the finals and 2 nd and 3 rd positions qualifying for the semi-finals.\nThe semi finals were equally intense, with two thrilling matches to kept the fans on the edge of their seats. The final of the tournament was played on 28 th march 2023. The final was a high- scoring affair, with both teams playing their hearts out to won the trophy. In the end, the REAL VN emerged victorious by penalty shoutout of score 2-1.\nThroughout the tournament, the players displayed excellent skills and sportsmanship, making it a pleasure to watch. The fans were also enthusiastic and supportive, creating a great atmosphere at the matches. Overall the Baselion Premier League was a great success, showing some of the best football talents in the region. The tournament was well-organized, with everything running smoothly, from the scheduling of matches to the management of the facilities. It was a great opportunity for young footballers from our college to showcase their talent and for fans to enjoy some exciting matches.\nPRIZES\nWINNERS – REAL VN\nRUNNERSUP – NEXUS FC\nBEST PLAYER – Pranav PS\nBEST GOALKEEPER – Nirmal Sabu Issac\nEMERGING PLAYER – Muhammad Nihal\nPROMISING PLAYERS – Abhinanth S\nANNUAL ATHLETIC MEET- 2023\nThe Annual Athletic Meet is an Integral part of our college and provides an opportunity for our students to showcase their athletic abilities and sportsmanship.\nMBCET Annual Athletic meet was conducted on\n10\nth\nof Feb 2023\nat Mar Ivanios College ground. Our beloved Bursar Rev. Fr. John Varghese Palanikunnathil hoisted the college flag and declared the meet open. College Principal Dr. Abraham T Mathew addressed the athletes and felicitated them. Prof. Joseph Cherian, Dr. Elizabeth C Kuruvilla along with other faculties and staff were present there at the time of opening ceremony. Just after the ceremony first event, 10000m race was declared to start.\nEven though the climate was too humid, quite a good number of athletes participated in the meet. This showed the spirit and sportsmanship among the students. In each event almost 30 students participated. Assistant Bursar Rev. Fr. Thomas Mukulampurath was also present in the ground and he flagged off 5000m race. Father was much supportive and encouraged the athletes to perform well. The most exciting event of the meet was 100m race. The audience were enthusiastic to know the Individual Champions and fastest Man and the fastest Woman of the MBCET. Shone C Achankunju (S1 EC 2) became the Individual Champion and also fastest man and Blessy Smitha Das (S3EE) became the Individual Champion and also fastest women in 2023. The athletes who got the first and second position were nominated to participate in the APJ Abdul Kalam Technological University Annual athletic meet. Evening the flag was lowered down. Vote of thanks was delivered by Dr. Deepak Raj, Assistant Director of Physical Education.\nFr.Thomas Mukalampurathu, (Assistant Bursar) Inaugurating the Senior District Throwball, Men and Women Championship on 03-12-2022.\nMBCET gives due importance to the extracurricular activities along with academic subjects for the all-round development of the students. Sports& Games aim to provide adequate Physical Education facilities that are wholesome and attractive so as to ensure a sound mind in a sound body. While coping with the pressures of studies, one needs to be healthy, both emotionally and physically. MBCET emphasizes the importance of sports as an integral part of the curriculum and envisions to produce outstanding players, by providing hi-tech sports facilities to the students.\nA -Zone Cricket selection\nA -Zone Cricket selection trials was conducted at MBCET on 2/03/2022.\n73 Players participated from different colleges from which 12 players were selected for the inter Zone selection trials to constitute University Cricket team.\nAnnual Athletic Meet 2019\nSport is such a wonderful thing in which we experience the joy, sorrow, spirit, excitement or breathe holding seconds. It’s a wonderful arena where we can witness all the emotions under one roof.\nMBCET also witnessed such a sensation in the track and field meet held at University Stadium at the College Annual Athletics on 28\nth\nSeptember 2019. The Meet was inaugurated by our beloved Bursar Father John Vilayil by hoisting the college flag at 8:30 am followed by the declaration of opening the Meet. A good number of students whole heartedly from all the branches participated in the event. The staff motivated the students and contributed their best for the successful completion of the meet. Through this, we could identify the new faces that could win gold for the college in the upcoming APJ AKTU Championship commencing in the month of September. The highlights of the meet were the relay competition and the 100 mt race that won standing ovation from the crowd in both the sections. In the closing ceremony, Prizes were distributed by Bursar, Asst. Bursar, Principal, Vice Principal, Hod EC dept. In the thank giving speech the Principal Dr. T M George appreciated the effort and hardwork of the of the Physical Education dept, students, Volunteers and staff. The function came to an end by lowering the college flag by the Bursar Father John Vilayil and handing it over to the sports secretary and then he declared the meet close.\nNexuz’19 All Kerala Inter-School Football Champions St. Joseph’s HSS\nThe final between St. Joseph’s HSS and GHSS Panampilly Nagar was decided on penalties as the game ended in a draw.\nThe closing ceremony was inaugurated by Fr. John Vilayil, Bursar Mar Baselios College of Engineering and Technology. Dr G. Kishore, Principal LNCPE, Fr. Raju, Asst. Bursar Mar Baselios College of Engineering and Technology,Dr. Pradeep Dutta,FIFA Instructor,Dr. Joselet Charles, Nexuz Convener, Ms. Jomole Joseph, Nexuz’19 Convener,Ms. Christy Francis, HOD Physical Department Mar Baselios College of Engineering and Technology,Mr.\nDeepak\nRaj, Asst. Director Mar Baselios College of Engineering and Technology were present.\nMar Baselios Trophy (Basketball)\nThe college conducts the prestigious Mar Baselios Basketball Tournament for Professional Colleges every year. Around 25 teams all over Kerala take part in the Tournament.\nResult of the Tournaments:\nYear\nWinner\nRunner-up\n2018-19\nMar Baselios Engg College,Nalanchira\nIndian Naval Academy\n2017-18\nkerala varma\nSathyabhama University\n2016-17\nMadras Christian College, Chennai\nSree  Kerala Varma College, Trissur\n2015-16\nJoint winners –\nMar Baselios Engg College, Nalanchira   & Hindustan University, Chennai\n2nd Runner-up\nMadras Christian College,Chennai\n2014-15\nNot Conducted\n2013-14\nNot Conducted\n2012-13\nMar Baselios Engg College,Nalanchira\nViswajyothi Engineering College,Muvattupuzha\n2011-12\nMar Baselios Engg College,Nalanchira\nFISAT   Angamaly\n2010-11\nMar Baselios Engg College,Nalanchira\nFISAT   Angamaly\n2009-10\nMar Baselios Engg College,Nalanchira\nFISAT   Angamaly\n2008-09\nMar Baselios Engg College,Nalanchira\nMarian Engg College, Kazhakuttom\n2007-08\nMarian Engg College,Kazhakuttom\nMar Baselios Engg College,Nalanchira\nINTER CLUB SPORTS ; GAMES COMPETITIONS\nEvents\nSection\nBaselios Premier League (Cricket)\nMen\n–\nBaselios Football League\nMen\n–\nBaselios Volleyball League\nMen\n–\nMar Baselios Annual Athletic Meet\nMen\nWomen\nBaselios Table Tennis Championship (Singles & Doubles)\nMen\nWomen\nMar Baselios Shuttle Badminton Championship (Singles & Doubles)\nMen\nWomen\nBaselios Grand Master\nMen\nWomen\nBaselios Carroms Knockout  (Singles & Doubles)\nMen\nWomen\nBaselios Basketball\nMen\nWomen\nVision\nTo be a source of emotional and physical well being of the students’ performance towards excellence through physical education.\nMission\nTo provide adequate physical education facility emphasizing the importance of sports and games.\nThe People\nFacilities\nAchievements & Participation\nDepartmental Activities\nFormer HoDs"
}