{
    "filename": "mbcet.ac.in_scholarship-award-for-engineering-aspirants_.html",
    "content": "Scholarship Award for Engineering Aspirants – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nScholarship Award for Engineering Aspirants\nScholarship Award for Engineering Aspirants\nLast Date Extended to 30 June 2022\nMar Baselios College of Engineering and Technology has instituted Scholarship Award for the best outgoing +2 students of the current year, who are desirous of pursuing Engineering Degree studies, as recognition of their merit. The Award comprises Cash Prize of Rs. 5000/- , Certificate and Memento. Scholarship will be distributed to 30 students on the basis of their merit. 5 boys and 5 girls from each of the streams of CBSE, CISCE, Kerala Plus Two will be selected for the Scholarship Awards. Selection will be on the basis of Marks or Grade, or +2 Model Exam/ Internal Exam Average, Extra Curricular Activities, Project/Seminars and Leadership Positions held by the student at the school, and so on. An expert panel shall make the selections.\nDetailed Applications recommended and forwarded by the Principal of the School last attended accompanied by a letter of Introduction, should be submitted on or before 30 June 2022. The attested copy of the +2 marklist of the recommended students should be forwarded by the School soon after the publication of the +2 results. Application can be sent through e-mail to Id:\n[email protected]\nor by post or in person to: The Principal, Mar Baselios College of Engineering and Technology, Mar Ivanios Vidyanagar, Nalanchira, Thiruvananthapuram – 695015. For details see the College website. Extended date : 30.06.2022. Website :\nhttp://mbcet.ac.in\n, Contact : 9048522229\n16.06.2022\nPrincipal\nScholarship for Engineering Aspirants\nInstituted by\nMar Baselios College of Engineering and Technology\nTotal amount of Scholarship: 1.5 lakhs\n(Rs. 5,000/- per head + certificate + Memento)\nNumber of recipients: 30\nSl. No.\nGender\nCBSE\nISE\nSTATE\n1\nBoys\n5\n5\n5\n2\nGirls\n5\n5\n5\nTotal\n10\n10\n10\nRequirements:\nApplicants must be from the Science Stream.\nShould be the best outgoing student from the Institution (boy/girl).\nApplicants should be from the State of Kerala.\nApplicants should have passed the Plus Two State/Board Exam/ International School.\nCriteria for Selection:\nMarks/percentage/grade in Plus Two Examination.\nExtra-Co-Curricular Activities: (give details)\nProjects/ Seminars/ Presentations: (give details)\nPosition held\n(Eg: School Leader, Head boy, Head Girl, Prefects etc.)\n(Proof to be submitted along with Application)\nHow to Apply:\nApplication may be sent to the Mail ID:\n[email protected]\nor by post or submitted in person. All the applications should be recommended and attested by the Head of the Institution and accompanied by a Letter of Introduction issued by the Head of the Institution. Application should be submitted on or before 15 June 2022\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}