{
    "filename": "mbcet.ac.in_departments_electrical-electronics-engineering_department-advisory-body_.html",
    "content": "Department Advisory Board – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nElectrical and Electronics Engineering\n>\nDepartment Advisory Board\nDepartment Advisory Board\nThe Departmental Advisory Board (DAB) has been framed with the objective of remaining up to date with the latest requirements of the industry and incorporating necessary components in the curriculum as much as possible. The committee develops and recommends new or revised goals and objectives of the programme. The committee also reviews and analyzes the gap between curriculum and Industry requirements and gives necessary feedback or advice actions. The DAB is composed of members from eminent institutions as well as members from industry, alumni and members of faculty of the department. The present composition of the DAB is as follows.\nDepartment Advisory Board Members 2024-25\nBijuna Kunju K, Professor, TKMCE (Academia Representative)\nJayan P P , Scientist E, Power Electronics Group, C-DAC (Industry Representative)\nAsa T V, Assistant Executive Engineer KSEB (Parent Representative)\nBaiju Udayabhanu Executive Director and Sr. VP, Software Development at zLink (Parent Representative)\nVishnu M Nair, R&D Engineer, Siemens Energy (Alumni Representative)\nElizabeth Varghese, Associate Professor and HOD, EED\nSurasmi N L, Assistant Professor, EED (DAB Coordinator)\nInvited Members\nManju Sreekumar, Assistant Professor & AHoD, EED\nShalu George, NAAC Coordinator & BOS Secretary, EED\nC Sojy Rajan, NBA Coordinator, EED\n2023-24\nDr. Bijuna Kunju K., Professor, TKMCE. (Academia Representative)\nMr. Premsagar B., Dy. GM, HLL Life Care Ltd. (Industry Representative)\nGp. Capt. E P Syam, Additional Director, DRDO, New Delhi. (Parent Representative)\nMr. Suresh Kumar S, Nodal Officer, KSEB. (Parent Representative)\nDr. Nisha G K, Professor and HOD, EED.\nMs. C. Sojy Rajan, Assistant Professor, EED (Alumni Representative)\nMs. Surasmi N L, Assistant Professor, EED (DAB Coordinator)\nVision\nTo be a Centre of Excellence in Electrical & Electronics Engineering Education, Research and Application of knowledge to benefit the society at large.\nMission\nTo mould quality Electrical Engineers, fostering creativity and innovation to address global issues.\nBoS\nDepartment Advisory Board\nThe People\nFacilities\nNews and Events\nActivities\nConferences\nWorkshops & Seminars\nResearch & Consultancy\nPlacement\nB. Tech PEOs, POs & PSOs\nOpportunities\nCurriculum & Syllabus\nTime Table\nVideo Lectures\nFormer HODs\nDepartment Google Site"
}