{
    "filename": "mbcet.ac.in_faculty_dr-neena-raj-n-r_.html",
    "content": "Dr. Neena Raj N R – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nComputer Science & Engineering\n>\nDr. Neena Raj N R\nEmployee Code / ID No.\n10223054\nQualifications\nPh. D\nOrcid ID\n0000-0002-3462-6074\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n—-\nAreas of Interest / Current Research\nDigital Image and Video Processing, Digital Image and Video Forensics, Multimedia Security\nResearch,  Consultancy, Publication\nPatent\nPatent title : ”Method and User Terminal for Determining Authenticity of Image Data”\nPatent No. : 533557, Application No.: 202341024598\nDate of Filing : 31/03/2023\nDate Of Certificate Issue: 18/4/2024\nJournal\nN. R. Neena Raj and R. Shreelekshmi,“A Survey on Fragile Watermarking Based Image Authentication Schemes”, Multimedia Tools and Applications, vol. 80, pp. 19307–19333, 2021, doi:10.1007/s11042-021-10664-y.\nN. R. Neena Raj and R. Shreelekshmi, “Fragile Watermarking Scheme for Tamper Localization in Images using Logistic Map and Singular Value Decomposition”, Journal of Visual Communication and Image Representation, 2022, doi:10.1016/j.jvcir.2022.103500.\nN. R. Neena Raj and R. Shreelekshmi, “A Secure Pixel Level Self-recovery Scheme for Digital Images”, Journal of Intelligent & Fuzzy Systems, 2023, vol. 44, pp 4481–4493, doi:10.3233/JIFS-221245.\nInternational Conference\nNeena Raj N.R. and Saeeda Sulfi, “A Secure Watermarking Based Image Integrity Verification in IoMT,” in International Conference on Computing, Communication, and Intelligent Systems (ICCCIS), IEEE, November 2023, pp. 173-180, doi: 10.1109/ICCCIS60361.2023.10425401.\nN. R. Neena Raj and R. Shreelekshmi,“Blockwise fragile watermarking schemes for tamper localization in digital images,” in International Conference on Control, Communication, and Computing (IC4). IEEE, July 2018, pp. 441-446, doi:10.1109/CETIC4.2018.8530950.\nN. R. Neena Raj and R. Shreelekshmi,“Security analysis of Hash Based Fragile Watermarking Scheme for Image Integrity,” in International Conference on Intelligent Comput ing, Instrumentation and Control Technologies (ICICICT), IEEE, July 2019, pp. 651-654, doi:10.1109/ICICICT46008.2019.8993317.\nNeena Raj N.R. and Shreelekshmi R., “A Secure Image Authentication Scheme with Tamper Localization and Recovery,” Fuzzy Systems and Data Mining VII: Proceedings of International Conference on Fuzzy Systems and Data Mining (FSDM), IOS Press, October 2021, pp 277–284, doi:10.3233/FAIA210199.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nTechnical Program Committee Member, 5th International Conference on Control, Communication, and Computing,  May 19-21 2023\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\nResource person for the workshop on Let’s Learn LaTex organized by Department of Computer Applications Christ College Vizhinjam on 25 October 2023.\nSession chair for Second National Conference on Emerging Technologies in Smart Systems- NCETSS’24 organized by Marian Engineering College, Kazhakkoottom on 2nd May 2024.\nAwards / Distinctions / Rank / Other Achievements if any\nQualified GATE\nQualified UGC-NET\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}