{
    "filename": "mbcet.ac.in_departments_electronics-communication-engineering_peos-pos_.html",
    "content": "B. Tech PEOs POs & PSOs – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nElectronics & Communication Engineering\n>\nB. Tech PEOs POs & PSOs\nB. Tech PEOs POs & PSOs\nPROGRAMME EDUCATIONAL OBJECTIVES (PEOs):\nPEOs are broad statements that describe the career and professional accomplishments that the programme is preparing the graduates to accomplish.\nThe graduates of the Programme will have a successful career as Professionals in Industry or as Entrepreneurs, encompassing a broad spectrum of areas related to Electronics and Communication Engineering.\nThey will be able to adapt to the changing needs of Industry and Academia through continuous learning and professional upgrading.\nThey will exhibit social responsibility in their pursuit for technical excellence.\nPROGRAMME OUTCOMES(POs):\nPOs  describe  what students will be able to do at the end of the programme. POs are to be specific, measurable and  achievable.\nEngineering Graduates will be able to:\nEngineering knowledge\n: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.\nProblem analysis:\nIdentify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.\nDesign/development of solutions\n: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.\nConduct investigations of complex problems:\nUse research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.\nModern tool usage:\nCreate, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.\nThe engineer and society:\nApply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.\nEnvironment and sustainability:\nUnderstand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.\nEthics\n: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.\nIndividual and team work:\nFunction effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.\nCommunication\n: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.\nProject management and finance:\nDemonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.\nLife-long learning:\nRecognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.\nPROGRAMME SPECIFIC OUTCOMES (PSOs):\nDesign Electronic Circuits and Systems for Communication, Monitoring and Control Applications.\nDemonstrate the knowledge, in Electronics, Signal Processing, Embedded Systems and Communication Engineering, required for providing technical solutions to real world problems.\nVision\nTo be a Centre of Excellence in Electronics and Communication Engineering Education and Research for the service of humanity.\nMission\nTo provide quality Engineering Education and to carry out Research in the field of Electronics and Communication Engineering addressing the challenges faced by the society.\nBoS\nThe People\nDepartment Advisory Board\nFacilities\nNews and Events\nActivities\nConferences\nResearch and Consultancy\nWorkshops & Seminars\nPlacements\nB. Tech PEOs POs & PSOs\nSyllabus\nVideo Lectures\nTime Table\nFormer HoDs"
}