{
    "filename": "mbcet.ac.in_faculty_ms-sruthi-janardhanan_.html",
    "content": "Ms. Sruthi Janardhanan – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nScience & Humanities\n>\nMs. Sruthi Janardhanan\nEmployee Code / ID No.\n10718045\nQualifications\nMSc. MATHEMATICS\nOrcid ID\nNIL\nIndustry / R & D Experience\nNIL\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n8075669449 / 702\nAreas of Interest / Current Research\nLinear Algebra, Differential Equations, Probability and Statistics/ Reliability Engineering\nResearch,  Consultancy, Publication\nPAPER PRESENTATIONS\nPresented a research paper titled “STRESS STRENGTH MODEL: RELIABILITY COMPUTATION WITH RANDOM CYCLES, INCREMENTAL STRESS, DECREASING STRENGTH AND EXPONENTIAL STRENGTH VARIABLES” at the International Conference on Applied Mathematics and Nano Science(ICAMN-2024) held at Vidya Academy of Science & Technology , Thrissur during January 23-25, 2024 and has been accepted for publication in the conference proceedings.\nCONFERENCES/FDPS/WORKSHOPS/SEMINARS/WEBINARS ATTENDED\nParticipated in the 5-Day Online Hands on Session in “PYTHON FOR AI Level II: Beginner”, held from 26/12/2023 to 30/12/2023 organized by MATHLAB RESEARCH.\nParticipated in the 5-Day Online Workshop on “MATHEMATICS FOR AI Level I: Foundation”, held from 20/11/2023 to 25/11/2023 organized by MATHLAB RESEARCH.\nParticipated in the 5-Day Online Hands on Session in “PYTHON FOR AI Level I: Foundation”, held from 06/11/2023 to 10/11/2023 organized by MATHLAB RESEARCH.\nParticipated in the three day national workshop on “DATA ANALYTICS AND PREDICTIVE MODELING” organized by the Department of Statistics, Vimala College, Thrissur supported by DBT Star College Scheme, Ministry of Science & Technology, Government of Kerala during 9\nth\nto 11\nth\nAugust 2023.\nParticipated in two day seminar on “GRAPH THEORY & ITS APPLICATIONS” organized by the Department of Science and Humanities of MBCET College (Autonomous) on 20\nth\nand 21\nst\nMay 2022.\nParticipated in the 5 day FDP on “UNIVERSAL HUMAN VALUES” organized by AICTE from 28\nth\nMarch 2022 -1\nst\nApril 2022.\nParticipated in the webinar “RECENT TRENDS IN APPLIED MATHEMATICS” organized by KSMDB College, Sasthamcotta from May 24-28, 2021.\nParticipated in the workshop “ROLE OF SCIENCE AND HUMANITIES DEPARTMENT IN AN ENGINEERING COLLEGE” organized by the Department of Science and Humanities of MBCET College (Autonomous) on 27th November, 2020.\nParticipated in the workshop on “CREATIVE LEADERSHIP IN A RAPIDLY CHANGING WORLD” conducted by Teaching Learning Centre of MBCET College during July 2018.\nParticipated in the three days short term training programme on “SCIENTIFIC COMPUTING” organized by the Department of Science and Humanities of MBCET College during 18-20 July 2018.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNIL\nAcademic / Professional Outreach Activities\nNIL\nMembership in Professional bodies/ organizations\nNIL\nCommunity Outreach Activities\nNIL\nAwards / Distinctions / Rank / Other Achievements if any\nCleared GATE (2024)\n2nd Rank in MSc. Mathematics(2016)\nProficiency winner for the years 2013 and 2014 at Mar Ivanios College, TVM.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}