{
    "filename": "mbcet.ac.in_faculty_mr-rajesh-t-n_.html",
    "content": "Dr. Rajesh T.N – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAbout Us\n>\nDr. Rajesh T.N\nProf. Rajesh TN did his Ph. D from NIT Calicut in 2019. He completed his B-Tech in Mechanical Engineering and M-Tech in Thermal Science from College of Engineering, Thiruvananthapuram in 1999 and 2007 respectively. He joined MBCET in 2008 and served in various administrative roles. He was the Head of Department of Mechanical Engineering from 2019-2023. He has a teaching experience of over 20 years. His area of research includes Reactive and non-reactive flow and Analysis of Thermal systems. Rajesh has authored many publications in International journals and conferences and has served on many conference committees.\nEmployee Code / ID No.\n10609009\nQualifications\nM-Tech(Thermal Science), Ph.D\nOrcid ID\nhttps://orcid.org/0000-0002-3076-4330\nIndustry / R & D Experience\nResearch studies at National Institute of Technology Calicut and Indian Space Research Organisation, Thiruvananthapuram from 2010-2015\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9847367020/0471-2545868(Ext.193)\nAreas of Interest / Current Research\nReactive and Non-Reactive fluid flow , Analysis of thermal systems, Bio-Mechanical systems\nResearch,  Consultancy,\nPublication\nJournals\nSam Rony Zachariah, Arva S Swami, Libin K Lukose, Aswin Raj, and Rajesh T.N,\nDesign and Analysis of a Rehabilitative aid for Spastic Feet, 2022,\nAIP Conference proceedings 2463,020061 (2022)\nhttps://doi.org/10.\n1063/5.0080364\nRajesh T.N., T.J. Sarvoththama Jothi, Jayachandran T., (2020) “Performance analysis of a vortex chamber under non-reacting and reacting conditions, Sådhanå (2020) 45:43, https://doi.org/10.1007/s12046-020-1271-1\nT.N.Rajesh, T.J. Sarvoththama Jothi, Jayachandran T., (2019) ” Preliminary Studies on Non-Reactive Flow Vortex Cooling “, Recent Patents on Mechanical Engineering,12, DOI: 10.2174/2212797612666190510115403\nNaduvilethil R.T., Jegathjothi S.J.T., Thankappan J, 2018, Hot test studies in a spark ignited vortex combustion chamber, Chemical Energy Transactions, 71, 1345-1350, DOI: 10.3303/CET1871225.\nRajesh T.N., T.J. Sarvoththama Jothi, Jayachandran T., (2018) ” Cold flow studies in a vortex thrust chamber”, Aircraft Engineering and Aerospace Technology, https://doi.org/10.1108/AEAT-07-2017-0167.\nInternational Conferences\nSam Rony Zachariah, Arva S Swami, Libin K Lukose, Aswin Raj, and Rajesh T.N, “ Design and Analysis of a Rehabilitative aid for Spastic Feet”, in Proceedings of the Recent Innovation in science and Technology RIST 2021, International Virtual Conference(Online platform), June 19 &20, 2021, EKC Technical campus, Kerala, India.\nT.N. Rajesh, T.J.S. Jothi and T. Jayachandran,“Experimental and numerical analysis of cold flow behavior in a vortex combustion chamber”, in proceedings of the International Conference on Innovative Approaches in Mechanical Engineering and Materials Science, June 15-2017, Paper No. 6,Trinity college of Engineering, Trivandrum, India.\nT.N. Rajesh, T.J.S. Jothi and T. Jayachandran,“Analysis of Vortex Combustion Cold Wall Chamber”,in proceedings of the 2th International Conference on Thermal, Energy and Environment, 2016,Paper No. 8, March 25-26,Kalasalingam University, Tamilnadu, India.\nT.N. Rajesh, T.J.S. Jothi, and T. Jayachandran, “Analysis of Vortex Combustion Cold Wall Chamber”,in proceedings of 1st International ISHMT-ASTFE Heat and Mass Transfer Conference,IHMTC 2015, Paper No. 969, December 17-19, 2015, ISRO, India\nNational Conferences\nHarishankar.S, Aswin A Asokan , Madhav Murali, Rejath R.S and Rajesh T.N, “ Design of a centrifugal impeller for lean supercharging of motorcycle engines”, in Proceedings of the 35th Indian Engineering Congress(Online platform), Paper No. MC/120/13, December 18-20 2020.\nNithin Jo Varghese, Muhammed N and Rajesh T.N,“ Mathematical modelling of a lower limb extremity using Euler-Lagrangian method”, in Proceedings of the 4th National Conference INCAM 2019 , July 3-5 2019, Paper No. 205, IISc, Bangalore\nT.N. Rajesh, T. Jayachandran and T.J.S. Jothi,“Studies on vortex cooling of a combustion chamber”,in Proceedings of the 44th National conference on FMFP, December 14-16, 2017, Paper No. 123, Amrita University, Amritapuri Campus, Kollam, Kerala.\nT.N. Rajesh, T.J.S. Jothi and T. Jayachandran,“Cold flow investigation of flow behavior in a vortex combustion cold wall”, in Proceedings of the 42nd National Conference on FMFP, December 14-16 2015, Paper No. 235, NITK, Suratkal.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\nSyllabus designed for the Open elective course Automotive Technology (MET 435) in 2019 scheme for APJ Abdul Kalam Technological University\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nDesign and development of a centrifugal supercharger system for lean supercharging of a single cylinder SI engine-PI for CERD funded students project 2021(Rs 32500).\nDesign and development of a Rehabilitative aid for Spastic Feet-PI for KSCSTE funded students project 2021(Rs10000).\nGuided the student project titled Design and development of physiotherapy aid for paraplegic patients which won the First prize (Rs 1 lakh) in Dr APJ Abdul kalam Innovation Ecosystems organised by ICT Academyin 2018.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}