{
    "filename": "mbcet.ac.in_admissions_m-tech_.html",
    "content": "M Tech Admissions 2025 – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAdmissions\n>\nM Tech Admissions 2025\nM Tech Admissions 2025\nINTRODUCTION\nMar Baselios College of Engineering and Technology (herein after referred to as MBCET) is administered by the Malankara Catholic Educational Society of the Archdiocese of Trivandrum of the Syro Malankara Catholic Church and was established in 2002.  MBCET is fully self-financed and has become Autonomous in the academic year 2020-2021. The College is affiliated to the APJ Abdul Kalam Technological University since 2015. Currently, College offers M.Tech programmes in seven specializations of Engineering and Technology under the five Departments, in the full-time regular mode, as listed under ‘Eligibility’ below.\nThe College is a member institution of the Kerala Catholic Engineering College Managements’ Association as well as the Association of Managements of Christian Autonomous Engineering Colleges of Kerala and has the minority status\nThe UGC has conferred Autonomous status on Mar Baselios College of Engineering & Technology, which has been notified by the KTU as per the direction of the Govt. of Kerala.\nMBCET offers M Tech programme in five streams of Engineering.\nM.Tech Admission 2025 – Application Form\n–\nClickhere\nM.Tech Application  – Open\nBrief Curriculum of M.Tech Programmes\nComputer Science & Engineering –\nClickhere\nEnvironmental Science and Engineering –\nClickhere\nIoT and Sensor Systems\n–\nC\nlickhere\nMachine Design –\nClickhere\nPower Control and Drives –\nClickhere\nStructural Engineering –\nClickhere\nTransportation Engineering –\nClickhere\nSeat Matrix for admission to the Fourth Batch under Autonomy\nM.Tech Programmes (since 2012)\nSeat Matrix*\nGovt\nMgmt\nNRI\nTFW\nTotal\nStructural Engineering\n9\n6\n3\n–\n18\nComputer Science and Engineering\n9\n6\n3\n–\n18\nPower Control and Drives\n5\n3\n1\n–\n09\nMechanical Engineering\n9\n6\n3\n–\n18\nIoT and Sensor Systems\n9\n9\n–\n–\n18\nTransportation Engineering\n9\n9\n–\n–\n18\nEnvironmental Science and Engineering\n9\n9\n–\n–\n18\nEligibility\nApplicant must be an Indian National.\nApplicant should have obtained the B.Tech Degree in the appropriate branch of Engineering from the APJ Abdul Kalam Technological University or the equivalent Bachelor’s degree in Engineering from other Universities approved by AICTE/UGC, UGC approved Deemed to be Universities in India.\nThe candidate should have secured a minimum of 60% aggregate marks in the qualifying Degree Examination. For SEBC & OEC students, the minimum requirement is 55% aggregate marks in the qualifying Degree Examination. For SC/ST & OEC candidates a pass in the Engineering Degree programme is sufficient. The relaxation of marks in the qualifying examination extended to SEBC candidates only will be applicable to OEC candidates, even if they are allotted against un-availed seats of SC/ST quota.  For details about the qualifying Degree see 7 below.\nIn the case of Degree certificate/ Mark list in which the aggregate mark is recorded in SGPA/ CGPA only, without stating the formula for conversion to percentage marks, the criteria prescribed by APJ Abdul Kalam Technological University for conversion of SGPA/ CGPA to percentage marks will be adopted.\nCandidates who have appeared for the final semester examination in the current academic year 2024-2025 can also apply, provided he/she has passed all the subjects up to and including the 6th semester examination. Confirmation of admission of such candidates shall be subject to the production of the qualifying Degree and henceforth satisfying conditions in the clauses 1 to 4 above, on or before the closure of admission or before a date to be prescribed by the College/University.\nSponsored candidates from Industry, R&D organizations, National Laboratories as well as Educational Institutions, who have the requisite academic qualifications shall be eligible for admission to the M.Tech programme.\nThe qualifying Degree for admission shall be in the appropriate branch of Engineering as listed below.\n#\nDepartment\nM.Tech Stream\nEligible degree\nIntake\n1\nCivil Engineering\nStructural Engineering\n(SE)\nDegree in Civil Engineering\n18\nTransportation\nEngineering (TE)\nDegree in Civil Engineering\n18\nEnvironmental Science and Engineering (ESE)\nDegree in Civil / Chemical / Mechanical / Environmental / Industrial / Automobile/ Production / Production cum Plant / Mechanical stream      Automobile       /      Mechanical      stream Production / Mechatronics Engineering, M.Sc in Chemistry/ Environmental Science/ Biochemistry/\nBiotechnology/ Microbiology\n18\n2\nComputer Science and Engineering\nComputer Science and Engineering (CSE)\nDegree in Computer Science and Engineering, Artificial Intelligence, Artificial Intelligence and Data Science, Artificial Intelligence and Machine Learning, Computer Science and Business Systems, Computer Science and Design, Computer Science and Engineering ( Cyber Security), Computer Science and Engineering (Artificial Intelligence and Machine Learning), Computer Science and Engineering (Artificial Intelligence), Computer Science and Engineering (Data Science), Computer Science and Engineering (Digital Forensics and Cyber Security), Information Technology, Applied Electronics and Instrumentation, Electrical and Computer Engineering, Electronics and Computer Engineering, Computer Science and Engineering\nand Business Systems , MCA, MSc Computer Science, M Sc in Mathematics /statistics.\n18\n3\nElectrical and Electronics\nEngineering\nPower Control and Drives\n(PCD)\nDegree in Electrical & Electronics Engineering\n9\n4\nElectronics and Communication Engineering\nIoT and Sensor Systems (ISS)\nDegree in Electronics and Communication/ Instrumentation and Control/ Applied Electronics and Instrumentation/ Electrical and Electronics/ Computer Science and Engineering\n18\n5\nMechanical Engineering\nMachine Design (MD)\nMechanical             Engineering,              Aeronautical Engineering, Automobile Engineering, Industrial Engineering,              Mechanical             Engineering (Automobile), Mechanical Engineering (Production), Mechatronics, Metallurgical and\nMaterials Engineering, Production Engineering\n18\n8.  Candidates, who have passed AMIE/AMIETE Examinations and satisfying the following conditions, are also eligible for admission.\nThey must have valid GATE score in the respective branch.\nA minimum of 50% marks for Section B in AMIE/AMIETE examination.\nImportant Dates\nPlease refer to the College website (https://mbcet.ac.in) for details about the Admission schedule.\nM.Tech Application\nOpen\nAdmission Commences on\n19.05.2025\nClasses Commence On\nWill be updated soon\nSelection process\nAllotment of Seats\n1.\nGovernment seats\n: (50% of the total number of seats for each stream )\nGovernment seats will be filled, from among the candidates who have applied to the College, on the basis of their rank in the list published by the Director of Technical Education (DTE).  The reservation policies as mentioned in the prospectus published by DTE will be followed for admission under this category. Selection will be intimated as per the following:\nRank list will be published in the College website and College notice board.\nThere will not be any separate communication to the applicants by post or email.\n2\n. Management seats: (\n50% of the total number of seats for each stream)\nSubject to the prevailing norms in this regard, 15% of the total number of seats in each stream of M.Tech are NRI seats.\nAdmissions 2025\nApplicants are advised to visit the College website for all further notifications and information on admission to the M.Tech courses in the academic year 2025-2026. Separate individual communication will not be sent to the applicants.\nSelected candidates shall report to the College at the appointed time and date for admission. Offer of admission shall stand cancelled in the event of failure to take admission at the appointed time.\nFee Structure\n:\nAdmission Fee:\nRs. 500/-\nTution Fee/Semester\nRs. 7,000/-\nSpecial fees **/semester\nRs. 5,000/-\nRefundable Caution Deposit:\nRs. 5,000/-\nUniversity Fee (Registration,\nAffiliation, Sports and Arts)\nActuals at University rates\n** Fee for other facilities.\n3. Originals of all applicable documents/ certificates listed under ‘how to apply’ below shall be submitted at the time of admission. The following documents must also be submitted at the time of admission.\nTransfer certificate from the institution last studied.\nCertificate of physical fitness from a Registered Medical Practioner.\nMigration certificate(As per Rules & Regulations of the affiliating University, if the qualifying degree is from other Universities).\nEquivalency certificate issued by Association of Indian Universities(AIU), if the qualifying degree is from Universities outside India.\nTwo passport size photographs.\nPrintout of the Application Form and one set of self attested copies of the certificates as in section listed under ‘how to apply’ below.\n4. Furnishing of false information in the application would result in forfeiture of the candidature/ cancellation of admission, if admitted. In addition, it will attract the relevant provisions of the law of the land.\n5. Management reserves the right to deny admission to any candidate even if he/she is otherwise eligible, and the reasons for the denial of admission will be recorded and informed to the applicant on request.\nREFUND OF FEES AND LIQUIDATED DAMAGES\nRefund of fees already paid, and the liquidated damages will be as per the provisions in the DTE notification.\nSCHOLARSHIPS\nAICTE Scholarships are available to students with valid GATE score, as per the prevailing Government of India norms.\nNOTE\nManagement has the discretion to change any date connected with the admission process.  If any item in this prospectus is found contrary to the provisions in the DTE notification for 2025 M.Tech admission, the provisions in the DTE notification will prevail. Any item not specifically covered in the prospectus will be as decided by the Principal and his decision shall be final. Any grievance/ complaint regarding selection and admission shall be brought to the notice of the Principal in writing.\nHow To Apply\nM.Tech Prospectus 2025:-\nClickhere\nApplication forms can be submitted online on the website of the college.\nM.Tech Admission 2025 – Application Form\n–\nClickhere\nList of documents to be submitted at the time of Admission\nQualifying Degree Certificate\nGrade Card / Mark list of each semester of the degree course\nCertificate of Standard X/ XII towards the proof of age\nDocuments to prove claim for any sort of reservation or special consideration\nGATE score card – if applicable\nRelevant Page of DTE Rank list\nConduct Certificate from the Institution last attended.\nProof for a claim, if not produced at the time of admission, will not be considered under that category.\nLate applications/ incomplete applications/ Applications not accompanied by relevant certificates are liable to be rejected, without further intimations to the candidate.\nList of Documents to be produced [in original]\nMark List (1-8 Semester) of the qualifying examination\nDegree Certificate / Provisional Certificate\nGate Score Card\nCertificate of Standard X/ XII towards the proof of age.\nTransfer Certificate.\nConduct Certificate.\nEligibility Certificate (if qualifying degree is from overseas university)\nMigration Certificate\nDocuments to prove eligibility for any reservation (Community / Income)\nCopy of relevant page containing candidate name in the DTE’s List\nTwo Passport size photographs\nMedical Fitness Certificate\nFee\nMode of Payment: online payment.\nRank List\nM. Tech Government Merit Rank List\nContact Us\nMar Baselios College of Engineering and Technology (Autonomous)\nMar Ivanios Vidyanagar,\nNalanchira P.O, Thiruvananthapuram,\nKerala, India Pin: 695015.\nFor General Enquiries:\n7907114456, 9037845069.\nFor Technical Support:\n9447715695\n.\nBrochure\nComputer Science & Engineering\nIoT and Sensor Systems and Telecommunication Engineering\nMachine Design\nPower Control and Drives\nStructural Engineering and Transportation Engineering\nContact Us\nMar Baselios College of Engineering and Technology (Autonomous)\nMar Ivanios Vidyanagar,\nNalanchira P.O, Thiruvananthapuram,\nKerala, India Pin: 695015.\nFor General Enquiries:\n7907114456, 9037845069.\nFor Technical Support:\n9447715695.\nEligibility\nImportant Dates\nSelection process\nAdmissions 2025\nHow To Apply\nList of Documents to be produced [in original]\nContact Us\nBrochure\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}