{
    "filename": "mbcet.ac.in_faculty_mr-anoop-k-johnson_.html",
    "content": "Mr. Anoop K. Johnson – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nMr. Anoop K. Johnson\nEmployee Code / ID No.\n10411019\nQualifications\nB.Tech (ECE), M.Tech (Signal Processing)\nOrcid ID\nhttps://orcid.org/0000-0003-1902-2181\nTeaching Experiance\n11 Years and 10 Months\nIndustry / R & D Experience\nNil\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9447325856/ 135\nAreas of Interest / Current Research\nSignal Processing, Communication Engineering, Biomedical Engineering\nResearch, Consultancy, Publication\nArya S Potti; Gayathri Suresh; A S Gayathri; Anjitha Raju; Anoop K Johnson, “Single Input Stereo HDR Imaging using Deep Learning”, International Conference on Advancements in Electrical, Electronics, Communication, Computing and Automation (ICAECA), Jan 2022\nGouri A. V., G. Preethi Ravisankar, Gowri H. Bhagavathi, Bhadra Maya Anilkumar, Anoop K. Johnson, “Image deblurring using IRC-Conditional Generative Adversarial Network”, International Journal of Engineering Science and Computing (IJESC), vol. 10, no. 5, pp. 25845-25850, May 2020.\nAnanthapadmanabhan A. S., Athira A. Nair, Deepa Ann Koshy, G. Kishore, Anoop K. Johnson, “Good Vibe – A Device for Early Detection and Prevention of Varicose Vein” , International Research Journal of Engineering and Technology (IRJET), vol. 7 , issue 5, May 2020.\nLibya Thomas, Anoop K. Johnson, “Multi Exposure Image Fusion Using Synchrosqueezing Transform” in International Research Journal of Engineering and Technology (IRJET).\nLibya Thomas, Anoop K. Johnson ” Synchrosqueezing Transform and Its Application: A Review “, International Research Journal of Engineering and Technology, Vol:6, Issue:1, e-ISSN: 2395-0056, p- ISSN: 2395-0072, PP 1536-1541, January 2019\nSarath Lal T S, Anoop K. Johnson ” Modified PSO Based Facial Emotion Recognition System “, International Journal of Science and Research (IJSR), Vol:7, Issue:12 ISSN: 2319-7064, PP 1081-1090, December 2018\nAthira Raveendranath, Anoop K. Johnson ” Single Shot HDR imaging using Power law transformation and Exposure Fusion”, IEEE International Conference on Communication Systems and Networks (ComNet), July 2016\nBob P George, Anoop K. Johnson ” Multiclass SVM and HoG based object recognition of AGMM detected and KF tracked moving objects from single camera input video “, IOSR Journal of VLSI and Signal Processing, Vol:6, Issue:5 (Version -1)e-ISSN: 2319-4200, p- ISSN: 2319-4197, PP 10-16, September 2016\nAnoop K Johnson, Jiji C. V, ” Single Shot High Dynamic Range Imaging using Histogram Separation and Exposure Fusion”, IEEE National Conference on Computer Vision, Pattern Recognition, Image Processing and Graphics (NCVPRIPG) December 2015\nNayana A., Anoop K. Johnson, “High Dynamic Range Imaging- A Review” in International Journal of Image Processing (IJIP), Vol. 9, Issue 4, 2015.\nNayana A., Anoop K. Johnson, “Ghost Removal in High Dynamic Range Images using SVD and Disparity Map” in InternationalJournal of Advanced Research in Electrical, Electronics and Instrumentation Engineering (IJAREEIE), Vol. 4, Issue 7, July 2015.\nSreelakshmi S., Anoop K. Johnson, “Comparison of Contrast Enhancement Techniques”, International Journal of Graphics and Image Processing (IJGIP) Vol. 5, Issue 2, page no: 70-74, ISSN 2249 –5452, May 2015.\nSreelakshmi S., Anoop K. Johnson, “Image Contrast Enhancement using Pyramidal transforms and SVD”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering (IJAREEIE), ISSN: 2278-8875 ISSN: 2320-3765 (print), Vol. 4, Issue 7, July 2015.\nAnoop K Johnson, G Jayakrishnaraj and N Vijayakumar ” A Spectral Method for PMD Compensation in High Speed Optical Networks” International Conference on Technological Trends (ICTT), November 2010\nAkhil A Vijay, Anoop K Johnson “An Integrated System for Tracking and Recognition using Kalman Filter”, IEEE International Conference on Control, Instrumentation, Communication & Computational Technologies (ICCICCT), July, 2014.\nBhakthapriya P K, Rini Issac, Saarika B S, Tanya Philips, Anoop K Johnson “ Smart e-Passport using EVCS”, International Conference on Speech and Signal Processing (ICSSP),pp 221-225 August 2014\nSharon Roshan John, Nancy Prisilla, Juby Pullipra Mathew, Paul J. Ommen, Anoop K. Johnson, “Cross Spectral Face Recognition”, National Conference on Advances in Computational Intelligence and Communication Technologies(NCACICT) pp. 23-26, June 2013.\nChithra M, Lekshmy S.R, Sachin George Johnson, Subin Mathew, Anoop K Johnson, “Real Time Eye Detection to Monitor Drowsiness”, National Conference on Technological Trends (NCTT), November 2012\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNA\nAcademic / Professional Outreach Activities\nIEEE EMBS Kerala Chapter executive committee member\nMembership in Professional bodies/ organizations\nIEEE, ISTE Life Member, IEEE EMBS\nCommunity Outreach Activities\nCo-ordinated the Mission Reconnect program as part of Re Build Kerala Flood Relief KSEB initiative (Alappuzha District) during Aug 2018.\nAwards / Distinctions / Rank / Other Achievements if any\nFirst rank for M.Tech degree from Kerala University.\nReceived  Silver with  Elite Certificate (Topper – 5%)  for the NPTEL online course on  “Joy of Computing using python\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}