{
    "filename": "mbcet.ac.in_research_consultancy_.html",
    "content": "Consultancy – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nResearch & Consultancy\n>\nConsultancy\nConsultancy\nMBCET’s staff actively participates in diverse consultancy activities, aiming to foster a strong collaboration between academia and the industry. These engagements offer a unique opportunity to understand the needs of various industries and integrate them into the academic programs of the College.\nDEPARTMENT OF CIVIL ENGINEERING\nEXPERTISE OF THE DEPARTMENT TO OFFER CONSULTANCY SERVICES\nThe Department of Civil Engineering possesses a diverse range of capabilities that make it well-equipped to undertake consultancy services in various fields. With a team of highly skilled and experienced faculty and cutting-edge technologies, the Department offers a wide range of consultancy services. Some of the key areas of consultancy are as follows:\nSoil Investigations\nTotal Station Surveying\nGNSS (Global Navigation Satellite System) Surveying\nStructural Design Services\nMix design – Concrete and Bituminous mixes\nMaterial testing and characterization\nTraffic and Planning Studies\nPavement Evaluation\nWater quality assessment\nWaste Management\nONGOING CONSULTANCY ACTIVITIES\nMBCET is empanelled by the Government of Kerala for Consultancy works for the Kerala Public Works Department vide G.O. (Rt.) No. 210/2022/PWD dated 25.02.2022. Under this, the department is undertaking consultancy works and some of them are listed below:\nSoil Investigation works at different sites in Kerala for PWD, Kerala Water Authority and Kerala Infrastructure Investment Fund Board (KIIFB)\nLand surveying/ GPS surveying for various clients\nIn addition, the following consultancy services were also provided:\nMaterial testing for various clients – Concrete cubes, tiles, reinforcement bars etc\nConcrete mix design\nTraffic volume study for the project, “Preparation of DPR for Integrated Development of Coastal Highway with Cycle Track in Thiruvananthapuram, Kollam and Alappuzha District” by KSCSTE – National Transportation Planning and Research Centre (NATPAC)\nParking Studies for the Project “Development of Parking Policy Framework for Kerala” by KSCSTE- NATPAC.\nMaking prototype of Anakkampoyil-Kalladi-Meppadi Twin Tube Road Tunnel for Konkan Railway Corporation Ltd, KIIFB, PWD.\nDEPARTMENT OF COMPUTER SCIENCE AND ENGINEERING\nEXPERTISE OF THE DEPARTMENT TO OFFER CONSULTANCY SERVICES\nMachine Learning\nComputer Vision\nCyber Security\nComputer Networks\nIoT and Sensors\nONGOING CONSULTANCY ACTIVITIES\nCOLLABORATIVE WORK WITH ICCONS\nThe Department of Computer Science and Engineering has initiated collaborative research work with the Institute for Communicative and Cognitive Neuro Sciences for developing an\nAssistive Aid for Autism\n. The app developed helps autistic kids to communicate through their thoughts and emotions, share ideas, needs, and wants and, enhance their learning capabilities. Faculty involved in the project are Dr. Tessy Mathew, Dr. Jesna Mohan and Dr. Jisha John (Dept. of CSE), and Ms. Deepa P L (Dept. of ECE)\nCOLLABORATIVE RESEARCH WORK WITH THE STRATEGIC ELECTRONICS GROUP OF C-DAC, THIRUVANANTHAPURAM\nThe Network Security Research group of the Department of Computer Science and Engineering has initiated collaborative research work with the Strategic Electronics group of the Centre for Development of Advanced Computing (C-DAC), Thiruvananthapuram on\nmachine learning applications in the field of cyber security\n.\nCOLLABORATIVE RESEARCH WORK WITH SCTIMST\nThe team comprising of Dr. Tessy Mathew, Dr. Jisha John, Dr. Jesna Mohan (Dept. of CSE, MBCET), Ms.Deepa P.L (Dept. of ECE, MBCET), and Dr Sanjeev V Thomas (Professor of Neurology (Sr. Grade) Head of the Department of Neurology SCTIMST) have completed a project on\nMalformation Risk Prediction with Machine Learning Modelling for Pregnant Women with Epilepsy\n.\nThis collaborative project of MBCET with Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) was presented in 34\nth\nInternational Epilepsy Congress (IEC), 2021 organized by International League Against Epilepsy (ILAE) and International Bureau for Epilepsy, on 31st August 2021 at Dublin, Ireland.\nDEPARTMENT OF ELECTRICAL AND ELECTRONICS ENGINEERING\nEXPERTISE OF THE DEPARTMENT TO OFFER CONSULTANCY SERVICES\nElectric Vehicles\nRenewable Energy Systems\nSimulations in Space Orbits\nSmart Grid\nONGOING CONSULTANCY ACTIVITIES\nORBITAL DEBRIS PROPAGATION AND PROXIMITY AWARENESS\nFunded  By : THESPACELABS ,Trivandrum\nPrincipal Investigator: Dr. Ushakumari S.\nCo-Investigators: Ms. Elizabeth Varghese and Mr. Aswin. R. B\nResearch Assistant: Ms. Amala Justin\nResearch grant: Rs. 2,00,000/-\nProject Overview\nOrbital debris-defined as any human-made space object orbiting Earth that no longer serves any useful purpose poses a significant and growing hazard for safe spaceflight operations. As the orbital debris poses threats to the live satellites, it is paramount to predict the debris movements around the live satellites. The movements can be predicted if the forces acting on the debris are accurately modeled. The forces like solar pressure, gravity effect due to Sun, Moon and Earth play a vital role for the simulations.\nObjectives of the project\nOrbital debris propagation modelling\nConjunction analysis\nCollision avoidance analysis\nReentry Analysis\nProximity analysis.\nDEPARTMENT OF ELECTRONICS AND COMMUNICATION ENGINEERING\nEXPERTISE OF THE DEPARTMENT TO OFFER CONSULTANCY SERVICES\n5G/6G communication technologies\nVLSI &Embedded system\nMachine learning and Deep learning\nBiomedical Signal Processing and Image processing\nAssistive Technology, 3D printing\nTo foster research culture among the faculty and encourage student research in developing new technologies and thus provide consultancy services, partnership has been established with several core industries like Vinvish technologies, Acsia technologies, NISH, SCTIMST, INTEL and AUK Computing, CDAC, KELTRON, TATA Elxsi,  Maven Silicon and Metro Scans. The faculty members are in constant touch with these industries in tracking the recent technologies and needs of society.  Faculty members & students are permitted to work on industrial projects & consult with reputable R&D for project advancements. The various research groups in the Department are heavily involved in both internal and externally financed projects.\nThe\nIntel Unnati data-centric lab\nat MBCET is a center that focuses on enhancing skills in artificial intelligence applied to IoT (Internet of Things). It is powered by the industry and aims to provide faculty and students with the necessary data-centric skills. These skills will enable them to develop valuable solutions for various sectors, such as industry, agriculture, social services, and public administration. Additionally, the electronics and communication department has the following facilities to support consultancy work.\ni) MATLAB software with campus license.\nii) Software such as LabVIEW, Ansys, Xilinx for system modelling and simulation.\niii) High end computing facilities with GPU, 3D printing facility\niv) ADALM-PLUTO SDR Spectrum Analyzer in the frequency range of 5KHz to 3GHz\nv) LA-2164 Expand Logic Analyzer with 1GHhz/4Mega memory, 32/64 channels\nvi) Development Boards of Texas for communication and signal processing applications such as TMS 320C6713, TMS320C5416, TMS320C5510, TMS320C6416, MS320C2812\nFPGA Development Board like Sparten-6 and latest boards of Altera which provides an enhanced hardware platform for the implementation of various communication and switching applications of high-frequency power converters.\nFiber Optic Analog and Digital Link available for performing experiments related to optical signal transmission\nONGOING COLLABORATIVE PROJECT WORKS\nCOLLABORATION WITH UNIVERSITI TEKNOLOGI MARA, MALAYSIA (UiTM)\nThe department of ECE has initiated collaborative work with UiTM in the area of Intelligent Reflecting Surface Assisted Millimetre Wave Communication for 6G. The project has two phases:\ni. To investigate the joint problem of IRS phase tracking and mm-Wave beam tracking in terms of coverage probability and data rate.\nii. To propose reactive and intelligent algorithms to jointly optimize the IRS phase tracking and mm Wave beam.\nTeam members from Universiti Teknologi Malaysia: Professor Ir. Dr. Sharul Kamal Abdul Rahim, Dr. Bruce Leow Chee Yen, Prof. Dr.Jafri Din, Siti Fatimah Ausordin.\nTeam members from MBCET: Dr, Jayakumari J. (Prof. and HoD), Dr. Sreedevi P. (Asso. Prof.), Ms. Teena Rajan, Mr. Shiras S.N. (Asst. Professors)\nPROJECT COLLABORATION WITH NISH\nWith a Memorandum of Understanding with the National Institute of Speech & Hearing (NISH), the ECE Department has undertaken various projects related to assistive technology. Some of these projects are:\nConnected Announcement System for Hearing Impaired (CASHI) developed for deaf students at NISH.\nVocal Tract Resonance Measurement & Fundamental Frequency Estimation using Praat\nPROJECT COLLABORATION WITH CEDS\nCeDs provided financial & technical assistance for projects focused on disabilities and disability-related services. Accordingly, Interface for Hearing Impaired and Talking Disability with Normal People, Visual Interface System for the Disabled (VSID), Kazcha: Text to Speech Convertor were developed.\nPROJECT COLLABORATION WITH HLL\nWireless System for Water Level Monitoring in Overhead Tank was developed for HLL Life Care Limited.\nDEPARTMENT OF MECHANICAL ENGINEERING\nEXPERTISE OF THE DEPARTMENT TO OFFER CONSULTANCY SERVICES\nComputational Fluid Dynamics\nFluid Structure Interaction\nEnergy Audit\nEnergy Saving Opportunities\nNonlinear Vibrations\nLean Manufacturing\nIndustrial Practices\nOptimisation of Supply Chain Management\nSustainability Assessment\nGreen Initiatives\nCONSULTANCY UNDERTAKEN\nCast Iron Recycling Unit (CIRU) – Casting of cast iron blocks, gear blanks etc. for various educational institutions\nExhaust and performance analysis of bio fuel sample\nBomb Calorimeter analysis- IC Engines Lab.\nIn-house Internship Proposals\nMoUs\nResearch\nConsultancy\nFunded Projects\nIn-house Projects\nResearch Promotion Schemes\nProfessional Development Allowance\nPublication Incentive Claim Form\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}