{
    "filename": "mbcet.ac.in_faculty_dr-vinod-v_.html",
    "content": "Dr. Vinod V – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nMechanical Engineering\n>\nDr. Vinod V\nEmployee Code / ID No.\n10608010, KTU-F4731\nQualifications\nPh.D.\nOrcid ID\n0000-0003-3897-3388\nIndustry / R & D Experience\n–\nEmail ID\n[email protected]\nAlternate E-mail ID\n–\nMobile No (Optional) / Intercom Extension No.\n–\nAreas of Interest / Current Research\nMechanical Vibrations, Nonlinear Dynamics\nResearch,  Consultancy, Publication\nPublications in peer reviewed journals\nVinod V, Bipin Balaram, “On the spatial spread of active control in a Van der Pol ring via synchronisation and its stabilisation using parameter mismatch”,\nCommunications in Nonlinear Science and Numerical Simulation\n– Elsevier,  Volume 117, February 2023, 106944; Impact factor 4.186; Q1 Journal\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, Effect of configuration symmetry on synchronization in a van der Pol ring with nonlocal interactions, Nonlinear Dynamics, Springer, 89(3), 2103-2114, 2017. Impact factor (2020): 5.022.,Q1 Journal\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, Effect of oscillator and initial condition differences on the dynamics on a ring of dissipatively coupled van der Pol oscillators, Journal of Mechanical Science and Technology, Springer, 29(5), 1931-1939, 2015. Impact factor (2020):1.734., Q2 Journal.\nInternational Conferences\nAdithya Krishna Menon, Vinod V “Proposal of A Mutual Inertia Force Coupling on The Wake Oscillator Model For Vortex Induced Vibrations”, 9th International and 49th National Conference on Fluid Mechanics and Fluid Power, IIT Roorkee, December 2022\nStrategies of Amplitude Control in a ring of self-excited oscillators, Vinod V, Bipin Balaram, 16th International Conference on Dynamical Systems – Theory and Applications, Lodz University of Technology, Poland, 2021.\nSangeeth,Mohan N R, Vinod V, Comparative study on the synchronization of coupled Van der Pol Oscillators under Reactive , Dissipative and Conjugate coupling, 7th Asian Joint Workshop on Thermal Physics and Fluid Science, 2018.\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, An initial condition dependent oscillation control in an odd and even number van der Pol ring., 10th Conference on Nonlinear Systems and Dynamics, IISER, Kolkata, 2016.\nDeepak B S, Hari Venkit, Vinod V, Effect of forcing frequency on mutually coupled Van Der Pol oscillators, Dynamic Days Asia Pacific 08, Indian Institute of Technology, Chennai, 2014.\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, Mutual synchronization of dissipatively coupled limit cycle oscillators in a ring, 8th Conference on Nonlinear Systems and Dynamics, Indian Institute of Technology, Indore, 2013.\nNational Conferences\nDeepak L, Ganesh A, Dit R.S., Sreehari S.H., Vinod V., Krishnamohan G.P., Molecular Dynamics of carbon capture from the emissions of an IC engine using ZSM-5., 4th National conference on Multidisciplinary Design, Analysis and Optimization-IISC Bangalore, 2021.\nVinod V, Sajikumar K.S., Design and analysis of an antenna mounting structure for satellite application, Awarded as the best paper in Machine Design, National Conference on Technological Trends, 2007.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\nKTU Board of Studies Member\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nBest paper Award in Machine Design (NCTT -2007), College of Engineering Trivandrum\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}