{
    "filename": "mbcet.ac.in_faculty_ms-neetha-chandran_.html",
    "content": "Ms. Neetha Chandran – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs. Neetha Chandran\nEmployee Code / ID No.\n10323066\nQualifications\nM.Tech (Power Systems)\nOrcid ID\n—-\nIndustry / R & D Experience\n5 years as Operator in 66Kv Substation, Kerala State Electricity Board PVT. Ltd\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n8157962206\nAreas of Interest / Current Research\nPower Systems Engineering\nResearch,  Consultancy, Publication\nUndergoing Research Project on SUBSTATION AUTOMATION SYSTEMS in MBCET IN-HOUSE R&D PROJECT.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nThe project “Smart Demand Response for Consumers” by Archit S Thampi, Muhammad Faris, Nevin Thomas John, and Sravan A R was presented to Kerala State Electricity Board (KSEB) Ltd officials was guided by Assistant Professors Ms. Neetha Chandran and Mr. Ayush Vijayan.\nParticipated & completed the 20 days Faculty Development Program (FDP) on Engineering Entrepreneurship and IPR organized by APJ Abdul Kalam Technological University in association with Kerala Startup Mission (KSUM) and Udhyam Learning Foundation.\nParticipated & completed the 30 days national level online event MATLAB for Engineers: An Experiential Learning organized by the Department of Electrical & Electronics Engineering, MIT – Manipal in association with MathWorks India Private Limited.\nParticipated & completed 5 days AICTE Training and Learning (ATAL) Academy Faculty Development Program on Advanced Technologies for Smart Power Systems at Noorul Islam Centre for Higher Education.\nNAAC CRITERIA V Coordinator\nNBA CRITERIA IV Sub Coordinator\nMember in Music Club and Arts Performing Club, Environment Cell.\nMembership in Professional bodies/ organizations\nMember in Contract Operators Union in Kerala State Electricity Board PVT. Ltd\nCommunity Outreach Activities\nIllumina activities\nAwards / Distinctions / Rank / Other Achievements if any\nSelected as best participant among 230 participants in a national event organized by EEE department, Manipal Institute of Technology in association with Mathworks.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}