{
    "filename": "mbcet.ac.in_faculty_mr-jijo-jose_.html",
    "content": "Mr. Jijo Jose – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nMr. Jijo Jose\nEmployee Code / ID No.\n10418066\nQualifications\nM.Tech in Signal Processing\nOrcid ID\nIndustry / R & D Experience\n2 Years\nEmail ID\n[email protected]\nAlternate E-mail ID\nMobile No (Optional) / Intercom Extension No.\n180\nAreas of Interest / Current Research\nIoT, Embedded systems\nResearch, Consultancy, Publication\nJijo Jose, H Aravind Sarma,” Real Time Fall Detection Model with Action Recognition”, Global Conference on Information Technologies and Communications (GCITC), December 1, 2023.\nJijo Jose, H Aravind Sarma, “Deep Learning Based Real Time Fall Detection Model”, 3\nrd\nInternational Conference on Emerging Techniques in Computational Intelligence, September 21 2023, ISBN:979-8-3503-0061-1, DOI: 10.1109/ICETCI58599.2023.10331387.\nJijo Jose, Sachin Thomas John “Implementation of LoRaWAN and its analysis for IoT enabled applications”, International Journal of Engineering science and Computing, July 20202.\nJijo Jose, Mithun Vijayan, Arunima S. Kumar, “Performance Analysis of OFDM based ROF System”, International Journal of Science & Engineering Research, Volume 7, Issue 4, April 2016.\nJijo Jose, Sreenath S. L., Tony Jose, and Vijayakumar Narayanan, “Gain Contouring in Erbium Doped Fiber Amplifiers Using Photonic Switching”, 12th International Conference on Fiber Optics and Photonics published in OSA Technical Journal (online) Optical Society of America 2014, Paper M4A.58.\nJijo Jose, Vijayakumar N., “Study of Performance Enhancement of Wavelength Reuse Multichannel Radio over Fiber (RoF) System”, Elsevier International Conference on Speech and Signal Processing, pp. 324-327, 2014.\nJijo Jose, Vijayakumar N., “Optical Signal Processing for the Performance Enhancement   of RoF System”, Proceedings of National Conference of Emerging Technologies, pp. 573-576, August 2014.\nJijo Jose and Jibin G. John, “GVD Construction and FPGA Implementation Using Correction And Prediction Strategy”, NCOM – 10.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n• Served as member of Academic Technical Sessions Committee of the 27th National Children’s Science Congress held at Mar Ivanios Vidya Nagar, Trivandrum  •Currently Serving as Convener of Institution’s Innovation Council (IIC), Mar Baselios College of Engineering & Technology, Trivandrum.\n•Coordinator, Mentor Mentee Program of Institution’s Innovation Council (IIC), MBCET\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\nQualified Gate-2012\n• Innovation Ambassador (Pre-Incubation and Incubation) of Institution’s Innovation council  (IIC), Mar Baselios College of Engineering & technology, an initiative of MHRD, Govt. of India\n• Invented and Presented SUDOG (Stray Dog Repeller) during Product Launching session conducted by APJ Abdul Kalam Technological University held at Federal Institute of Science & Technology(FISAT), Angamali and the article published in dailies like The Hindu, Deccan Chronicle, Malayala Manorama etc.\n•  Judge for the event Firefighting Robot, Roborave India, International Robotic Competition held first time in India at Choice International School, Cochin\n• Best outgoing student of the college during UG Studies.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}