{
    "filename": "mbcet.ac.in_faculty_ms-manju-sreekumar_.html",
    "content": "Ms. Manju Sreekumar – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs. Manju Sreekumar\nEmployee Code / ID No.\n10311020\nQualifications\nM.Tech (Embedded Systems), Pursuing PhD\nOrcid ID\n0000-0001-9759-2230\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n402\nAreas of Interest / Current Research\nArtificial Intelligence, Autonomous Vehicles, Embedded Systems\nResearch,  Consultancy, Publication\nVishnu M Nair, Nanditha Sai Prasanth,Amaze Anna Toms, Abinshah Ameer, Manju Sreekumar, “Demand Management System using Artificial Intelligence and IoT”, 9th Scopus Indexed International Conference on Innovations in Computer Science and Engineering (ICICSE 2021), September 2021.\nThara V Mohan, Manju Sreekumar, “Comparison of non-linear and linear model predictive control of point absorber wave energy converter”, International Research Journal of Engineering and Technology, Vol 5, Issue 5, May 2018.\nThara V Mohan, Manju Sreekumar, “Power Maximizing of Point Absorber Wave Energy Converter by Model Predictive Control”, International Journal of Innovative Research in Science, Engineering and Technology, Vol. 7, Issue 4, April 2018.\nParvathy G, Manju Sreekumar, “Analysis of Time Domain Specifications of a large Scale PV Integrated Multi Machine Power System using LQR and LQG Control Techniques”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, Vol.6, Issue 4, April 2017.\nGeethu U G, Manju Sreekumar, “Comparative Study of Direct Torque Control in Four Switch and Six Switch Three Phase Inverter”, IJSRD – International Journal for Scientific Research & Development Vol. 4, Issue 04, June 2016.\nAneetta Raj, Manju Sreekumar, “An MPPT Control of Photovoltaic system using Fuzzy Logic Controller”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, Vol. 5, Issue 6, June 2016.\nAnns Thomas Mathew, Manju Sreekumar, “Three Phase Induction Motor Drive Using Boost Converter and 3 Level Inverter fed from Photovoltaic Panel”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, Vol. 4, Issue 10, October 2015.\nAnns Thomas Mathew, Manju Sreekumar, “Three Phase Induction Motor Drive using Boost Converter and SVPWM Inverter Fed from Photovoltaic Panel”, SSRG International Journal of Electrical and Electronics Engineering (SSRG – IJEEE), V2(8), 21-24 August 2015. ISSN:2348 – 8379.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNA\nAcademic / Professional Outreach Activities\nCoordinator of a 4 month online symposium ‘Urjapariraksh’ to create an awareness of energy conservation which was open for school and college students across Kerala.\nCoordinated Online Interactive sessions for EEE students with various eminent personalities and alumni members.\nNAAC Criteria 3 Department Coordinator, NBA Criteria 5 member, e-Yantra Department Coordinator, Department Association Coordinator\nGuided B.Tech project funded by Energy Management Centre (2020-2021).\nMembership in Professional bodies/ organizations\nISTE – Life membership,IEI – Corporate membership\nCommunity Outreach Activities\nAs Faculty Coordinator of Illumina,Association of Department of Electrical and Electronics Engineering, coordinated various outreach activities\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}