{
    "filename": "mbcet.ac.in_faculty_dr-alice-thomas_.html",
    "content": "Dr. Alice Thomas – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nCivil Engineering\n>\nDr. Alice Thomas\nEmployee Code / ID No.\n10121091\nQualifications\nPh.D.\nOrcid ID\nhttps://orcid.org/0000-0002-1433-7064\nIndustry / R & D Experience\nTeaching Assistant(IIT Bombay) : 8 Years; Research associate (NCESS) : 2 Years\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n–\nAreas of Interest / Current Research\nGrounwater parameter estimation, Hydro climatological studies, Flood modeling, Numerical modelling, Optimization methods\nResearch, Consultancy, Publication\nThomas, A., Eldho, T. I., Rastogi, A. K. & Majumder P. (2019). A comparative study in aquifer parameter estimation using MFree point collocation method with evolutionary algorithms, Journal of Hydroinformatics https://doi.org/10.2166/hydro.2019.105\n• Thomas, A., Majumdar, P., Eldho, T. I., & Rastogi, A. K. (2018). Simulation optimization model for aquifer parameter estimation using coupled meshfree point collocation method and cat swarm optimization. Engineering Analysis with Boundary Elements, 91, 60-72. https://doi.org/10.1016/j.enganabound.2018.03.004\n• Thomas, A., Eldho, T. and Rastogi, A. (2016). Simulation of Seawater Intrusion in Coastal Conﬁned Aquifer Using a Point Collocation Method Based Meshfree Model. Journal of Water Resource and Protection, 8, 534-549. http://dx.doi.org/10.4236/jwarp.2016.84045\n• Thomas, A., Eldho, T. I., & Rastogi, A. K. (2014). A comparative study of point collocation based MeshFree and ﬁnite element methods for groundwater ﬂow simulation. ISH Journal of Hydraulic Engineering, 20(1), 65-74. https://doi.org/10.1080/09715010.2013.840120\nInternational Conferences Thomas, A. & Eldho, T. I., (2021). A review of evolutionary algorithms in inverse modeling for groundwater flow and transport parameter estimation. Hydro 2020, International Conference on hydraulics, water resources and coastal engineering. NIT Rourkela, 26 th to 28 th March 2021. [Best Presentation Award Winner]\n• Thomas, A. & Eldho, T. I., (2019). Aquifer parameter estimation using meshfree RPCM with evolutionary algorithms. EGU, Vienna, Austria, April 17-20.\n• Thomas, A., Eldho, T. I., & Rastogi, A. K. (2018). A review of recent heuristic optimizers in inverse groundwater modeling. ICWR, University of Kerala, Trivandrum, March 15-17.\n• Thomas, A., Saubhagya, R., & Eldho, T. I. (2015). Simulation of sea water intrusion in coastal conﬁned aquifers by using SEAWAT, Proceedings of Hydro -2015, IIT Roorkee, Dec 17-19.\n• Thomas, A., Eldho, T. I., & Rastogi, A. K. (2015). Simulation of sea water intrusion in coastal conﬁned aquifers by using a meshfree method, IAHR Conference, The Hauge, Netherlands, June 28- July 3.\n• Thomas, A., Eldho, T. I., & Rastogi, A. K. (2014). Meshfree based simulation of Seawater Intrusion. MTSWRM, IIT Hyderabad, Dec 26-30. [Best Paper Award Winner]\n• Thomas, A., Eldho, T. I., & Rastogi, A. K. (2013). Simulation of sea water intrusion in coastal conﬁned aquifers by using a meshfree method, Proceedings of Hydro -2013, IIT Madras, Dec 4-6.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\n–\nMembership in Professional bodies/ organizations\nIndian Society of Hydraulics (ISH), European Geosciences Union (EGU)\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\n• Won best presentation award in the Hydro International Conference, 2021 held at NIT, Rourkela, during 26th to 28th March 2021.\n• Early Career Scientist’s Travel Support (EGU), Vienna, Austria, April,2019\n• Won best paper award for ‘Meshfree based simulation of Seawater Intrusion’ in MTSWRM, conducted at IIT Hyderabad, Dec 26th-30th, 2014.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}