{
    "filename": "mbcet.ac.in_alumni_mbcetaa-contributions_.html",
    "content": "MBCETAA Contributions – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nAlumni\n>\nMBCETAA Contributions\nMBCETAA Contributions\nContributions of the MBCET Alumni Association (MBCETAA)\nThe\nMar Baselios College of Engineering and Technology Alumni Association (MBCETAA)\ncontinues to play a vital role in enriching the academic and cultural ecosystem of the institution. Driven by a spirit of gratitude and commitment to give back, MBCETAA has made substantial contributions during the academic year, reinforcing its support for student development, academic excellence, and institutional growth.\nKey contributions made by MBCETAA include:\nFlagship Sponsorship of Crossroads\nMBCETAA serves as the\nprincipal financial sponsor\nof the college’s\nprestigious techno-cultural fest, Crossroads\n, contributing\n₹1,00,000 annually\n. This support significantly enhances the scale and quality of the event, encouraging student innovation, leadership, and cultural expression.\nSupport for Department-Level Technical Fests\nTo promote technical excellence and student engagement across disciplines, MBCETAA provides\n₹1,00,000 annually (₹20,000 per department)\ntowards the organization of\ndepartment-level technical festivals\n, fostering experiential learning and inter-institutional collaboration.\nMBCETAA Outstanding Performer Award\nInstituted to recognize holistic student development, this prestigious award is conferred upon the\nBest Outgoing Student\nof the previous academic year. The selection is based on an integrated assessment of academic performance, co-curricular achievements, and extra-curricular involvement.\nMBCETAA Best Project Award\nTo encourage innovation and real-world problem-solving among final year students, the Alumni Association presents (during Exodos, graduation ceremony every year) the\nBest Project Award\nin each department. The award includes a\ncash prize of ₹10,000\nalong with\ncertificates for all group members\n, celebrating exemplary project work and technical creativity.\nSupport for International Conferences\nIn support of the college’s academic and research endeavours, MBCETAA contributed\n₹25,000\ntowards the\norganization of International Conferences\n, promoting global academic exchange and scholarly dissemination.\nSupport for Social Causes and Disaster Relief\nReflecting its strong commitment to social responsibility, MBCETAA has consistently responded to humanitarian needs by contributing to various\nrelief and rehabilitation efforts\n. The association has extended\nfinancial support for initiatives such as the Kerala Flood Relief Fund and Wayanad Relief Fund (Rs 1,00,000)\n, demonstrating solidarity with communities in distress and reinforcing the college’s ethos of compassion and civic engagement.\nThrough these initiatives, MBCETAA continues to bridge the gap between the past and present, fostering a legacy of excellence, mentorship, and institutional pride. Its contributions not only support student and faculty initiatives but also reflect the enduring bond between the alumni and their alma mater.\nFollow us on LinkedIn for all updates, alumni stories, and event highlights:\nhttps://www.linkedin.com/showcase/mbcet-alumni-association/\nStay connected. Stay inspired. #MBCETAlumni\nAbout us\nMBCETAA Contributions\nExecutive Committee\nMBCETAA-Middle East Chapter\nMBCETAA - North America Chapter\nDistinguished Alumni\nGet Involved\nMBCETAA Awards\nYouth Excellence Award\nStay in Touch\nContact Us"
}