{
    "filename": "mbcet.ac.in_home_professional-socities_ieee-activities_.html",
    "content": "IEEE Activities – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nProfessional Societies\n>\nIEEE Activities\nIEEE Activities\n1. IEEE Student Branch Counsellor Dr. Lani Rachel Mathew, ECE\n2. IEEE PES faculty advisor –Ms Sandhya P,. EEE\n3. IEEE RAS faculty advisor – Mr Shiras S.N,. ECE\n4. IEEE SPS faculty advisor –Mr. Anoop K. Johnson, ECE\n5. IEEE CS faculty advisor- Lino Zachariah, CSE\n6. IEEE EMBS faculty advisor –Dr. Lani Rachel Mathew, ECE\n7. IEEE WiE faculty advisor – Ann Mary Alex, ECE\nwebsite : https://www.ieeesbmbcet.in/\nReports\n2024-2025\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2023-2024\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2022-2023\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2021-2022\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2020-2021\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2019-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2018-2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\n2017-2018\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nPhoto Gallery\nPhoto Gallery\nActivities\nActivities\nIEEE EMBS Kerala Chapter Annual General Meeting\nMr Reuben Roy Vargis is the best Chairperson of SBCs.\nSpecial mention certificate is awarded to the best Design team member, Mr Shawn Siby George.\nMBCET bagged the Best Student Branch Chapter award 2023 during the Annual General Meet held on 27th April 2024 by the IEEE EMBS Kerala Chapter.\nThe Annual General Meeting of IEEE SB MBCET\nThe annual General Meeting of IEEE SB MBCET, held at the Senatus Hall on 21st February 2024, commenced with the welcome address by Sophy Maria Joy , Former Joint Secretary of IEEE . It was followed by the inaugural address by the Principal, Dr Abraham T Mathew. The members took the oath of the IEEE Code of Conduct, led by Mr Adlu Rahman, Vice-Chair. The annual report for the year 2023-24 was presented by the former Secretary,Ms  Sruthi N A, followed by the Financial Report for the year 2023-24 by Mr Adlu Rahman , former Treasurer. The passing out Execom were awarded their certificates by the Principal. Three of the former execom members were given Best volunteer awards for the year 2023-24. The new Execom members for the year 2024-25 were introduced by Dr. Lani Rachel Mathew, Senior IEEE Member and Branch Counsellor of the college. The AGM was addressed by Ms Savya Unnikrishnan, Chair. The annual plan for the year 2024-25 was presented by Ms  Blessy Smitha Das,Secretary. The vote of thanks was delivered by  Abhishek S S , Former RAS Chair.\nAs part of the Distinguished Lecturer Program of IEEE SPS Kerala Chapter, IEEE SPS SBC MBCET hosted a lecture by Dr. Tulay Adali, a globally renowned expert in Signal Processing, on 27\nth\nMarch 2025. She is a Distinguished Professor at the University of Maryland, Baltimore County, and Editor-in-Chief of IEEE Signal Processing Magazine. The topic of presentation was “Matrix and Tensor Factorizations for Neuroimaging Data Analysis and Fusion”. Faculty coordinators –\nMr. Anoop K Johnson\n, Faculty Advisor, IEEE SPS SBC and\nMs. Deepa P. L.\n, Asst. Professor (ECE). There were 56 participants, including students and faculty members, from various departments.Student coordinator – Mr. Govindraj R, S6 EC1, IEEE SPS SBC Student Chair\n.\nShrIEEEk 2024, the flagship event organized for first year students, was conducted on 9th November 2024 from 9:30 am to 3:30 pm at Olympia, MBCET. The participants were introduced to IEEE and its operations through this event. There were interactive and demo sessions by various Society chapters and a small ideathon along with different fun games. The event witnessed the active participation of 145 first year students from different branches of the college. The event was coordinated by Ms. Savya Unnikrishnan, S7 CED, Chair, IEEE SB MBCET along with Execom members. IEEE MBCET Student Branch Counsellor, Dr. Lani Rachel Mathew and professional society faculty advisors, Ms. Deepa PL (Signal Processing),  Ms. Lino Zachariah (Computer Society), and Mr. Shiras SN (Robotics and Automation Society) were present during the event.\nIEEE AGM 2025\nThe annual General Meeting of IEEE SB MBCET, held at the Senatus Hall on 28 February 2025, commenced with the welcome address by\nMr Muhammad Zulal\n. The members took the oath of the IEEE Code of Conduct, led by\nMr Chandrasekhar S. Nair\n, Vice-Chair.\nDr. S. Viswanatha Rao\n, Principal, MBCET, addressed the gathering. This was followed by the inaugural address by\nDr. M. J. Jayashree\n, Professor & Dean of Academic Affairs-UG, MBCET. The annual report for the year 2024-25 was presented by the former Secretary,\nMs. Blessy Smitha Das\n, followed by the Financial Report by\nMr. Abhishek S.\n, former Treasurer. The passing out Execom members were awarded their certificates by the Principal. Five of the former execom members (\nMs. Savya Unnikrishnan\n,\nMr. Devadathan J. Nair\n,\nMr. Sarang G. S.\n,\nMs. Anoushka L Nair\nand\nMs. Sandra S. R.\n) were given Best Volunteer Awards for the year 2024-25. The new Execom members for the year 2025-26 were introduced by\nDr. Lani Rachel Mathew\n, Asst. Professor (ECE) & IEEE SB Counsellor. The AGM was addressed by\nMs. Savya Unnikrishnan\n, former Chair and\nMr. Adlu Rahman\n, former Vice-Chair. Finally the vote of thanks was delivered by\nMr. Muhammad Zulal\n.\nBest Student Branch Chapter Faculty Advisor Award 2024\nof IEEE EMBS Kerala Chapter is awarded to\nDr Lani Rachel Mathew\nof MBCET during the AGM 2025 held on 29th March 2025.A certificate of appreciation is presented to\nDr M J Jayashree\n, Student Activities Chair (2024) in recognition of her outstanding dedication, leadership, and invaluable contributions as the Student Activities Chair of IEEE EMBS Kerala Chapter, fostering collaboration, and professional growth among students in Biomedical Engineering during the AGM held on 29th March 2025.She is continuing as Treasurer of IEEE EMBS Kerala Chapter and Chair of IEEE EMBS Women in Biomedical Engineering (WIBE), a Sub Organizational Unit of IEEE EMBS Kerala Chapter for the Year 2025.\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nRead More….\nISHARE\nASME\nIET\nIEEE Activities\nSAE MBCET\nComputer Society of India\nISTE\nACM\nInvited Talks\nCourses\nTechnical Events\nWorkshops\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}