{
    "filename": "mbcet.ac.in_faculty_ms-jomole-joseph-peedikayil_.html",
    "content": "Ms. Jomole Joseph Peedikayil – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs. Jomole Joseph Peedikayil\nEmployee Code / ID No.\n10309007\nQualifications\nM.Tech (Electrical Machines), PG Diploma in Educational Technology (ongoing)\nOrcid ID\n0000-0003-2488-0711\nIndustry / R & D Experience\nNil\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n133\nAreas of Interest / Current Research\nSustainable Engineering, Engineering Education, Illumination Technology\nResearch,  Consultancy, Publication\nCurrently guiding Industry project on Detection of Water content in Crude oil.\nCo‑investigator of In‑house funded research project on EV Battery Management Systems.\nMember of Consultancy team for electrification and system design of buildings of govt/pvt agencies outside the Campus from 2013 – 2015.\nPublications\n“Design of LVDT for Space Applications”, Paper presented in the National Seminar on “Recent Trends in Technological Advancements”, November 2004.\nPraveen Sebastian, Jomole Joseph, “PV Based Resonant Two Inductor Boost Converter for Induction Machine Drive Application”, International Journal of Engineering Trends and Technology (IJETT), V27(5), 254-260 September 2015.\nSheenu V S, Jomole Joseph, “A New Control Algorithm for Doubly Fed Induction Motor with Wide Torque-Speed Range for EV/HEV Application”, International Journal for Scientific Research & Development (IJSRD), Vol 4, Issue 4, e-journal, 1365-1368, June 2016.\nS S Visakh, Jomole Joseph. P, Archana A. N et al, Energy Carpet – Harvesting Using Piezoelectric Transducers, Journal of Controller and Converters, 2020.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nMember Secretary of Academic Council and College Council of MBCET\nCoordinator of EV Research Cell, Go Electric Campaign (EMC),\nIET MBCET Faculty Coordinator\nSEEM MBCET Faculty Coordinator\nDepartment Strategic Planning Coordinator\nDepartment Placement Coordinator\nDepartment NAAC Coordinator\nMembership in Professional bodies/ organizations\n1. MIET -Member of Institution of Engineering and Technology (IET)\n2. MISTE – Life Member of Indian Society of Technical Education (ISTE)\n3. Member of  Society of Energy Engineers and Managers (SEEM)\n4. Member of the Centre for Science and Environment – CSE’s Green Educator’s Network, Point of Contact in the “Forum for Green Campuses” for the College.\nCommunity Outreach Activities\n2019 – Till date: Proposed project plan about IET Outreach 150 which is an initiative to reach out to the communities and engage engineering community to help in bringing out sustainable solutions for a better living in these areas identified. The project proposal was one of the 4 selected from India, by IET UK.\nThe initiative is being driven with joint collaboration with the UBA Team, and partnerships with KILA and Vydyuthi Energy Services Ltd.\nAwards / Distinctions / Rank / Other Achievements if any\nPromotional Award 2016\nOutstanding Women Engineer Award 2017, Received Appreciation award from MBCET for the same\nOutstanding Volunteer Award 2018\nBest On Campus Faculty Advisor 2020\nProfessional Body Responsibilities\nActively involved in the professional activities of the global body of IET (Institution of Engineering and Technology) and its Local Network – Kanyakumari (KKLN)\nFaculty Advisor of the IET Student Chapter in Mar Baselios College of Engineering and Technology from 2012\nKKLN Joint Secretary 2017\nKKLN YP Vice Chairman 2018\nKKLN Joint Secretary 2019\nKKLN Vice Chair 2020\nKKLN Vice Chair 2021\nOrganized:\nRegional Round (South Asia) of the Global Presentation Competition IET PATW in 2019\nIET YP Congress (ASPIRE) of the Kanyakumari Local Network in 2018\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}