{
    "filename": "mbcet.ac.in_teaching-learning_.html",
    "content": "Teaching & Learning – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nTeaching & Learning\nTeaching & Learning\nTeachers use ICT enabled tools for effective teaching-learning process.\nThe College has been emphasizing ICT enabled tools for effective Teaching-Learning process. All the teachers were used to conducting lectures using LCDs and smart boards. But due to the pandemic situation, all the teachers had to quickly adapt to Online Teaching and Learning. The College conducted several training sessions on Online teaching using LMS like Google Classrooms, online assessment methods, recording software and other ICT tools. All the lecture recordings and contents were uploaded on the Subject Google Classrooms. Apart from these initiatives, the teachers also attended workshop on E-Content development using video making and editing software, Camtasia and other screen casting software were also conducted. All the teachers use Google Classroom for their respective subjects. To teach mathematical subjects in online mode, teachers have used various online tools like- whiteboard in Microsoft teams, Jamboard in Google meet, etc. This has made the teaching-learning process more effective and available at any point of the time for all the students.\nICT Tools:\nProjectors- Projectors are available in different classrooms/labs\nDesktop and Laptops- Arranged at Computer Lab and Faculty cabins all over the campus.\nPrinters- They are installed at Labs, HOD Cabins and all prominent places.\nPhotocopier machines – Multifunction printers are available at all prominent places in the institute.\nScanners- Multifunction printers are available at all prominent places.\nSeminar Rooms- Seminar halls are equipped with all digital facilities.\nSmart Board- 12 smart board is installed in the campus. 8. Auditorium- It is digitally equipped with mike, projector, cameras and computer system.\nOnline Classes through Zoom, Google Meet, Microsoft Team, Google Classroom)\nHackerRank (Online Coding Platform)- inter college competition\nMOOC Platform (NPTEL, Coursera, SAP, Udemy, Edx etc)\nDigital Library resources\nTurnitin (Plagiarism tool)\nUse of ICT by Faculty\nPowerPoint presentations- Faculties are encouraged to use power-point presentations in their teaching by using LCD’s and projectors. They are also equipped by digital library, online search engines and websites to prepare effective presentations.\nIndustry Connect- Seminar and Conference room are digitally equipped where guest lectures, expert talks and various competitions are regularly organized for students.\nOnline quiz- Faculties prepare online quiz for students after the completion of each unit with the help of GOOGLE FORMS.\nVideo Conferencing- Students are counseled with the help of Zoom / Google meet applications.\nVideo lecture- Recording of video lectures is made available to students for long term learning and future referencing.\nOnline competitions- Various technical events and management events such as Poster making, Project presentations, quiz, Debates, paper presentations etc. are being organized with the help of various Information Communication Tools.\nWorkshops- Teachers use various ICT tools for conducting workshops on latest method.\nThe Teaching and Learning Center (TLC) was formed to inspire, support and strengthen new directions in pedagogy and learning at MBCET.\nThe TLC facilitates:\nPreparation for Video lectures and courses through structured workshops\nSharing of good teaching practices among faculty members\nInnovation in teaching methods by partnering with faculty members\nFaculty development through online learning resources and peer learning\nTLC Coordinator\nMs. Shyju Susan Mathew, Asst. Professor, EED\nDr. Veena Nair, Asst. Professor, (English and Communication)\nCommittee Members\n:\nDr. Alice Thomas, Asst. Professor, CED\nMs. Gayathri K.S, Asst. Professor, CSD\nMr. Sherry Varghese George, Asst. Professor, ECD\nMs. Sheenu P, Asst. Professor, EED\nMr. Roshan George Koshy, Asst. Professor, MED\nDr.Lakshmi J S, Asst. Professor, Science and Humanities Department.\nDetails on Activities during 2024-2025\nTEACHING LEARNING CENTER,MBCET\nDATE\nWORKSHOP TITLE\nRESOURCE PERSON\nNo of Participants\n10-06-2025\nTeaching Gen Z\nMrs. Dainu Kuruvilla, Manager – Learning and Development at Tata Elxsi\n25\n09-04-2025\nOutcome Based Education\nDr. Nethu Roy, Research Dean, MBCET\n16\n03-01-2025\nCO-PO mapping awareness\nDr Vinod V,  Associate Professor, MED\nMr. Praveen G L, Assistant Professor, CSE\n60\n29-11-2024\nMicro Teaching, An Effective Lesson Plan, Evaluation\nOne-hour sessions on three topics related to Pedagogy: Micro Teaching, An Effective Lesson Plan, and Evaluation, was conducted.  The speakers gave their insights on the topics and interacted with the faculty members. The session focussed on optimum and effective content delivery through a proper lesson plan and conducting a holistic evaluation of the student.\nDr. Deepthi Elizabeth Mathew (Faculty, B.Ed)\nDr. Shiney Jacob (Faculty, B.Ed)\nMr. Nadhanine J P (Faculty, B.Ed)\nMar Theophilus Training College, Nalanchira.\n22\n08-11-2024\nOne-hour sessions on three topics related to Pedagogy: Methodology of Teaching, Classroom Management, and Psychology of Learners, was conducted. The speakers gave their insights on the topics and interacted with the faculty members. The sessions revolved around various effective teaching methodologies and classroom management based on understanding the psychology of the learners\nMr. Rakesh Sharma (Faculty, M.Ed)\nMrs. Roshna Mariam Eapen (Faculty, B.Ed)\nDr. Joju John (Principal)\nMar Theophilus Training College, Nalanchira.\n25\n10-07-2024\nEnvisioning MBCET as a learning organization\nThe Teaching Learning Centre of the College conducted a one-day workshop for Deans, HoDs, and senior faculty members of the college.\nTheme: Envisioning MBCET as a learning organization.\nDr. C.Thomas Abraham, Founder, Butterfly Foundation.\n35\nTEACHING LEARNING CENTER,MBCET\nDATE\nWORKSHOP TITLE\nRESOURCE PERSON\nNo Of Participants\nMarch 22, 2022, and April 12, 2022\nMicroteaching Workshop\nDr. K Y Benedict, Principal, Mar Theophilus  Training College, Dr. V. Raghu, Former Director, Rajiv Gandhi National Institute for Youth Development, Swami Gurunandh Jnanathapswi,\n30\nDecember 7, 2022\nOrientation Program\nProf. S. Viswanatha Rao\n33\nMarch 20,2021\nOnline Training Programme on Course Delivery Cycle\nDr. Edamana Prasad, Professor, Teaching Learning Centre, IIT Madras\n25\n08/10/2021\nTeaching GenZ\nDr. Brijesh Nair Professor and Director (International Affairs & Global Initiatives), O.P. Jindal Global University\n30\n12/11/2021 20/11/2021\nTraining Programme on Outcome Based Curriculum (Virtual mode\nProf. Joshua Ernest, Professor (Retdd), NITTTR Bhopal\n50\n9th November 2021\nOBE an overview\nProf. S. Viswanatha Rao\n30\n1 Nov 2021\nOrientation Program\nPrincipal and Vice principal\n30\n13/08/2021 (Friday)\nNew Normal New Life: Let Us Bounce Back\nMs Aparna Pavanajan\n24\nMarch 23 2021\nSeminar on New Challenges and Opportunities for Technical Education in the context of NEP 2020-Importance of Autonomy\nPadma Vibhushan Dr G Madhavan Nair, Former Chairman, ISRO\n60\n21\nst\nand 22\nnd\nJune 2019\nTwo day workshop on Integral Education for teachers\nMr. Arul Dev\n(Founder CEO of People first Consultants)\n34\n14\nth\n-25\nth\nJanuary 2019\nAdvanced Engineering Mathematics\nFaculty’s from S& H\n27\n23\nrd\nJuly 2018\nTeacher a Performing Artist\nDr. Premlet B\n(Prof. &Head(Rtd),\nDpt. of Physics, TKM, Kollam)\n41\n24\nth\nJuly 2018\nCreative Leadership in a Rapidly Changing Environment\nSri. Tom Thekkel\n30\n19\nth\nJanuary 2018\nFollow-up session on Teaching Learning\nProf. Edamana Prasad\n(IIT Madras)\n24\n23\nrd\nJuly 2018\nTalk on Building world class Institution\nDr M Ayyappan (\nChairman & Managing Director of HLL Life care Limited (HLL)(Rtd))\n86\n24\nth\nFebruary 2018\nWorkshop on Creative Learning: A Proactive approach to student centered Learning\nDr. Premlet B\n(Prof. &Head(Rtd), Department of Physics, TKM College of Engineering, Kollam)\n37\n21\nst\n-23\nrd\nApril 2017\nFDP on Teaching Learning Methodologies( TLC,IIT-Madras)\nProf. Edamana Prasad\nProf. Rajeev Sukumaran\n(IIT Madras)\n31\n11\nth\nJan-2017\nTalk on Introduction to Research\nProf Devadas\nMenon\n(IIT-Madras)\n28\n7\nth\n–December 2015\nOne day Training Program(Communication & Teacher Competency, Skill Implementation, Understanding Psychology of the Learner, Student Assessment)\nDr. S Maya,\nDr. Giby Gheevarghese,\nDr. Joju John\n(Assistant Professor in Mar Theophilus College, Nalanchira)\nDr. K Y Benedict\n(Associate Professor in Mar Theophilus College, Nalanchira)\n35\nWorkshop & Seminar\nISRO IIRS Outreach Programme\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}