{
    "filename": "mbcet.ac.in_about_.html",
    "content": "About Us – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAbout Us\nAs a proud part of the Mar Ivanios Vidyanagar on the blessed Bethany Hills, deriving the inner strength of truth and goodness from the visionary Patrons, MAR BASELIOS COLLEGE OF ENGINEERING AND TECHNOLOGY (MBCET) inspires the aspirations of generations of knowledge-seekers. Dedicated to mould morally upright, socially committed and intellectually trained Engineers, the College strives to realize its dreams.\nThe aesthetically designed buildings in nine blocks spread over the campus have a total built-up area of over 32000 sq. m. An eco-friendly infrastructure concept, causing least disturbance to the landscape has been executed. Rain water harvesting has been implemented right from the beginning of the College. Each block is connected by Pedestrian Bridge, retaining the separate entity of each branch of Engineering, Chaitanya – The Administrative block, Thejus – The Academic Block, Nalanda – The Library, Yantra – The Mechanical Engineering Block and Nirmithi – The Civil Engineering Block. Olympia, houses the Amenity Centre, Auditorium, Food Court, Indoor Courts, Gymnasium, Placement Rooms and so on.\nAutonomous status to MBCET:\nAPJ Abdul Kalam Technological University has notified the conferment of autonomous status to MBCET by UGC for a period of 10 years (2020-21 to 2029-30). Autonomy provides greater flexibility to the institution in improving the quality of education towards achieving academic excellence.\nAs an autonomous college, MBCET will have the freedom to\nDetermine and prescribe its own courses of study and syllabi, and restructure and redesign the courses to suit local needs\nOffer student-centric courses including a wide range of electives with freedom in choice of courses\nRegularly update the syllabus in accordance with the evolution of technology, trends in research and changing requirements of the industry\nEvolve methods of assessment of students’ performance that is well integrated and aligned with the teaching and learning process\nConduct of examinations and notification of results in a timely manner\nPromote healthy practices such as community service, extension activities and projects for the benefit of the society\nAutonomy provides the opportunity for enhancement in the quality of education and reflects the efforts of the institution for the achievement of excellence in academic performances and self governance. The degree will be awarded to the students by APJ Abdul Kalam Technological University, based on the evaluation and recommendation by the college.\nThe name of the college will be mentioned in the degree certificates.\nVision\nTo be an Institution moulding globally competent Professionals as epitomes of Noble Values.\nMission\nTo transform the Youth as technically competent, ethically sound and socially committed professionals, by providing a vibrant learning ambience, for the welfare of humanity.\nCore Values\nProfessional Excellence\nInnovation\nCommitment\nAccountability\nTolerance\nIntegrity\nSocial Responsibility\nManagement\nHis Beatitude Moran Mor Cyril Baselios Catholicos\nFounder (The late Major Archbishop of Trivandrum)\nHis Beatitude Moran Mor Cyril Baselios Catholicos, the first Major Archbishop of the Malankara Syrian Catholic Church established this Institution with a sublime objective namely, to provide quality technical education based on fundamental human values. To quote from the words of wisdom of the Late Major Archbishop His Beatitude Moran Mor Cyril Baselios Catholicos: “…. this Engineering College is meant to train and develop men and women of higher caliber equipped with the most modern scientific knowledge and technical skills destined not only to help our people in their march towards progress abut also to bring glory and honour to our people and our Country. True to its motto : “Duc In Altum “ Leading to the Heights of Excellence – the students of our College are to strive for excellence and skills and in pursuit of success in life, in terms of their commitment to bring happiness to our fellow beings and for the development of our Nation”.\nHis Beatitude Moran Mor Baselios Cardinal Cleemis Catholicos\nPatron (Major Archbishop of the Malankara Syrian Catholic Church)\nThe establishment and the astonishing progress of the College owe greatly to the vision and toil of His Beatitude Moran Mor Cyril Baselios Catholicos, the former Major Archbishop of Trivandrum. This College has been established with a sublime objective, namely to provide quality technical education based on fundamental human values. As the motto of the College ‘Duc In Altum’, very well depicts what we aim at is something more than the ordinary and the mediocre, without at the same time compromising on values. We wish to reach out to all sections of our society without the distinction of caste, creed, etc. In short, Mar Baselios College Of Engineering And Technology is envisaged to be a glowing example of the philosophy of education and the apostolate of human resource development which the Major Archdiocese of Trivandrum has been pursuing for the last Eight Decades. The Major Archdiocese has every reason to be proud of the quality and greatness of the service that this Institution is providing to the society and of its potential in radically transforming our society for a better tomorrow. We are sure, thousands of young men and women will come out of this Institution, fully equipped to contribute their valuable share in the great mission of Nation-building. My wish and prayer is that the College may live upto the great dreams of its Founders and be an agent of social transformation.\nRev. Fr. John Varghese Palanilkunnathil\nDirector\nRev.Fr. John Varghese Palanilkunnathil\nassumed charge as the New Director of our College on 19 March 2022. After securing Post Graduate Degree in Public Administration and Philosophy, B.Ed and M.Phil Degree, Fr. John has been serving in the field of Education as a Teacher and Administrator in various Institutions of the Major Archdiocese. He has travelled extensively in India and abroad on various missions\nRev. Dr. Koshy Issac Punnamoottil (Shyju)\nBursar\nRev. Dr. Koshy Issac Punnamoottil (Shyju)\nassumed office as the Bursar of the college on May 30, 2025, bringing with him extensive experience as the Procurator/Finance Officer of the Major Archdiocese of Trivandrum. He obtained a Master’s degree in Moral Theology from the Pontifical Holy Cross University, Rome, and a Doctorate in Theology from the Pontifical Lateran University, Rome. Prior to his current appointment, he served as Director of Mar Gregorios College of Law Trivandrum. With a long-standing commitment to education and service, he is also a member of various trusts and societies within the Major Archdiocese of Trivandrum.\nThe Management, through the Governing body, plays a vital role in the policy formulation of the College. The Management gives importance to the formation of morally and spiritually sound professionals with competency and self-confidence so that they can approach the reality of life with optimism. The Management provides all infrastructural facilities as per the requirements for the proper functioning of the Institution.\nGoverning Body\nGOVERNING BODY\n1.\nHis Beatitude Moran Mor Baselios Cardinal Cleemis Catholicos,\nMajor Archbishop of the Major Archdiocese of Trivandrum, President, Malankara Catholic Educational Society of the Archdiocese of Trivandrum, Patron and Manager, MBCET.\nChairman\n2.\nH.E. Most Rev. Dr. Mathews Mar Polycarpos,\nAuxiliary Bishop of the Major Archdiocese of Trivandrum.\nMember\nManagement Representative\n3.\nRev. Fr. Thomas Kayyalackal\n, Vicar General, Major Archdiocese of Thiruvananthapuram of Syro Malankara Catholic Church.\nMember\nManagement Representative\n4.\nRev. Fr. John Varghese Palanilkunnathil\n, Director, MBCET.\nMember\nManagement Representative\n5.\nFr. Thomas Mukalumpurathu\n, Finance Officer, MBCET.\nMember\nManagement Representative\n6.\nMr. Ajayan C.\n, Additional Secretary,\nMinistry of Higher Education, Government of Kerala.\nMember, Nominee of the State Government\n7.\nDr. Sumesh Divakaran\n, Professor,\nDepartment of Computer Science and Engineering, CET.\nMember,\nNominee of APJAKTU\n8.\nDr. Tony Thomas\n, Global Chief Digital and Information\nOfficer, Signify.\nMember Industry\n9.\nDr. Paul Thomas\n, Professor ECED & Dean (PG Studies and Research), MBCET.\nMember, Administration\n10.\nDr. M. J. Jayashree\n, Dean (Academics), Professor, ECED,\nMBCET.\nMember\n(Faculty Representative)\n11.\nTo be nominated\nMember\n(Faculty Representative\n12.\nDr. S. Viswanatha Rao\n, Principal, MBCET.\nMember Secretary\nACADEMIC COUNCIL\nACADEMIC COUNCIL\n1.\nDr. S. Viswanatha Rao,\nPrincipal, MBCET\nChairman\n2.\nDr. Ajil Kumar A.,\nCollege of Engineering, Karunagappally\nKTU Nominee\n3.\nDr. Libish T.M,\nAcademic Director\n,\nKTU\nKTU Nominee\n4.\nDr. Tara Raveendran,\nProfessor, CET\nKTU Nominee\n5.\nProf. B.R. Jayalekshmi\n, Professor, NITK Surathkal\nMember\n6.\nDr. Ansamma John\n, Professor, TKMCE\nMember\n7.\nDr. Prince A.,\nPrincipal and Professor\n,\nRIT Kottayam\nMember\n8.\nProf. Raju K. George\n, Professor, IST\nMember\n9.\nDr. Sandhyarani N.\n, Dean(R&C), NIT Calicut\nMember\n10.\nProf. A. Salih\n, Professor, IIST\nMember\n11.\nMr. Hiron Bose\n, Scientist, CDAC(T)\nMember\n12.\nMr. Anil Kumar C.S.\n, Formerly with Reliance Retail\nMember\n13.\nDr. Paul Thomas,\nDean (PG Studies & Research)\nMember\n14.\nDr. S. Ushakumari\n, Dean (Corporate Relations)\nMember\n15.\nDr. Neethu Roy\n, Dean (Research & Consultancy)\nMember\n16.\nDr. K. Muraleedharan Nair\n, Dean (Administration)\nMember\n17.\nDr. M. J. Jayashree\n, Dean (Academic UG)\nMember\n18.\nDr. Rajesh T. N.\n, Dean (Student Affairs)\nMember\n19.\nDr. Nisha G. K.,\nProfessor, EEED\nIQAC Coordinator\n20.\nDr. Pradeep M.\n, Associate Professor, MED\nController of Examinations\n21.\nDr. Jisha S. V.\n, HoD, CED\nMember\n22.\nDr. Jisha John\n, HoD, CSED\nMember\n23.\nDr. Luxy Mathews\n, HoD, ECED\nMember\n24.\nDr. Elizabeth Varghese\n, HoD, EEED\nMember\n25.\nDr. Remil George Thomas\n, HoD, MED\nMember\n26.\nDr. Archana P. Das\n, HoD, S&H\nMember\n27.\nDr. Tessy Mathew\n, Professor, CSE\nMember\n28.\nMs. Charivil Sojy Rajan\n, Assistant Dean (Alumni Affairs)\nMember\n29.\nDr. Shalu George K.\n, Associate Professor, EEED\nMember\n30.\nDr. Lani Rachel Mathew\n, Assistant Professor, ECED\nMember\n31.\nMr. Vinu V.,\nAssistant Professor, S&H\nMember\n32.\nDr. Deepak Raj\n, HoD, PE\nMember (Invitee)\n33.\nMr. Binu K. John\n, Librarian, MBCET\nMember (Invitee)\n34.\nDr. Arvind P.,\nAssistant Professor, MED\nMember Secretary\nAdvisory Body\nMr John Mathai, IAS(Retd), Former Chief Secretary, Govt of Kerala\nMr Jacob Punnoose, IPS(Retd), former DGP, Kerala\nMr John P Zacharia, Former Director, VSSC, Trivandrum\nDr S Unnikrishna Pillai, Former Principal, REC(NIT) Calicut\nDr Chem Nayar, Emeritus Professor, Curtin University, Australia\nDr Vijayan K Asari, Professor, University of Dayton, Ohio, USA\nDr Achuthsankar S Nair, Head, Dept Computational Biology & Bioinformatics,University of Kerala\nDr Saji Gopinath, Professor, IIM Kozhikode\nMr Alexander Varghese, Chief Administrative Officer, UST Global, Technopark,Trivandrum\nMr Jayan P Nair, Senior Vice President, IBS Software Services, Technopark,Trivandrum\nMr Rajesh Nair, CTO and Founder, Degree Controls Inc., USA\nMBCET Highlights\nStands among the top tier Engineering College in Kerala\nTraining and Placement Unit for Placement support and Soft Skill Training.\nDue importance to Arts & Sports. First runner-up in Kerala University Youth Festival competitions in 2017.\nMOU with National, International Institution/MNCs such as Infosys, HLL, IBS and UST Global for Technology transfer and Faculty/Student Training.\nFrequent National and International Conferences for dissemination of knowledge and ideas.\nDr. APJ Abdul Kalam Centre for Incubation, innovation & Entrepreneurship.\nPartners of VSSC for Testing Space Craft Electronic Packages\nDigital Library with OPAC.\nVibrant eco-friendly green Campus, with Rain water Harvesting facility.\n200 kW of Solar Power Plant – Grid Connected with Net Metering Facility.\nMany ISR Initiatives\nActive student branches of Professional Societies.\nEffective student advisory System.\nWinners of National & International Project Competitions.\nMulti-media/Smart Class Rooms & Seminar Halls\nA host of proficiency Awards, Merit Awards…\nCollege Council\nCOLLEGE EXECUTIVE COUNCIL\n1.\nDr. S. Viswanatha Rao\nPrincipal\n2.\nRev. Fr. John Varghese Palanilkunnathil\nDirector\n3.\nDr. Paul Thomas\nDean (PG Studies & Research)\n4.\nDr. Ushakumari S.\nDean (Corporate Relations)\n5.\nDr.  Neethu Roy\nDean (Research & Consultancy)\n6.\nDr. K. Muraleedharan Nair\nDean (Administration)\n7.\nDr. Jayashree M. J.\nDean (Academics Affairs-UG)\n8.\nDr. Rajesh T. N.\nDean (Student Affairs)\n9.\nDr. Nisha G. K.\nIQAC Co-ordinator\n10.\nDr. Pradeep M.\nController of Examinations\n11.\nDr. Jayakumari J.\nInternational Laison Officer\n12.\nDr. Jisha S. V.\nHoD – CED\n13.\nDr. Jisha John\nHoD – CSED\n14.\nDr. Luxy Mathews\nHoD – ECED\n15.\nDr. Elizabeth Varghese\nHoD,- EEED & Admission Chairperson\n16.\nDr. Remil George Thomas\nHoD – MED\n17.\nDr. Archana P. Das\nHoD – S&H & First Year Co-ordinator\n18.\nDr. Deepak Raj\nHoD – PE\n19.\nProf. Raju K. Gopal\nHead – ITMS\n20.\nMs. Charivil Sojy Rajan\nAsst Dean (Alumni Affairs)\n21.\nMs. Asha S.\nAssociate Professor, CSED\nKTU Exam Cell Co-ordinator\n22.\nDr. Arvind P.\nMember Secretary\nAssistant Professor, MED\nThe Mar Ivanios Campus\nMar Ivanios Vidya Nagar\nis one of the most beautiful hillocks in the city of Thiruvanathapuram. The sprawling 130 acre campus, blessed with natural beauty and learning ambiance, is studded with 18 centers of excellence in education.\nView All Institutions\nNewsletters\nManagement\nCollege Magazine\nCampus\nStrategic Plan 2017-22\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}