{
    "filename": "mbcet.ac.in_innovation-entrepreneurship_institutions-innovation-council-iic_.html",
    "content": "Institution’s Innovation Council (IIC) – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nInnovation & Entrepreneurship\n>\nInstitution’s Innovation Council (IIC)\nInstitution’s Innovation Council (IIC)\nAbout IIC MBCET\nMinistry of Human Resource Development (MHRD), Govt. of India has established ‘MHRD’s Innovation Cell (MIC)’ to systematically foster the culture of Innovation amongst all Higher Education Institutions (HEIs). The primary mandate of MIC is to encourage, inspire and nurture young students by supporting them to work with new ideas and transform them into prototypes.\nMajor focus\nTo create a vibrant local innovation ecosystem.\nStart-up supporting Mechanism in HEIs.\nPrepare institute for Atal Ranking of Institutions on Innovation Achievements Framework.\nEstablish Function Ecosystem for Scouting Ideas and Pre-incubation of Ideas.\nDevelop better Cognitive Ability for Technology Students\nVision\nTo become a Centre of Excellence in Innovation and Entrepreneurship.\nMission\nTo develop and encourage the spirit of innovation among students for handling socially relevant projects.\nTo spearhead the Institutional Innovation Rankings.\nTo kindle a Learner centered approach that focuses on entrepreneurial skill upgradation.\nTo enable an ecosystem that promote start-ups and entrepreneurial ventures of  students, faculty and staff\nMinistry of Human Resource Development (MHRD), Govt. of India has established “MHRD’s Innovation Cell (MIC)” to systematically foster the culture of Innovation amongst Higher Education Institutions (HEIs). MIC has envisioned encouraging creation of ‘Institution’s Innovation Council (IICs)’ across selected HEIs. Mar Baselios College of Engineering and Technology established Institutions’ Innovation Council under the aegis of MHRD’s Innovation Cell.\nIIC MBCET is actively involving in spreading the spirit of innovation and entrepreneurship in and out the campus by conducting various activities in domains like Innovation, Entrepreneurship and IPR, strictly adhering to the guidelines of MIC from the year 2018 and awarded with 4.5 star rating for the excellent performance in the academic year 2019-20 and 4 star (the highest rating) in the academic year 2020-21.  The college has an Intellectual Property Rights (IPR) Cell,  established with a view to promote innovation and research culture on the campus, and help to protect and respect intellectual property.\nMentor Mentee Program\nThe objective of Mentor-Mentee scheme for IIC institutions is to engage high performing IIC institutions specially those have secured star rating of 4 and above during the previous IIC calendar year to act as mentor to the IIC institutions those are need of guidance and support. This twining program will help IIC institutions to facilitate knowledge exchange and resource mobilization between institutions by offering inter-institutional collaborations. Scheme is designed to twinning one mentor IIC institute with up to 5 mentee IIC institutes.\nIIC MBCET is selected as a mentor institute and the mentee institutions allotted by MIC are listed below. IIC MBCET is organising orientation sessions, IIC Calendar activities and offering handold support and guidance to each mentee institutions in the areas of Entrepreneurship development, IPR, ARIIA ranking etc.\nViswajyothy College of Engineering and Technology, Muvattupuzha.\nRajadhani Institute of Engineering and Technology, Trivandrum.\nCarmel Polytechnic College, Alappuzha.\nMatha College of Technology, N.Paravur, Ernakulam.\nUniversal Engineering College,  Irinjalakuda, Thrissur.\nInnovation & Entrepreneurship Development Centre (IEDC)\nMaker Space\nµLearn and Skill Development Program(SDP)\nInstitution's Innovation Council (IIC)\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}