{
    "filename": "mbcet.ac.in_faculty_ms-shilpa-george_.html",
    "content": "Ms Shilpa George – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs Shilpa George\nEmployee Code / ID No.\n10317045\nQualifications\nM. Tech\nOrcid ID\n—-\nIndustry / R & D Experience\nNil\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n402\nAreas of Interest / Current Research\nPower Electronics, Drives, Electric Vehicles\nResearch,  Consultancy, Publication\nIn house R&D project – Design and implementation of Wireless Battery Management Systems for Electric Vehicles.\nShilpa George and Prof. Shajilal A. S. “Doubly fed Induction Generator Modeling Using Forward Euler Method,” International Journal of Scientific Research and Engineering Studies (IJSRES), vol. 3 Issue 8, pp. 26-28, August 2016.\nShilpa George and Prof. Shajilal A. S. “Comparative Study of Average Model of Diode Rectifier with the Model Developed by Modified Nodal Analysis Method,” The International Journal of Science And Technology (IJST), vol. 4, issue7, pp. 203-208, Jul 2016.\nShilpa George and Prof. Shajilal A. S. “Implementation of Average Model of Inverter Using Transient Simulation Techniques,” International Journal of Innovative Research and Advanced Studies (IJIRAS), vol. 3, issue 8, pp. 399-401, Jul 2016.\nShilpa George and Prof. Shajilal A. S. “Wind Turbine – Types and Modeling,” International Journal of Engineering Trends and Technology (IJETT), vol.38 no. 8, pp. 417-419 August 2016.\nShilpa George and Prof. Shajilal A. S. “State of Art of Doubly Fed Induction Generator in a Wind Energy Conversion System,” International Journal of Advanced Engineering, Management and Science (IJAEMS), vol. 2, issue 6, pp. 842-845, Jun 2016.\nVrinda A.R, Megha Nair, Akhil mohan, Aiswarya Ajay, Shilpa George, “IOT enabled Energy Management Meter,” International Research journal of Engineering and Technology, vol.7 issue 7, July 2020.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nStaff Advisor (S3 EE2 -2020-24 Batch)\nNBA Criteria Coordinator (Department level)\nMembership in Professional bodies/ organizations\n—-\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\nSecond Rank – M.Tech (Power Control and Drives- Kerala University)\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}