{
    "filename": "mbcet.ac.in_faculty-department_itms-head_.html",
    "content": "ITMS Head – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nEmployee Code / ID No.\n10212021\nQualifications\nB.Sc(Engg), M.Tech, MISTE, MIEEE, MCSI, MACM\nOrcid ID\n0000-0001-7680-3836\nIndustry / R & D Experience\n16 years (Industry), 12 years (R & D)\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n8089411498\nAreas of Interest / Current Research\nComputer Networks, Cyber Security, Computer Vision\nResearch,  Consultancy, Publication\nRaju K Gopal, Bhagya SL, A novel data storage solution for cloud, IEEE Xplore: October 2017.\nRaju K Gopal, Sherin Pter Multi-level authentication system for smart home-security analysis and implementation, IEEE Xplore: January 2017.\nRaju K Gopal, Sherin Peter, SECURE AUTHENTICATION SCHEMES IN IOT ENVIRONMENTS, Aug.2016\nMr. Raju K Gopal, Arunima S Kumar, “Data Mining Based Crime Investigation Systems:Taxonomy and Relevance”, Proceedings of 2015 Global Conference on Communication Technologies (GCCT), 2015.\nJinu Ann Tomy ,Neeta Elizabeth Philip ,Nisha Thankam Cherian , Priyatha R.P, Mr. Raju K  Gopal ,”Image Spam Detection Based on Feature Extraction and SVM classification” , MBCET Journal of Research, Vol. 4, Issue 2, Nov 2015.\nMr. Raju K Gopal and Anilekha Thampi, “A Review on Different Encryption Algorithms for a Wellness Tracking System”, IEEE Global Conference on Communication Technologies, 2015.\nMr. Raju K Gopal and Arunima S Kumar, “Data Mining Based Crime Investigation Systems: Taxonomy and Relevence”, IEEE Global Conference on Communication Technologies, 2015.\nNikitha Bhasu and Raju K Gopal, “Enhanced Security Solution to Prevent Online Password Guessing Attacks”, SSRG International Journal of Computer Science and Engineering (SSRG-IJCSE), Vol.1, Issue 6, August 2014.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\nMISTE, Sr. MIEEE, MCSI, MACM\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}