{
    "filename": "mbcet.ac.in_faculty-department_computer-science-engineering_.html",
    "content": "Computer Science & Engineering – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nExperience: 21yrs\nWORK EXPERIENCE\nKerala State Electronics Development Corporation (Keltron), Tvm\nDesignation        : Technical Apprentice\nDuration             : 1 yr(Dec 2001 – 2002 Dec)\nKerala State Electronics Development Corporation (Keltron), Tvm\nDesignation        : Computer Technician\nDuration             : 1 year 3 months  (April 2003 to June 2004)\nAuthentic Books, Kowdiar, Tvm\nDesignation        : System Programmer\nDuration             : 2 yr 2 months (July 2004 to Sep 2006)\nMar Baselios College of Engineering & Technology, Tvm\nDesignation        : Lab Instructor G I\nDuration             : Oct 2006 to till date\nIndustry: 4 yrs\nTeaching :15 yrs\nExperience: 16 yrs\nExperience: 15yrs\nWorking as Lab Instructor at  Mar Baselios College of Engineering and Technology from June 2006 to till date.\nEmployee Code / ID No.\nQualifications\nPhD\nOrcid ID\nhttps://orcid.org/0000-0002-9506-6381\nIndustry / R & D Experience\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9895493468\nAreas of Interest / Current Research\nImage Processing, Deep Learning\nResearch,  Consultancy, Publication\nInternational Journals\nJisha John, Madhu S. Nair, Anil Kumar P. R. and M. Wilscy, “A Novel Approach for Detection and Delineation of Cell Nuclei using Feature Similarity Index Measure”, Biocybernetics and Biomedical Engineering, Elsevier, Vol.36, No.1, pp.76-88 (SCI Indexed, Impact Factor- 4.314)\nJisha John, Madhu S. Nair, K. G. Gopchandran and M. Wilscy, “Uniformity Analysis in Nanocrystalline Silver Thin Films using Fuzzy Inference System”, Surface and Interface Analysis, Wiley, Vol.47, No.1, pp.161-165, January 2015 (SCI Indexed, Impact Factor- 1.607)\nJisha John, and M. Wilscy. “Enhancement of weather degraded color images and video sequences using wavelet fusion.” Advances in Electrical Engineering and Computational Science. Springer, Dordrecht, 2009. 99-109. (Book Chapters)\nJisha John, Aswathy Ravikumar & Bejoy Abraham, Prostate cancer prediction from multiple pretrained computer vision model. Health Technol. (2021).\nhttps://doi.org/10.1007/s12553-021-00586\nInternational Conferences\nRobin M., John J., Ravikumar A. (2021) Transfer Learning Techniques for Skin Cancer Classification. In: Smys S., Tavares J.M.R.S., Bestak R., Shi F. (eds) Computational Vision and Bio-Inspired Computing. Advances in Intelligent Systems and Computing.\nlen S. et al. (2021) Accident Alert System with False Alarm Switch. In: Pandian A., Fernando X., Islam S.M.S. (eds) Computer Networks, Big Data and IoT. Lecture Notes on Data Engineering and Communications Technologies, vol 66. Springer, Singapore\nRobin, Jisha John and A. Ravikumar, “Breast Tumor Segmentation using U-NET,” 2021 5th International Conference on Computing Methodologies and Communication (ICCMC), 2021, pp. 1164-1167, doi: 10.1109/ICCMC51019.2021.9418447.\nArun H.C, Dr. Jisha John, Ms. Aswathy Ravikumar published research paper entitled Arun H.C., John J., Ravikumar A. (2021) DRIVE SAFE: Lane Deviation Detection and Alert System Using Image Processing Techniques. In: Jeena Jacob I., Kolandapalayam Shanmugam S., Piramuthu S., Falkowski-Gilski P. (eds) Data Intelligence and Cognitive Informatics. Algorithms for Intelligent Systems. Springer, Singapore.\nNagesh A., Vijay A.S., Salim N.M., Vaisakh M.C., John J. (2020) Assistive Technology for the Blind. In: Jayakumari J., Karagiannidis G., Ma M., Hossain S. (eds) Advances in Communication Systems and Networks. Lecture Notes in Electrical Engineering, vol 656. Springer, Singapore\nVivek Jude, Nayana A, Reshma Pillai and Dr. Jisha John, “Personalized Educational Platform”, Fourth International Symposium on Intelligent Systems Technologies and Applications (ISTA’18), Springer Advances in Intelligent Systems and Computing Series\nAswathy Ashok, Dr. Jisha John, ” “Facial Expression Recognition System for Visually Impaired “, Springer International Conference on Intelligent Data Communication Technologies and Internet of Things (ICICI 2018) Lecture Notes in Data Engineering and Communication Technologies, ISSN: 2367-4512\nThomas, Rintu Maria, and Jisha John, “ A Review on cell detection and segmentation in Microscopic images”, 2017 International Conference on Circuit ,Power and Computing Technologies (ICCPCT)\nThomas, Rintu Maria, and Jisha John. “Detection and segmentation of mitotic cell nuclei in breast histopathology images.” Networks & Advances in Computational Technologies (NetACT), 2017 International Conference on. IEEE, 2017\nMenon, Sruthi, Anu George, Nehal Mathew, Vishnu Vivek, and Jisha John. “Smart workplace—Using iBeacon.” In Networks & Advances in Computational Technologies (NetACT), 2017 International Conference on, pp. 396-400. IEEE, 2017\nJisha John, Madhu S. Nair, K. G. Gopchandran and M. Wilscy, “Analyzing Surface Morphology of Thin Film Nanostructures using Feature Similarity Index Measure”, International Conference on Advances in Computing, Communications and Information Science – ACCIS 2014 (India), Elsevier, pp.104-112, June 2014\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nResearch Guide\nPoorna B.R    /R22CS01\n[email protected]\nTitle: Cell segmentation from Histopathological images using Deep learning Techniques\nAPJ  Abdul Kalam Technological University,Trivandrum(Ongoing)\nAcademic / Professional Outreach Activities\nExternal Doctoral Committee member for Research scholar Mrs. Hima Vijayan V P under the guidance of Dr. M. Abdul Rahman, Director, LBS Centre for Science & Technology, Thiruvananthapuram\nSubject Expert for the Conduct of Comprehensive Viva voce for Research scholar Ms.Jini Raju under the guidance of Dr. Usha Devi Amma, Professor, Dept of Electrical and Electronics Engineering, TKM, Kollam on 12.08.2020\nSubject Expert for the Conduct of Comprehensive Viva for Research scholar Ms.Anju S Mohan, under the guidance of Dr. Lizy Abraham, Dean (Research & Consultancy),  LBS Institute of Technology for Women, Poojappura, Trivandrum on 16.09.2020\nSubject Expert for the Conduct of Comprehensive Viva voce for Research scholar Ms. Suma under the guidance of Dr. P P Joby, Professor & Head, Department of Computer Science and Engineering, St. Joseph’s College of Engineering and Technology, Palai, Kottayam\nResource Person  (2021)\nHandled sessions on topics “GAN -Generative Adversarial Network“ organized by  Marian Engineering College during 26th  to 31st  July 2021 , 9th to 14th Aug 2021 and 23rd to 28th Aug 2021\nOrientation session “ A walkthrough on CSI” , at College of Engineering, Perumon on 22/06/2021\nDelivered sessions on 6 day online AICTE sponsored STTP on “High Performance Computing and Deep Learning for Image, Text Analysis” at MBCET during 22.02.2021 to 27.02.2021\nTEQIP Sponsored 6 day online FDP on “ Applications of Artificial Intelligence and IoT in Engineering” organized by Dept of Computer Science and Engineering, College of Engineering, Perumon, Kollam during 01.02.2021 to 06.02.2021\nReviewer (2021)\n31st ISTE Annual State Faculty Convention of the ISTE Kerala Section , 23.01.20212.\n2021 IEEE International Power and Renewable Energy Conference (IPRECON)\nJournal of Intelligent & Fuzzy Systems, Springer\nMembership in Professional bodies/ organizations\nComputer Society of India\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nEnterprise Design Thinking – Practitioner Badge\nEnterprise Design Thinking- Team essentials for AI\nEvaluator of “TOYCATHON 2021 “a Hackathon to crowdsource innovative ideas for the Toys and Games based on Bharatiya history, civilization, ethos, and culture. Toycathon 2021 is organized by the Innovation Cell, Ministry of Education with support of AICTE, Ministry of Education, Ministry of Women and Child Development, Ministry of Textiles, Ministry of MSME, Ministry of Commerce and Industry, Ministry of Information and Broadcasting.\nKTU Curriculum Committee Member(2019-20)\nKTU Syllabus Revision (2019 Scheme)\nCSI Core Committee member-Student Activity Council, CSI Trivandrum Chapter\nFunded project on Accident Alert System- under KSCSTE ( Kerala State Council for Science, Technology and Environment- 00907/SPS64/2019/KSCSTE\nEmployee Code / ID No.\n10206008\nQualifications\nPhD\nOrcid ID\nhttps://orcid.org/0000-0001-9835-3100\nIndustry / R & D Experience\n3.6 years\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n141\nAreas of Interest / Current Research\nArtificial Intelligence,DataScience ,Machine Learning,Cellular Automata\nResearch,  Consultancy, Publication\nResearch Publication\nJournals\nReplication in Two-Dimensional Cellular Automaton with Linear Rules.\nUS Rao, L Jeganathan, T Mathew, Journal of Cellular Automata ,2020\nU. Srinivasa Rao L. Jeganathan ,Tessy Mathew,   has published a paper titled “Error Bounds for Darboux Integral of Continuous Functions with Supremum Norm Using Cellular Automaton” in International Journal of Control Theory and Applications ISSN : 0974-5572, Volume 9, 2017\nTessy Mathew, L.Jeganathan, Srinivasa Rao ,Cellular Automata model for new investors for safe investment based on expert recommendation”, International Journal of Economics and Business Research-2017\nTessy Mathew, L.Jeganathan, Srinivasa Rao, Cellular Automata for decision making in stock trading- Journal of Computational Econometrics -2015\nConferences\nDetection and Recognition of License Plate Using CNN and LSTM\nA Anson, T Mathew Advances in Communication Systems and Networks, 701-721,2020\nJayalekshmi and Tessy Mathew has published a paper  ” Multimodal Sentimental Analysis-A study on classification Techniques for Multimodal Sentimental Analysis” in International Journal of Innovative Research in Computer and Communication Engineering (IJIRCCE) Vol. 4, Issue 9, September 2016.\nAn efficient image categorization approach using deep belief network\nS Skaria, T Mathew, C Anjali International Conference on Networks & Advances in Computational Technologies,MBCET 2017\nMs. Tessy Mathew and Bini B S, “Study of Clustering Approach for Stock Market Prediction”,  National Conference on Innovation in Communication and Network ICONET’15, March 31 2015\nBini B S, Ms. Tessy Mathew, “Clustering and Regression Techniques For Stock Prediction”, ICETEST 2015\nKoshy George, Ms. Tessy Mathew, “Big Database Stores – A review on various big data datastores”, ICGCIoT 2015\nAnjana Ramesh, Binu G Nair, Poornima V and Ms. Tessy Mathew, “Predictive Analytics of Breast Cancer”, MBCET Journal of Research, Vol. 4, Issue 2, Nov 2015\nMs. Tessy Mathew,Mr.L.Jeganathan and Ms.Elizebeth Sherly “NSE Stock Index prediction using NARX and SVM Techniques”, International Conference on Advances in Computing, Communication and Information Science, 2014\nMs. Tessy Mathew,Mr.L.Jeganathan ,Vijaya ,Kalyani DesikanAn Ensembled Neural Network Classifier for Vehicle Classification using ILD, Published in Communications in Computer a Information Science series(CCIS) volume 0270\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nKTU Research Guide\nAcademic / Professional Outreach Activities\nDelivered sessions on 6 day online AICTE sponsored STTP on topics “Advanced RNN for video Analysis“ organized by  Marian Engineering College during 26th  to 31st  July 2021 , 9th to 14th Aug 2021 and 23rd to 28th Aug 2021\nDelivered an expert lecture on the topic “Artificial Intelligence and Influence of Mathematics” in the webinar on Recent Recent trends in applied Mathematics conducted by dept of Mathematics, KumbalathuSankupillai Memorial Ddewaswom Board College Sasthamkotta May 2021\nDelivered sessions on AICTE sponsored STTP on “Recent Advances and research domains in machine learning” organised by Department of CSE,LBS Institute of Technology for Women during 02.01.2021\nDelivered sessions on 6 day online AICTE sponsored STTP on “High Performance Computing and Deep Learning for Image, Text Analysis” at MBCET during 22.02.2021 to 27.02.2021\nDelivered sessions on IET sponsored Faculty Development Program on Performance Improvement in Smart Grid using Artificial Intelligence Techniques at MBCET during Nov 2020\nMembership in Professional bodies/ organizations\nComputer Society of India\nCommunity Outreach Activities\n—\nAwards / Distinctions / Rank / Other Achievements if any\nKTU Syllabus Revision Member(KTU 2019 Scheme)\nCoordinator-AICTE Sponsored High Performance Computing and Deep Learning for Image, Text Analysis” at MBCET ,2021\nJudge CSI INAPP  Project 2021\nDoctoral Committee member (KTU)Colloborative project with SCTIMSTFunded Projects guidedAutomated Detecteion of Liver Cancer using deeplearning -Kerala State Council for Science, Technology and Environment Project\nIdentifying tesing idiolects using transformers- CERD fundedProject\nIndoor navigation aid for the visually challenged -Center for Disability Studies-CEDS\nTravelling aid for Visually challenged people -Center for Disability Studies-CEDS\nWeather Prediction using Deep neural Network -Sponsoring agency-MBCET\nProstate Segmentation of MRI using CNN -Sponsoring agency-MBCET\nExperience: 6 yrs\nJoined MBCET on Third August 2016\nEmployee Code / ID No.\n10504002\nQualifications\nM.Tech\nOrcid ID\n—-\nIndustry / R & D Experience\nnil\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9447741066/ 801\nAreas of Interest / Current Research\nComputer Networks, Ad-hoc Networks, Mobile communication, Computer Organization, Wireless Networks\nResearch,  Consultancy, Publication\nPublications\nUGC Sponsored national conference on recent trends in Computational Mathematics- March 18, 19, 2004 at Gandhigram Rural Institute by Asha S., Ramola Joy, on “Texture Analysis using GLCM and Wavelet Transform”\nNational Conference on recent trends in Communication Techniques – NATCON’04, April 7, 8, 2004 by Asha S., Ramola Joy, on “Still Image Compression using fuzzy logic based predictive coding.”\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\nISTE LIFE MEMBERSHIP\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\nISTE KERALA SECTION- FACULTY ADVISOR, SPECIAL APPRECIATION AWARD 2022-23, ENGINEERING COLLEGE STREAM\nEmployee Code / ID No.\n10212021\nQualifications\nB.Sc(Engg), M.Tech, MISTE, MIEEE, MCSI, MACM\nOrcid ID\n0000-0001-7680-3836\nIndustry / R & D Experience\n16 years (Industry), 12 years (R & D)\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n8089411498\nAreas of Interest / Current Research\nComputer Networks, Cyber Security, Computer Vision\nResearch,  Consultancy, Publication\nRaju K Gopal, Bhagya SL, A novel data storage solution for cloud, IEEE Xplore: October 2017.\nRaju K Gopal, Sherin Pter Multi-level authentication system for smart home-security analysis and implementation, IEEE Xplore: January 2017.\nRaju K Gopal, Sherin Peter, SECURE AUTHENTICATION SCHEMES IN IOT ENVIRONMENTS, Aug.2016\nMr. Raju K Gopal, Arunima S Kumar, “Data Mining Based Crime Investigation Systems:Taxonomy and Relevance”, Proceedings of 2015 Global Conference on Communication Technologies (GCCT), 2015.\nJinu Ann Tomy ,Neeta Elizabeth Philip ,Nisha Thankam Cherian , Priyatha R.P, Mr. Raju K  Gopal ,”Image Spam Detection Based on Feature Extraction and SVM classification” , MBCET Journal of Research, Vol. 4, Issue 2, Nov 2015.\nMr. Raju K Gopal and Anilekha Thampi, “A Review on Different Encryption Algorithms for a Wellness Tracking System”, IEEE Global Conference on Communication Technologies, 2015.\nMr. Raju K Gopal and Arunima S Kumar, “Data Mining Based Crime Investigation Systems: Taxonomy and Relevence”, IEEE Global Conference on Communication Technologies, 2015.\nNikitha Bhasu and Raju K Gopal, “Enhanced Security Solution to Prevent Online Password Guessing Attacks”, SSRG International Journal of Computer Science and Engineering (SSRG-IJCSE), Vol.1, Issue 6, August 2014.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\nMISTE, Sr. MIEEE, MCSI, MACM\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nEmployee Code / ID No.\n10205004\nQualifications\nM TECH\nOrcid ID\nhttps://orcid.org/0000-0003-2952-9138\nIndustry / R & D Experience\n—-\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9447269775/104\nAreas of Interest / Current Research\nTheoretical Computer Science\nResearch,  Consultancy, Publication\n—-\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nYotube Channel with video lectures on selected topics in Data Structures, Theory of Computation, Design and Analysis of Algorithms, Compiler Design and Computer Graphics\nMembership in Professional bodies/ organizations\nComputer Society of India\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\nQualified UGC NET 2018\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}