{
    "filename": "mbcet.ac.in_iqac_compliance-of-ugc-guidelines-regulations-2018-for-autonomous-colleges_.html",
    "content": "Compliance of UGC Guidelines / Regulations 2018 for Autonomous Colleges – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nIQAC\n>\nCompliance of UGC Guidelines / Regulations 2018 for Autonomous Colleges\nCompliance of UGC Guidelines / Regulations 2018 for Autonomous Colleges\nDetails of the constitution of following statutory bodies, as per the Regulations/Guidelines. Governing Body, Academic Council, Board of Studies, Finance Committee.\nGoverning Body\nAcademic Council\nBoS\nFinance Committee\nDetails of the constitution of following non-statutory committees, as prescribed in the Regulations/Guidelines.\nPlanning and Evaluation Committee, Grievance Redressal Committee, Examination Committee, Admission Committee, Library Committee, Student Welfare Committee, Anti-Sexual Harassment Committee, Extra-Curricular Activities Committee, Academic Audit Committee.\nStrategic Planning Committee\nGrievance Redressel\nExamination Committee\nAdmission Committee\nLibrary Committee\nInternal Complaint Committee\nExtra-Curricular Activities Committee\nAcademic Audit Committee\nDetails of establishment of IQAC Cell, External Peer Team comprising of academicians of repute, Report of the External Peer Team review, uploaded on the website of the College.\nEstablishment of IQAC\nExternal Peer Team\nReports of External Peer Team review uploaded on website\nScreen shots of the information uploaded on college website regarding the courses offered, the fees for the courses, the details of the faculty along with qualification and unique ID, the admission procedure, the details of relevant infrastructures, research activities of the college along with the details of Ph.D. students enrolled, if any, with the date of enrolment, topics and supervisor.\nCourses Offered\nFee Structure\nDetails of Faculty with Qualification, Unique ID\nAdmission Procedure\nDetails of Infrastructure\nResearch Activities of the College\nDetails of PhD Students enrolled with date of Enrollment, Topics and Supervisor\nWhether the college has been conducting meetings of the statutory bodies regularly and uploading the minutes of the meetings on the college website. Copies of the minute(s) of meeting(s) may be provided.\nMinutes of Meeting\nScreen shot of the Undertaking uploaded on college website to the effect that all the Regulations notified by the UGC shall be followed in letter and spirit.\nUndertaking\nCompliance of UGC Guidelines / Regulations 2018 for Autonomous Colleges"
}