{
    "filename": "mbcet.ac.in_faculty_ms-smrithi-cheriyath_.html",
    "content": "Ms. Smrithi Cheriyath – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nCivil Engineering\n>\nMs. Smrithi Cheriyath\nEmployee Code / ID No.\n10116070\nQualifications\nM.Tech Structural Engineering\nOrcid ID\nhttps://orcid.org/0000-0002-3503-1806\nIndustry / R & D Experience\n1 year Industry Experience, 7 years Teaching Experience\nEmail ID\n[email protected]\nAlternate E-mail ID\n–\nMobile No (Optional) / Intercom Extension No.\n220(intercom)\nAreas of Interest / Current Research\nStructural Dynamics, Smart material in construction, Composite Materials\nResearch, Consultancy, Publication\n1. SmrithiCheriyath, Rakhimol S, “Seismic Response Control of Irregular Shaped RCC Buildings by Using Nonlinear Viscous Dampers”, Proceedings of International Conference on Emerging Trends in Civil Engineering and Architecture, 11th March 2018.                                                                                                                              2. Smrithi Cheriyath, Rakhimol S, “Effect of Torsion on Asymmetric RCC Buildings by Using NonLinear Viscous Dampers”, Proceedings of International Conference on Frontiers Engineering, Applied Science and Technology (NIT) Trichy, 27-28th April 2018. ISBN 978-81- 908388-6-3. 3. Smrithi Cheriyath and Rakhimol S, “Seismic Response Control of L, T Shaped RCC Buildings by Using Nonlinear Viscous Dampers”, International Journal of Engineering Research and Technology (IJERT), ISSN No :2278-0181, Vol.6, Issue.6, March 2018.\n4. Smrithi Cheriyath and Bindu Biju, “Study on Natural Fiber Reinforced Concrete”, National Conference on recent engineering advances and trends, 15th – 17th January, pp 47 – 52, 2014.\n5. Smrithi Cheriyath, Bindu Biju and A.G Balamurali, “Response reduction of high rise building during wind induced vibration using tuned mass damper”, National Conference on Emerging Technologies, 1st and 2nd August, pp 5 -9, 2014.\n6. Smrithi Cheriyath and Bindu Biju, “Control of structural response of high rise building using tuned mass damper”, National Conference on System Energy and Environment, 1st – 2nd August, pp 89 – 92, 2014.\n7. Smrithi Cheriyath and Bindu Biju, “Study on effect of tuned mass damper in high rise building”, National Conference on Technological Trends, 22nd – 23rd August 2014.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\n–\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nWon Best paper award under Structural Engineering stream in National Conference on Emerging Technology held at Government Engineering College, Barton Hill, Trivandrum, August 2014\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}