{
    "filename": "mbcet.ac.in_alumni_about-us_.html",
    "content": "About us – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nAlumni\n>\nAbout us\nAbout us\nMBCET Alumni Association – A Legacy That Transcends Borders\nAt\nMar Baselios College of Engineering and Technology (MBCET)\n, education is more than academic excellence—it’s about building lifelong bonds, nurturing dreams, and empowering leaders. The\nMBCET Alumni Association\nstands as a vibrant testament to this legacy, uniting thousands of graduates from every corner of the globe into a single, powerful community.\nWhether you once walked through the lush green pathways of Nalanchira or sat in those iconic lecture halls that sparked your ambition, you’re part of something bigger. MBCET alumni are not just engineers—they’re\nvisionaries, entrepreneurs, researchers, educators, and global citizens\nwho are making a mark in the world.\nA Global Network Like No Other\nWith a proud presence in over\n30 countries\n, the MBCET Alumni Association is more than a network—it’s a\nglobal movement\nof shared purpose and lifelong connection. Our 37 regional and professional subgroups are buzzing with collaboration, mentorship, and camaraderie.\nOur alumni community thrives across:\nThe innovation capitals of\nNorth America\nThe cultural hubs of\nEurope\nlike the\nUK, Germany, France, Italy, Switzerland, and the Netherlands\nThe fast-growing tech corridors of\nAsia\n, including\nSingapore, Japan, South Korea\n, and\nIndia\nThe economic powerhouses of the\nMiddle East\n, such as\nQatar, UAE, Oman, Kuwait, Saudi Arabia, and Bahrain\nAnd dynamic destinations like\nAustralia, New Zealand, Canada\n, and\nIreland\nFrom\nboardrooms in Toronto\nto\nlabs in Tokyo\n, from\nstartups in Bangalore\nto\nclassrooms in Stockholm\n, our alumni carry the MBCET spirit with pride and purpose.\nWhat We Do\nThe MBCET Alumni Association:\nConnects\ngraduates across batches, branches, and geographies\nSupports\ncareer development through job referrals, mentoring, and networking\nCelebrates\nthe success stories of alumni around the world\nCollaborates\nwith the institution to guide and inspire current students\nContributes\nto community and campus development initiatives\nOur events, webinars, regional meetups, professional panels, and outreach programs are designed to keep the bond alive—because at MBCET, the journey doesn’t end with graduation.\nBe Part of Our Digital Community\nTo keep our ever-growing alumni family connected, we’ve built a\ndedicated WhatsApp Community Platform\n—a space where ideas, opportunities, memories, and milestones are shared every day.\n37 Active Subgroups\n2000+ Members and Counting\nSeamless interaction across industries, geographies, and generations\nThis community isn’t just about staying in touch—it’s about\ngrowing together\n,\nlifting each other up\n, and\ngiving back\nto the college that brought us together.\nYou Belong Here\nWhether you’re a recent graduate or part of the founding batch,\nyour story matters\n, and your presence makes us stronger. The world may have taken us far, but our roots run deep—and together, we can shape a future that reflects the MBCET spirit of excellence, integrity, and unity.\nJoin the MBCET Alumni WhatsApp Community\nTap into a global network of support, success, and shared memories.\nor contact Ms. C. Sojy Rajan, Assistant Dean (Alumni Affairs)-+918547430517\nFollow us on LinkedIn for all updates, alumni stories, and event highlights:\nhttps://www.linkedin.com/showcase/mbcet-alumni-association/\nStay connected. Stay inspired. #MBCETAlumni\nOnce an MBCETian, always an MBCETian. Let’s stay connected. Let’s make a difference. Together.\nAbout us\nMBCETAA Contributions\nExecutive Committee\nMBCETAA-Middle East Chapter\nMBCETAA - North America Chapter\nDistinguished Alumni\nGet Involved\nMBCETAA Awards\nYouth Excellence Award\nStay in Touch\nContact Us"
}