{
    "filename": "mbcet.ac.in_2019_11_21_27th-national-childrens-science-congress-27-31-december-2019_.html",
    "content": "LOGO RELEASE OF THE 27th NATIONAL CHILDREN’S SCIENCE CONGRESS – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\n27\nth\nNATIONAL CHILDREN’S SCIENCE CONGRESS\n27 – 31 December 2019\nNational Children’s Science Congress is a ﬂagship programme of National Council for Science and Technology Communication (NCSTC), Department of Science & Technology (DST), Government of India. It is an inclusive programme open to children of the age group from 10-17 years covering all background either school going or out of school system, belonging to geographic, language and cultural regimes across the country and open to all children including children with disabilities. The prestigious national academic event is held every year during 27th to 31st December. It is a platform for children to carry out small research activities at micro-level. The NCSC encourages a sense of discovery and/or innovativeness in addition to learning application of methods of science. It emboldens the children to question many aspects of progress and development around and can also express their ﬁndings in their own choice of language. It encourages the children to think critically and rationally to draw logical conclusions.\n27th National Children’s Science Congress is hosted by Kerala State Council for Science, Technology and Environment (KSCSTE), Government of Kerala during 27th to 31st December 2019 at Mar Ivanios Vidya Nagar, Nalanchira, Thiruvananthapuram, the state capital of Kerala in association with Mar Ivanios College and Mar Baselios College of Engineering and Technology. The focal theme for 27th National Children’s Science Congress is “Science, Technology and Innovation for a Clean, Green and Healthy Nation”.\nThe logo release of the 27th National Children’s Science Congress was held at the Cliff House on 21 November 2019, by Sri. Pinarayi Vijayan, Hon’ble Chief Minister of Kerala.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}