{
    "filename": "mbcet.ac.in_research_mous_.html",
    "content": "MoUs – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nResearch & Consultancy\n>\nMoUs\nMoUs\nMBCET signed MoU with L&T Edutech\nL&T EduTech signed an agreement on 27 July, 2022 with Mar Baselios College of Engineering & Technology (MBCET), Trivandrum. MBCET, one of the three autonomous colleges in Kerala, is the first college in the state to partner with L&T EduTech.\nBy partnering with a reputed institution belonging to Mar Ivanios Group that was established in 1946, L&T EduTech starts its mission and outreach in Kerala.\nAfter the signing, M F Febin, Head College Connect Business, L&T EduTech; Abhay Sankar, Lead Public Relations, L&T EduTech; Dr K T Abraham, Principal, MBCET; Dr S Viswanatha Rao, Vice Principal; Rev Fr John Varghese Palanilkunnathil, Bursar and heads of department from all disciplines discussed and deliberated strategies to widen the scope of EduTech’s vision in the state by bringing in more opportunities for engineering students and graduates.\nMBCET signed MoU with Builders Association of India (BAI), Kerala (Trivandrum) Centre\nAn MoU  is made on 9 th\nMarch\n2018 between\nDepartment\nof\nCivil\nEngineering,\nMar Baselios College\nof\nEngineering and Technology\nand\nBuilders Association of India, Kerala (Trivandrum) Centre\n.\nDepartment\nof\nCivil Engineering,\nand\nBAI\nhave agreed to carry out the Collaborative Partnership Programme jointly for growth of mutually beneficial research, educational and outreach programmes in conformity with appropriate administrative, financial and educational practices, and implement all such plans, activities and reforms as required for the\nProgramme\n.  BAI is willing to give training for selected students after their course, with /without remuneration. But the students should be willing to work in different areas such as design, estimation, quality control and site supervision at various locations spread around the district/state/country. CE invited BAI to conduct a campus placement drive by a group of companies coming under BAI.\nMoU between EMC and MBCET\nAn MoU has been signed between EMC and MBCET on\n6 January 2023\nfor promoting the industry-academic interaction activities and to help achieve academic excellence of the Department of Electrical and Electronics Engineering, and to conduct joint/collaborative research and consultancy in the areas of Electric Vehicles and E-Mobility and promote Energy Conservation and Environmental Protection through such activities.\nMoU between SPACELABS and MBCET\nAn MoU has been signed between SPACELABS and MBCET on\n5 July 2022\n. The Spacelabs is a software firm established in Kerala and engaged in offering software products and services with operations in India and represented by its duly authorized representative, Ms. Sheela D S , CEO. purpose of this MoU is to use the expertise of the faculty of the MBCET and engage a dedicated qualified person for the research-oriented activities.\nMoU between CDAC (T) and MBCET\nAn MoU has been signed between CDAC (T) and MBCET on\n27 May 2022\n. The purpose of this MoU is to formally express the mutual wish of MBCET and C-DAC (T) to associate in the studies and research in the subject areas of Cyber Security and Forensics, Cyber Law, Software Technologies, Cloud Computing, GIS Technology, 5G Networks, Power Electronics, Energy Systems, Control Systems and Instrumentation, VEGA Processor and in the efforts of Collaborative Teaching, Research and Development. This is a legally non-binding agreement, which outlines an intention to promote collaboration between the two parties for a socially productive cause. This document would be followed by an Agreement, in future, specifying the areas of collaboration and sharing, which will have the legal binding.\nRenewed the\nMoU\nwith BSNL RTTC, Trivandrum – 19 May 2022\nRenewed the\nMoU\nwith National Institute\nof\nSpeech and Hearing – 09 March 2022\nMaven Silicon, Bengaluru (VLSI training institute) -07 April 2022\nMoU signing of MBCET with Tata Elxsi Ltd.\nAn MoU has been signed between Tata Elxsi Ltd. and MBCET on\n25 February 2022\n. Mr. Shaju S, Vice President and Head, Transportation Business Unit (TBU), Mr. Ishwar Hegde, Head, Talent Acquisition (Head Office, Bengaluru), Mr. Jacob John, Competency Head, TBU, Mr. Vishnu Suresh, Manager, Employee Connect (HR) and Mr. Prabahara Balan, Senior Specialist, TBU were the officials from Tata Elxsi who were present at the MoU signing ceremony. On the part of the College, Fr. John Vilayil, Bursar, Dr. Abraham T. Mathew, Principal and Dr. S. Viswanatha Rao, Vice Principal were present. Dr. Nisha g. K., HoD, EED welcomed the gathering. Deans, HoDs, Faculty and the students witnessed the ceremony. Coordinators: Ms. Lani Rachel Mathew, Assistant Professor, ECED and Ms. Shyju Susan Mathew, Assistant Professor, EED.\nInfosys Campus Connect -17 December\n2021\nMaven Silicon, Bengaluru (VLSI training institute)\nMOU WITH ACSIA TECHNOLOGIES\nA MoU is entered into between Mar Baselios College of Engineering and Technology (MBCET), an Autonomous Engineering College and Acsia Technologies, Technopark Trivandrum on 16\nth\nDecember 2021. The association was initiated and facilitated by the Corporate Relations Division-MBCET.\nAcsia Technologies Pvt Ltd is an internationally reputed firm, based out of Trivandrum which is a leader in the automotive sector that provides cutting edge services to the top-of-the-line clients across the world. The company develops software solutions for major automotive car makers. It offers innovative technologies in the automotive space and they arethe pioneers in In-Vehicle infotainment and Heads up display development for automotive brands like Mercedes Benz, Ford, Porsche etc\nMOU WITH VINVISH TECHNOLOGIES\nAn MoU was signed between Vinvish Technologies, Pvt. Ltd., Technopark and Mar Baselios College of Engineering and Technology (Autonomous) on 30\nth\nSeptember 2021. The company is a DSIR (Govt. of India) approved R&D centre with a solid R&D foundation in niche areas of Optoelectronics. NASA, Space X, ISRO, RCC, Amritha Hospital, Facebook and others are some of their most important clients. They have a full-fledged design and engineering team with expertise in optics, electronics, embedded firmware, and mechanical in place, and ready to go from concept to product development. The agreement will establish a linkage between the institute and the industry to effectively share the services and expertise for collaborative research and advanced learning.\nRENEWAL OF  MoU BETWEEN MBCET AND  ICT ACADEMY\nMar Baselios College of Engineering and Technology renewed Academic Premium Membership with ICT Academy. Membership duration will be 1st August 2021 to 31st July 2022.\nMoU SIGNING  AND  LAUNCHING OF  ACCUBITS  FELLOWSHIP  PROGRAM  (AFP)\nMoU signing, Launching of\nAccubits Fellowship Program (AFP) 2021\nand Induction program for the first year students (All branches) was held on 19/07/2021. Dr. Abraham T Mathew inaugurated the session.AFP follows a student-business fellowship program and is aimed at creating a generation of young entrepreneurs, scientists, and technologists equipped with the skills and knowledge in solving today’s problems with cutting-edge technologies. By being a part of this initiative, students will get exposure to industry-relevant scenarios along with hands-on experience. During the session the importance and experience of building a startup & Overview of AFP was covered\nGTech m Learn, Technopark Trivandrum (Consortium of IT Companies of Kerala) – 12 February\n2021\nM/s Wadhwani Foundation for Entrepreneurship Development Training – 8 December\n2020\nMoU signing of MBCET with Vydyuthi Energy Services\nOn\n3 December 2020\n, the IET MBCET On Campus crossed a new milestone, with the signing of the MoU between MBCET and Vydyuthi Energy Services (VES) for the collaborative venture of IET Outreach 150.\nDr. Abraham T Mathew, Principal MBCET and Ms. Indira Babu, MD of VES exchanged the signed documents marking the start of our collaboration with Alumni start-ups towards shaping a better and brighter future.\nFor celebrating the 150th year of IET, the UK headquarters had opened a Global Engagement Fund asking proposals from all over the world for events pertaining to Sustainability. Based on that theme, IET MBCET Student chapter had also submitted a proposal, called the IET Outreach 150, an initiative to reach out to the community to extend our skills as well as to learn how the engineering fraternity can make an impact or change, for a better and sustainable living among those in need.\nThe IET MBCET On Campus proposal on Outreach 150 is one among the 4 that got selected from India.\nIET MBCET family is proud to collaborate with Vydyuthi Energy Services (VES) led by its Founder and our Alumni, Mr. Anoop Babu, (EEE 2003-07) for this venture, as our mutual vision is to work towards the UN Sustainable Development Goals. The VES company is listed in United Nations Women Empowerment Program thus ensuring official support of UN in all their activities oriented towards enhancing women capabilities. The IET MBCET family wholeheartedly thank everyone for their support.\nMoU signed with Vydyuthi Energy Services\nHLL Lifecare Ltd – 19 February\n2020\nIBM-MBCET MoU for setting up IBM Speciality Lab in Emerging Technologies\nMoU with IBM India Pvt Ltd for conducting internationally valid training courses for students the topics of\nCyber Security, Data Science and Artificial Intelligence.\nRead More….\nMoU signed with BSNL RTTC\nAn MoU was signed between BSNL Regional Telecom Training Centre (RTTC) and Mar Baselios College of Engineering and Technology (Autonomous) on 15 March 2021. This will help our students to attend training, internships, projects etc\nThe Department of Civil Engineering signed an agreement with KSCSTE – National Transportation Planning and Research Centre (NATPAC) to effectively share the facilities and expertise for collaborative research and advanced learning in various fields of Transportation Engineering and allied areas.\nInfosys Campus Connect\nMoU between MBCET and HLL Lifecare Limited\nMar Baselios College of Engineering and Technology (MBCET) entered into an agreement with HLL Lifecare Limited to boostindustry-academia collaboration and initiate joint research programmes. The Memorandum of Understanding (MoU) was signedbetween MBCET Principal Dr T M George and HLL Chairman and Managing Director Dr. M. Ayyappan in the presence of Dr.Sakuntala S. Pillai, Dean Research and Development, MBCET; Dr. K. R. S. Krishnan, HLL Director (Technical and Operations)and Satheesh Kumar, HLL Senior Vice President. The agreement will establish a linkage between the institute and the industrythat will provide services and expertise to the students for improving capabilities for advanced education, research and innovation.\nMoU between MBCET and LNCPE\nAn MoU was signed on 12 March 2019 between MBCET and LNCPE for joint partnership in conducting NEXUZ’19, an International Summit on Applications of Engineering in Sports, organized by IET MBCET On Campus.\nMoU between MBCET and NISH\nMar Baselios College of Engineering and Technology (MBCET) has entered into an agreement with NISH (National Institute of Speech and Hearing) to boost collaboration and initiate joint research programmes. An MoU was signed on 15 February 2019 between MBCET and NISH. The agreement will establish a linkage between the institute and NISH, that will provide a platform for technological development for differently abled persons.\nIn-house Internship Proposals\nMoUs\nResearch\nConsultancy\nFunded Projects\nIn-house Projects\nResearch Promotion Schemes\nProfessional Development Allowance\nPublication Incentive Claim Form\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}