{
    "filename": "mbcet.ac.in_departments_electrical-electronics-engineering_peos-pos_.html",
    "content": "B. Tech PEOs, POs & PSOs – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nElectrical and Electronics Engineering\n>\nB. Tech PEOs, POs & PSOs\nB. Tech PEOs, POs & PSOs\nPROGRAMME EDUCATIONAL OBJECTIVES (PEOs)\nProgramme Educational Objectives\nare the broad statements which describe in detail about the career and professional accomplishments after significant years of graduation, which the programme prepares the graduands to achieve.\nElectrical and Electronics Engineering\nGraduates will succeed as Professionals in Industry or as Entrepreneurs in Electrical and Electronics Engineering and related disciplines..\nGraduates will be able to adapt to the advances in Technology by continuously acquiring knowledge and skills, with an urge for innovation.\nGraduates will be socially committed individuals, exhibiting professional ethics in addressing technical and engineering challenges.\nElectrical and Computer Engineering\nGraduates will succeed as Engineering Professionals in Industry or as Entrepreneurs in Electrical and Computer Engineering and the related disciplines and exhibit an urge for innovation.\nGraduates will be able to adapt to the advances in Technology by acquiring knowledge and skills manifested through continuous learning and higher qualifications.\nGraduates will be serving community as socially committed individuals, exhibiting professional ethics in addressing the technical and engineering challenges.\nPROGRAMME OUTCOMES (POs)\nProgramme Outcomes\nare the statements as stated by NBA that declare the knowledge, skills and attitudes the students should have at the end of a four year engineering programme in India.\nEngineering graduates will be able to:\nEngineering knowledge\n: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.\nProblem analysis\n: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences.\nDesign/development of solutions\n: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations.\nConduct investigations of complex problems\n: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions.\nModern tool usage\n: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modeling to complex engineering activities with an understanding of the limitations.\nThe engineer and society\n: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.\nEnvironment and sustainability\n: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development.\nEthics\n: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice.\nIndividual and team work\n: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings.\nCommunication\n: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions.\nProject management and finance\n: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments.\nLife-long learning\n: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change.\nPROGRAMME SPECIFIC OUTCOMES (PSOs)\nProgramme Specific Outcomes\nare the statements that assert what the graduands of a specific engineering programme should be able to do.\nI. Electrical and Electronics Engineering\nTo apply the knowledge in Electrical and Electronics Engineering for the design of Power Generation, Transmission, Distribution and Utilization systems.\nTo demonstrate the knowledge required to design, develop, test, and implement Electrical & Electronics systems\nII. Electrical and Computer Engineering\nTo apply the knowledge in Electrical Engineering and Computer Engineering for the design, development testing and operation of Power and Energy Systems in the areas of Generation, Transmission, Conversion, Distribution and Utilization systems.\nTo apply the knowledge in Electrical Engineering and Computer Engineering for the design, development and operation of Industrial systems in the areas of Automation, Control, Energy Management and Economic operation.\nVision\nTo be a Centre of Excellence in Electrical & Electronics Engineering Education, Research and Application of knowledge to benefit the society at large.\nMission\nTo mould quality Electrical Engineers, fostering creativity and innovation to address global issues.\nBoS\nDepartment Advisory Board\nThe People\nFacilities\nNews and Events\nActivities\nConferences\nWorkshops & Seminars\nResearch & Consultancy\nPlacement\nB. Tech PEOs, POs & PSOs\nOpportunities\nCurriculum & Syllabus\nTime Table\nVideo Lectures\nFormer HODs\nDepartment Google Site"
}