{
    "filename": "mbcet.ac.in_faculty_mr-sherry-varghese-george_.html",
    "content": "Mr. Sherry Varghese George – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectronics & Communication Engineering\n>\nMr. Sherry Varghese George\nEmployee Code / ID No.\nQualifications\nM. Tech in Telecommunication Engineering, Pursuing Ph.D\nOrcid ID\nhttps://orcid.org/0000-0002-0083-6751\nIndustry / R & D Experience\nNil\nEmail ID\n[email protected]\nAlternate E-mail ID\nMobile No (Optional) / Intercom Extension No.\n111\nAreas of Interest / Current Research\nWireless Communication, IoT\nResearch, Consultancy, Publication\nH Aravind Sarma\n,\nSherry Varghese George\n, Asst. Professors, Dept. of ECE presented a paper titled Channel Estimation in V2V Communication in International Conference on Emerging Technologies for Intelligent Systems [ETIS 2025] organized by APJ Abdul Kalam Technological University.\nAkhila Lawrence, Sherry Varghese George, “Performance Analysis of Pruned DFT Spread FBMC”, International Journal of Engineering Science and Computing (IJESC), Volume 10, Issue 9, September 2020.\nAnn Lia Jose, Athira Soman Nair, Joshna Mary Alex, Sameer S., Sherry Varghese George, “Robotic Walk along Cart”, International Journal of Recent Technology and Engineering (IJRTE), Volume 9, Issue 2, July 2020.\nAkhila Lawrence, Sherry Varghese George, “Pruned DFT Spread FBMC”, IOSR Journal of Electronics and Communication Engineering (IOSR – JECE), Volume 15, Issue 2, Ser. I, pp. 08-11, April 2020.\nMeekha Hanna Sam, Sherry Varghese George, “User Association Enabled Access Point Grouping in HetNets”, 2nd IEEE International Conference on Intelligent Computing, Instrumentation and Control Technologies (ICICICT – 2019), July 2019.\nMeekha Hanna Sam, Sherry Varghese George, “Spectrum Allocation for Non-orthogonal Multiple Access in Heterogeneous Networks”, International Organization of Scientific Research – Journal of Mobile Computing and Application (IOSR – JMCA), Volume 6, Issue 2, April 2019.\nArjun S., Sherry Varghese George,  “A Study on Face Detection and Image Steganography using Discrete Wavelet Transform”,  International Organization of Scientific Research Journal for VLSI and Signal Processing (IOSR – JVSP), Volume 8, Issue 2, Version I, pp. 14-18, April 2018.\nSherry Varghese George, Luxy Mathews, and Sakuntala S. Pillai, “Heterogeneous User Mobility based Scheduling Scheme and Transmission Mode Selection in Downlink LTE/LTE-A Systems”, 2nd IEEE International Conference on Control, Instrumentation, Communication and Computational Technologies (ICCICCT), pp. 78-83, December 2015.\nSherry Varghese George, Luxy Mathews, and Sakuntala S. Pillai, “Performance Analysis of Transmission Modes in 4G LTE/LTE-A Downlink Systems”, 2nd IEEE International Conference on Control, Instrumentation, Communication and Computational Technologies (ICCICCT), pp. 219-224, December 2015.\nSherry Varghese George, Luxy Mathews, and Sakuntala S. Pillai, “A New Approach for the Modeling of LTE/LTE-A Downlink/Uplink Systems based on LTE System Toolbox”, International Journal of Research in Electronics and Computer Engineering (IJRECE), Volume 3, Issue 3, pp. 48-51, July 2015.\nSherry Varghese George, Luxy Mathews, and Sakuntala S. Pillai, “Physical Layer Frame Structure in 4G LTE/LTE-A Downlink based on LTE System Toolbox”, International Organization of Scientific Research – Journal of Electronics and Communication Engineering (IOSR – JECE), Volume 10, Issue 3, Version 4, pp. 12-16, June 2015.\nSherry Varghese George, Nandan S., Manu V. V., Sherin Leya Oommen, and Shimna Sebastian, “User-defined Autonomous Robotic Tracer”, International Journal of Computer Science and Mobile Computing (IJCSMC), Volume 2, Issue 13, pp. 95-100, December 2013.\nSherry Varghese George, Nandan S., Manu V. V., Sherin Leya Oommen, and Shimna Sebastian, “User-defined Autonomous Robotic Tracer”, International Conference on Mobility in Computing (ICMiC), Volume 2, Issue 13, pp. 95-100, December 2013.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNil\nAcademic / Professional Outreach Activities\nISRO IIRS (Indian Institute of Remote Sensing) Outreach Programme Co-ordinator\nServed as a Committee Member of the 27th National Children’s Science Congress\nMembership in Professional bodies/ organizations\nLife-time Member of ISTE\nCommunity Outreach Activities\nAwards / Distinctions / Rank / Other Achievements if any\nAn article titled “Logo Release of 27th National Children’s Science Congress” was published in the Newsletter of NCSC 2019.\nNominated as Social Media Champion of the Institute under circular from All India Survey for Higher Education (AISHE).\nAwarded Silver Certificate for successfully completing NPTEL Online 12 week Certification Course on “Cryptography and Network Security” in April 2019.\nNominated as one among the best M. Tech and Ph. D. thesis awards at the “Graduate Congress: GraTE’7’” organized by IEEE Communications Society, Bengaluru\nFourth Rank for M. Tech degree in the University of Kerala in 2015\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}