{
    "filename": "mbcet.ac.in_faculty_ms-soumya-a-v_.html",
    "content": "Dr. Soumya A. V. – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nDr. Soumya A. V.\nEmployee Code / ID No.\n10309012\nQualifications\nPh.D\nOrcid ID\nhttps://orcid.org/0000-0003-2599-8375\nIndustry / R & D Experience\n—–\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9746241841/406\nAreas of Interest / Current Research\nPower Electronics and Drives, Microgrid, Power Quality, Biomedical Instrumentation\nA. V. Soumya and J. B. Edward, “Islanding Detection in Microgrid Using Signal Processing Techniques Adopting a Supervised Classifier”, Int J Intell Syst Appl Eng, vol. 10, no. 3, pp. 256–264, Oct. 2022.\nA. V. Soumya and J. B. Edward, “Artificial Intelligence Based Supervised Classifier for Detection of Islanding in Three Phase Microgrid”, Neuro Quantology, Vol. 20, Issue 10, pp 11054-11062, October 2022.\nA V Soumya, J. Belwin Edward, 2021, Islanding Detection In Microgrid Using Ai Techniques and Supervised Classifiers, Journal of Harbin Institute of Technology, Vol 53, Issue 9, pp. 33-51.\nSoumya A.V., J. Belwin Edward, 2021, An Intelligent Method of Anti Islanding Detection Using ANN, International Conference on Power and Advanced Computing Techniques, i-PACT2021, (Accepted for Publication).\nA V Soumya, J. Belwin Edward, 2020, Islanding Detection in a Microgrid using Artificial Neural Network and WT, TEST Engineering and Management, Vol. 83: March/April 2020, Page No. 12604-12615.\nSoumya A.V., J. Belwin Edward, 2019, A PV-WEC based Microgrid System incorporating Hybrid Islanding Detection Technique, International Conference on Power and Advanced Computing Techniques, i-PACT2019, DOI: 10.1109/i-PACT44901.2019.8959993.\nAthira Vijay J, Ms. Soumya A V, “Power Quality Improvement in Microgrid,” International Journal of Innovative Research in Science, Engineering and Technology, Vol. 7, Issue 4, pp. no. 3678-3684, April 2018.\nSoumya A.V Indu M,Vishak JB, Electrolytic Capacitor-Less Zeta Converter Based PV Interfaced DC Distribution System Incorporating Anti-Islanding Technique, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering(IJAREEIE),Vol 7, Issue 5, pp no. 2549-2556.\nMs. Soumya A.V , Dr. J. Belwin Edward, “A Hybrid Islanding Detection Technique for PV interfaced AC Distribution System”, International journal of control theory and applications , vol 10, 2017, pp  493-502.\nRehna M J Soumya A.V., Modeling and Simulation of a Microgrid with PV and wind Energy Resources, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, Vol 6, pp No. 1-9.\nMs. Soumya A.V, J. Belwin Edward, “Review of Islanding Detection Techniques for Distributed Energy Sources”, in the proceedings of National Conference on Emerging Trends in Engineering and Technology (NCETET’16), Lourdes Matha College of Science & Technology, Thiruvananthapuram, Vol. 3, Special Issue 3, August 2016.\nIndu M, Ms. Soumya A V, “Boost Converter fed PV Interfaced AC Distribution System Incorporating Islanding Detection Technique”, International Journal for Scientific Research & Development Vol. 4, Issue04, 2016.\nPM Tom, JB Edward, A Prasad, Ms. AV Soumya, K Ravi, “A Technical Review on LVRT of DFIG Systems”, Information Systems Design and Intelligent Applications, 2016, pp 397-404.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\n—-\nMembership in Professional bodies/ organizations\nISTE\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\nB.E and M.E (Fisrt Class with distinction from Anna University)\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}