{
    "filename": "mbcet.ac.in_outreach_nss_.html",
    "content": "NSS – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nOutreach\n>\nNSS\nNSS\nAbout NSS\nUnder the development of Youth affairs and Sports of the Government of India.\nNational Service\nScheme popularly known as\nLaunched in Gandhiji’s Centenary year 1969.\nAimed at developing student’s personality through community service.\nVoluntary association of young people working for a campus-community linkage.\nWhat we envisage\nThe programmes implemented in NSS Technical Cell was revamped as curriculum related NSS activities with a vision-‘\nto mould ‘Social Engineers\n’ who knows the pulse of the community and would be able to act accordingly” Our motto is- ‘\nto make the campuses community related and to reduce the space between the community and technical campuses\n’.\nNeed for NSS\nIn an age when relationships between individuals and organizations are getting more & more complex, it is not enough only to have an excellent academic record. Being good at number crunching and scoring high marks in subjects are not the only criteria for success in professional or personal life. The ability to deal with ones feelings and understand the feelings of others in any given situation helps one to complement knowledge with human values.\nNSS activities are imparted to fine tune the students\nattitudes, values, beliefs, motivation desires, feelings, eagerness to learn,\nwillingness to share and embrace new ideas, goal orientation, flexibility,\npersuasion, futuristic thinking, compassion, and various skill sets of communication,\netiquette and manners so that they\nNSS activities helps students will be able to\ndeal with different situations responsibility,\nStrengthen the student from within.\nTheir skills empower them to understand “Who they are” and how best they can come across as competent individuals in any given situation. It helps the student to grow as a key leader in the establishment. Technical professionals need a combination of technical skills, business skills, and interpersonal skills. If a technically proficient Engineer is not willing to expand expertise into leadership, maybe he or she is not the best fit for an eventual Managerial role.\nAnnual Report 2023-24-\nClick here\nAnnual Report 2022-23 –\nClick here\nAnnual Report 2021-22 –\nClick here\nAnnual Report 2020-21 –\nClick here\nActivities from  AUGUST 2020 – SEPTEMBER 2020-\nclickhere\nActivities from 4 JULY 2020 – August 2020 –\nclickhere\nActivities from 3-JUNE-JULY-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from MAY-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from APRIL-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from MARCH-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from FEBRUARY-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from JANUARY-2020\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from DECEMBER-2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from NOVEMBER-2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from OCTOBER-2019 – PART2\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from OCTOBER-2019 – PART1\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from SEPTEMBER-2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nActivities from AUGUST-2019\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nNSS\ncelebrated Gandhi Jayanthi on Oct 2nd by cleaning MC road from Palavila to Thaikkadu near Pirappincode. The programme was organized by\nNSS\nunit of MBCET in association with Manickal Panchayath and St. John’s Medical Village Pirappincode\nSOCIAL SERVICE CLUB\nThe Senate members on behalf of the College visited the Mar Gregorios Sneha veedu.\nThe social activities club remains very active and dedicated in its endeavors. It has recently developed a Blood Donor’s Forum with more than a thousand students pledging to donate their blood as and when required. In addition, students donate their blood to patients admitted in RCC, SUT, KIMS, Medical colleges etc. The work among orphanages continues with fervor. The S1S2 students were actively interacting with NGOs in RCC offering financial help to the poor patients of the Pediatric Ward.\nA group of first year students cut down their expenses for Christmas celebrations and donated the amount for the children’s ward of RCC. They also contributed toys, clothes and old magazines to these children.\nNSS\nUBA\nAARDRAM\nChirag\nSpandanam\nSPARSHAM\nThanal\nKaruthal\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}