{
    "filename": "mbcet.ac.in_faculty_dr-jishnu-chandran-r_.html",
    "content": "Dr. Jishnu Chandran R – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nMechanical Engineering\n>\nDr. Jishnu Chandran R\nEmployee Code / ID No.\n10625083\nQualifications\nPhD, Post-Doc\nOrcid ID\n0000-0003-3128-3595\nIndustry / R & D Experience\n3 years Post-Doc Research experience in Mechanical Engineering (CFD) from VIT\nUniversity, One year Masters Project Intern at VSSC, ISRO.\nPhD from Indian Institute of Space Science and Technology, Thiruvananthapuram.\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9447929116\nAreas of Interest / Current Research\nComputational Fluid Dynamics, Multi-phase flows,  CO2 Air-Conditioning and\nRefrigeration, Renewable Energy Harvesting Systems, Engineering Systems for Sustainable Development, PINN.\nResearch,  Consultancy, Publication\nPUBLICATIONS\nSCI / Scopus Indexed Journal Publications\nSreeja Sadasivan, Pradeep S, Jishnu Chandran R. Advances in Droplet Microfluidics: A Comprehensive Review of Innovations, Morphology, Dynamics, and Applications, Microfluidics and Nanofluidics, 29 (2025) 17. Springer. DOI: https://doi.org/10.1007/s10404-025-02789-5 [Imp Fac- 2.3]\nJishnu Chandran R, Sreeja Sadasivan, Senthil Kumar A, Fei Chen. Two-Phase Radial Ejector for Transcritical CO2 Refrigeration, Physics of Fluids, 36 (2024) 126142. AIP Publishing. DOI: https://doi.org/10.1063/5.0244439 [Imp Fac- 4.1]\nJishnu Chandran R, Senthil Kumar A, Sreeja Sadasivan, Bibin John & Rajesh Kanna P. Effect of Spindle Position on the Performance and Two-phase Characteristics of Controllable Ejector for CO2 Refrigeration System, Journal of Supercritical Fluids, 205 (2024): 106125. Elsevier. DOI: https://doi.org/10.1016/j.supflu.2023.106125 [Imp Fac- 3.9]\nJishnu Chandran R, Senthil Kumar A, Sreeja Sadasivan, Rajesh Kanna P & Fei Chen. Two-phase Simulation of Transcritical CO2 Flow in Nozzle and Ejector using the Homogeneous Equilibrium Model, Journal of Thermal Analysis and Calorimetry, 149 (2024): 5367–5380. Springer. DOI: https://doi.org/10.1007/s10973-024-13104-9 [Imp Fac- 3.0]\nTamilarasan S K, Jose J, Boopalan V, Chen F, Arumugam S K, Ramachandran J C, Parthasarathy R K, Taler D, Sobota T, Taler J. Recent Developments in Supercritical CO2-Based Sustainable Power Generation Technologies. Energies 17 (2024) 16: 4019. MDPI. https://doi.org/10.3390/en17164019  [Imp Fac- 3.0]\nVignesh Boopalan, Jishnu Chandran R, Senthil Kumar A & Rajesh Kanna P. Numerical investigation of Burnout effect in turbine blade tip leakage at transonic condition, Engineering Research Express, 6 (2024) 4: 045554. IOP Publications. DOI: https://doi.org/10.1088/2631-8695/ad923a [Imp Fac- 1.5]\nSreeja Sadasivan, Senthil Kumar A, Jishnu Chandran R & Mahesh C Aggarwal. Effects of Influencing Factors on the Performance and Morphology of Shock waves in Ejectors: A Review, International Journal of Modern Physics C, 34 (2023) 11: 2350142. World Scientific. DOI: https://doi.org/10.1142/S0129183123501425 [Imp Fac- 1.4]\nArun Govind Neelan, Jishnu Chandran R, Manuel A. Diaz & Raimund Bürger. An efficient three-level weighted essentially non-oscillatory scheme for hyperbolic equations, Computational and Applied Mathematics, 42 (2023) 70. Springer. DOI: https://doi.org/10.1007/s40314-023-02214-z [Imp Fac- 3.0]\nJishnu Chandran R, & A Salih. Development of a benchmark solution in compressible liquid flows: Analytical solution to the water shock tube problem, Journal of Thermal Analysis and Calorimetry, 147 (2022): 5279-5292. Springer. DOI: https://doi.org/10.1007/s10973-021-10871-7 [Imp Fac- 4.4]\nJishnu Chandran R, & A Salih. The Adaptive damping technique: Improving the simulation accuracy of hydraulic transients, International Journal of Mathematical Engineering and Management Sciences, 6 (2021) 6: 1553-1564, IJMEMS. DOI:  https://doi.org/10.33889/IJMEMS.2021.6.6.092. [Imp Fac- 1.9]\nJishnu Chandran R, Risha Raju, & A Salih. An adaptively damped compressible-liquid model for non-cavitating hydraulic surges, International Journal of Engineering, Transactions A: Basics. 33 (2020) 10: 2047-2056, Materials and Energy Research Center. DOI: https://dx.doi.org/10.5829/ije.2020.33.10a.23 [Imp Fac- 1.2]\nRisha Raju, Jishnu Chandran R, A Salih & Kuruvilla Joseph.  Numerical Analysis of Mixing-chamber non-uniformities and feed conditions for optimal performance of urea SCR, Reaction Chemistry and Engineering. 5 (2020) 12: 2236-2249, Royal Society of Chemistry. DOI: https://doi.org/10.1039/D0RE00269K [Imp Fac- 4.2]\nJishnu Chandran R, & A Salih. A modified equation of state for water for a wide range of pressure and the concept of water shock tube, Fluid Phase Equilibria 483 (2019): 182-188, Elsevier. DOI: https://doi.org/10.1016/j.fluid.2018.11.032 [Imp Fac- 2.8]\nNon-Scopus Journal Publications\nJishnu Chandran R, & A Salih. A comparative performance analysis of HLLC and AUSM+-up Riemann Solvers, Cankaya University Journal of Science and Engineering 7 (2020) 2: 108-117, Cankaya University.\nJishnu Chandran R, & A Salih. A pressure-based compressible-liquid flow model for computation of instantaneous valve closure in pipes, Science and Technology Journal 7 (2019)2: 60-66, Mizoram University.\nBook Chapters (Scopus-indexed)\nJishnu Chandran R, Risha Raju, A Salih & Senthil Kumar A. Accurate Compressible Flow Modelling of Liquid Shock Tube Problems, Fluid Mechanics and Fluid Power, 2022 (Vol. 2). Lecture Notes in Mechanical Engineering, Springer. DOI: https://doi.org/10.1007/978-981-99-5752-1_75\nJishnu Chandran R, & Micky Baisil. Experimental and Computational Study of Liquid Nitrogen Transfer Line Chilldown, Fluid Mechanics and Fluid Power 2021 (Vol. 2), Lecture Notes in Mechanical Engineering, Springer. DOI: https://doi.org/10.1007/978-981-19-6970-6_57\nArun Govind Neelan, Jishnu Chandran R, Manuel A. Diaz & Raimund Bürger. Improved Three-level Order-Adaptive WENO Scheme, Fluid Mechanics and Fluid Power 2021 (Vol. 2), Lecture Notes in Mechanical Engineering, Springer. DOI: https://doi.org/10.1007/978-981-19-6970-6_41\nConference Publications\nJishnu Chandran R, Senthil Kumar A, Vignesh Boopalan, Jobel Jose. (2025) Numerical Investigation of the Transient Pressure Fluctuation across Valves in Valve-Induced Surges, International Conference on Sustainable Aerospace Technologies and Innovations (ICSATI-2025), VIT Bhopal University.\nRisha Raju, Jishnu Chandran R, Kuruvilla Joseph, & A Salih (2019). Numerical Modelling of NOx Reduction on Cu-ZSM-5 Monolith Reactor, 3rd International ISHMT-ASTFE Heat and Mass Transfer Conference, 2019, 1-6.\nJishnu Chandran R, & A Salih (2018). Equivalence of Density-Based and a Customized Pressure-Based Approach for Compressible Modelling of Instant Valve Closure in Irrigation Pipes, 7th International Conference on Fluid Mechanics and Fluid Power, 2018,1-3.\nJishnu Chandran R, & A Salih (2017). Water Shock tube simulation with Tait equation of state, 2nd International ISHMT-ASTFE Heat and Mass Transfer Conference, ISHMT Digital Library. Begell House Inc., 2017, 2203-2209.\nJishnu Chandran R, & A Salih (2016). A Comparative Study of AUSM Scheme with Some Common Finite Difference Schemes in Solving One-Dimensional Shock-Tube Problem, 6th International Conference on Fluid Mechanics and Fluid Power, 2016, 1-3.\nJishnu Chandran R, A Ramaraju, Harikrishnan R, Abhishek Kumar, Sujith Kumar R (2013). Chilldown Studies of a Cryogenic Transfer Line, 2nd National Conference on Advances in Heat Transfer and Fluid Dynamics, 2013, 233-238.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—-\nAcademic / Professional Outreach Activities\nProgram Coordinator for the ‘Autodesk certified two-day CAD Workshop’ organized for the Mechanical UG- students, in association with the ASME MBCET Chapter. March, 2025.\nProgram Coordinator for the ME Department Technical Fest, VORTECHX-2025.\nDelivered ISTE Torchbearer Talk on ‘Technical Writing: General aspects of paper writing’ at MBCET, Thiruvananthapuram, on Feb, 2025.\nReviewer for the Physics of Fluids, Journal of Mechanical Science and Technology,\nInternational Journal of Thermodynamics, International Journal of Engineering [Scopus and WOS Indexed]\nMembership in Professional bodies/ organizations\nLife Member of the Indian Society for Technical Education (ISTE).\n[ Membership ID: LM 141859 ]\nCommunity Outreach Activities\n—-\nAwards / Distinctions / Rank / Other Achievements if any\nAward for best presentation at the 2nd International Conference on Fluid, Thermal, and Energy Systems, 2024.\nAward for best presentation at the 48th National Conference on Fluid Mechanics and Fluid Power, 2021.\nSecured All India Rank 1354 in GATE 2011 with Score-574 and Percentile-98.33.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}