{
    "filename": "mbcet.ac.in_departments_mechanical-engineering_research_.html",
    "content": "Research – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nMechanical Engineering\n>\nResearch\nResearch\nFaculty pursuing PhD\nThe following staffs are pursuing PhD:\nAyswer A S\nDeepak B\nRuby Maria Syriac\nVinod V\nVishnu Prasad K R\nDeepak B S\nBipin Sankar\nFunded Projects\nExternal Funded Projects\nExternal Funded  Research\nTVS Motor company Ltd granted a fund of 25,000/- for the project titled “Prototype making of a portable oxygen concentrator” in the year 2021.\nPrincipal Investigator: Dr. Nidhi MB\nProject duration: 2 years\nStatus : Completed\nKSCSTE has granted an amount of 10,000/- for the project titled “ Design Analysis and Fabrication of a Flapping Wing Ornithopter with elliptical wing configuration” in the year 2020.\nPrincipal Investigator: Dr. Premchand V.P.\nProject duration: 1 years\nStatus : Completed\nKSCSTE has granted an amount of 10,000/- for the project titled “ Design and development of a rehabilitative device for spastic feet.” in the year 2020.\nPrincipal Investigator: Dr. Rajesh TN.\nProject duration: 1 years\nStatus : Completed\nCERD has granted an amount of 32,500/- for the project titled Design and development of a centrifugal supercharger system for lean supercharging of a single cylinder SI engine.” in the year 2020.\nPrincipal Investigator: Dr. Rajesh TN.\nProject duration: 1 years\nStatus : Completed\nDepartment of science and Technology (DST) under ASEAN India Research Training Fellowship has granted an amount of 3,40,000/- for the project titled “ Modelling and Simulation of Nuclear Reactor Engineering Equations in MATLAB”  on September 2019.\nPrincipal Investigator: Mr.Bobin Saji George\nProject duration: 0.5 years\nStatus : Completed\nCentre for Disability Studies (CeDS) has granted an amount of 50,000/- for the project titled “ Semi automatic medicine Dispenser”  on August 2018.\nPrincipal Investigator: Dr. Nidhi MB\nProject duration: 1.5 years\nStatus : Completed\nIndian Space Research Organisation (ISRO) has granted an amount of Rs.24,40,000/- for the project titled “Study on Mechanism of cavity oscillation for wide range of flow speeds” on October 2017.\nPrincipal Investigator: Dr. K. Muraleedharan Nair\nCo-Principal Investigator : Mr. Bobin Saji George\nProject duration: 2 years\nStatus : Completed\nCentre for Engineering Research and Development (CERD) – APJ KTU has granted an amount of Rs.2,00,000/- for project titled “An extensive study on oscillation of open, closed rectangular and rounded cavity” on March 2017.\nPrincipal Investigator: Dr. K. Muraleedharan Nair\nProject duration: 3 years\nStatus : Completed\nKerala State Council for Science and Technology (KSCSTE) has granted an amount of 3,43,816/- for the project titled “ Mitigation of Plastic waste in Kerala through the adaption of Pyrolysis”  on January 2016.\nPrincipal Investigator: Mr. Deepak B\nCo-Principal Investigator : Mr. Pradeep M\nProject duration: 1 year\nStatus: Completed, Completion Certificate Received\nCentre for Disability Studies (CeDS) has granted an amount of 30000/- for the project titled “ Life saving suit with people with disabilities”  on June 2015.\nPrincipal Investigator: Dr. Nidhi MB\nCo-Principal Investigator : Mr. Sreejith NK\nProject duration: 1.5 years\nStatus: Completed\nCentre for Disability Studies (CeDS) has granted an amount of 53000/- for the project titled “ Ryle’s Tube feeder”  on December 2014.\nPrincipal Investigator: Dr. Nidhi MB\nProject duration: 1.5 years\nStatus: Completed\nInhouse Funded Projects\nDesign and Development of a Subsonic Wind Tunnel for Studies on Aerodynamic Characteristics of NACA4412 Airfoil\nPrincipal Investigator: Mr. Vaisakh S Nair\nCo-PI : Dr. Rajesh TN\nDuration: 18 Months\nAmount: 2,45,000 INR\nCampus Utility Vehicle\nPrincipal Investigator: Mr. Mobin M Mathew\nDuration: 1 year\nAmount: 700000 INR\nNon rigid Dirigible Multifeatured Airship\nPrincipal Investigator: Mr. Mobin M Mathew\nDuration: 1 year\nAmount: 133000 INR\nGeometrical influence on sea shore structures on flood risk management\nPrincipal Investigator: Mr. Vaisakh S Nair\nDuration: 1 year\nAmount: 168000 INR.\nInternal Funded  Research\nThe project titled “Experimental and Numerical Investigations on the geometrical influence of sea shore structures on flood risk management” was granted an amount of 1,68,000 in the year 2022.\nPrincipal Investigator: Mr. Vaisakh S Nair.\nCo-Principal Investigator: Dr. Premchand VP\nProject duration: 1 years\nStatus : Completed.\nThe project titled “Development of an engine management system for a single cylinder SI engine.” was granted an amount of 57,000 in the year 2020.\nPrincipal Investigator: Mr. VishnuAsok J.S.\nCo-Principal Investigator: Dr. Rajesh TN.\nProject duration: 1 years\nStatus : Completed\nThe project title “ Numerical Investigation of Heat dissipation from an Electronic Component in a Closed Enclosure “ was granted an amount of Rs.1,75,000/- on November 2018.\nPrincipal Investigator: Mr. Bobin Saji George\nCo-Principal Investigator : Dr. Rupesh S\nProject duration: 1 year\nStatus: Completed\nThe project title “ Mobility aid for a paraplegic patient “ was granted an amount of Rs.1,50,000/- on November 2018.\nPrincipal Investigator: Dr. Rajesh T. N.\nCo-Principal Investigator : Mr. Raveesh G\nProject duration: 1 year\nStatus: Completed\nThe project title “ Experimental and Numerical Investigations on tremor suppression for Parkinson patients using a dynamic vibration absorber “ was granted an amount of Rs.65,000/- on November 2018.\nPrincipal Investigator: Dr. Premchand V. P\nProject duration: 1 year\nStatus: Completed\nThe project title “ Experimental and Numerical Investigation of Flow Past a Cylinder “ was granted an amount of Rs.95,000/- on December 2017.\nPrincipal Investigator: Dr. K. Muraleedharan Nair\nCo-Principal Investigator : Mr. Vinod V\nProject duration: 1 year\nStatus: Completed\nThe project title “ Portable River Water Filtering System” was granted an amount of Rs.68,000/- on December 2017.\nPrincipal Investigator: Mr. Kedar Mohan\nCo-Principal Investigator : Dr. Nidhi MB\nProject duration: 1.5 years\nStatus: completed\nThe project title “ Performance and Emission Analysis of SI Engine with Nano Fuel Additives “ was granted an amount of Rs.62,000/- on December 2017.\nPrincipal Investigator: Mr. Vishnu Prasad KR\nCo-Principal Investigator : Mr. Deepak B\nProject duration: 4 Months\nStatus: Completed\nThe project title “ Experimental Investigation on Sloshing Behavior of Fluid in Various Tank Geometry “ was granted an amount of Rs.2,40,000/- on December 2017.\nPrincipal Investigator: Mrs. Ruby MS\nCo-Principal Investigator : Mr. Unnikrishnan G\nProject duration: 1 year\nStatus: Completed\nFellowship\nASEAN- India Research Training Fellowship (AIRTF) – Host Scientist\nMr. Bobin Saji George is affiliated as host scientist at ASEAN- India Research Training Fellowship. AIRTF is an initiative of Department Of Science & Technology, Govt Of India to develop a healthy ASEAN India relationship. AIRTF offers sponsored fellowship programs in India to Science & Technology scholars across ASEAN countries.\nInternational Research Scholar: Mr. Zayar Sit Paing Thu\nCountry: Myanmar\nArea: Nuclear Technology (Simulation of reactor equations)\nStatus: Completed (15\nth\nSeptember 2019 to 15\nth\nMarch 2020)\nFaculty interaction with outside world\nDr. Nidhi M B\nDelivered a session as part of a national seminar on ‘production engineering reimagined: trends innovation and opportunities’ on May 3, 2025 organized by Institute of Engineers, Kerala Chapter.\nDelivered a session on ‘Social Innovations for sustainable development’ at Rajagiri School of Engineering and Technology on Jan 31 2025.\nServed as Chief Guest for ISTE students chapter inauguration at Marian college of Engg, Trivandrum on January 16, 2025. It was then followed by an address on the topic ‘Role of professional bodies in technical education’.\nServed as visiting faculty at Entrepreneurship Development Institute of India (EDII) Ahmedabad as Expert in supply chain management vertical during January 09 – 12, 2024\nAI and ML for cyber security, TocH, cochin, 26 May 2023 as part of ISTE FDP 26-31 May 2023.\nDesign thinking for sustainability, Curtin university Dubai Campus, 14 April 2023.\nSustainabile innovations as part of sustainable Hackathon, 27 April 2023.\nSpoke on womens day celebration by Metro mart 8 March 2023 to inspire more women leaders.\nTechnology Management: HR reflections, 26 Jan 2023 for ISTD, Trivandrum.\nServed as panellist along with KTU VC, MS KDISC and industry experts on the occasion of launch of skill express platform by Gtech Mu learn, 23 Jan 2023.\n1) Multiple Roles of an EDUCATOR, 2) Communication and Classroom management, 3) Handon on Micro teaching analysis, as part of Induction training program for teachers, 3-7 Jan 2023 organised by St Joseph Pala, Kottayam.\nCarbon Neutrality via Waste management, as part of FDP Achieving Carbon Neutrality: The way forward: 19-23 Dec 2023 at CET School of Architecture.\nSupply chain Sustainability, as part of FDP on Trends in Modelling Supply Chains- Analytical and Simulation Perceptive, 28 Nov – 3 Dec 2022 organised by CET.\nChief Guest for Inaugural Session at Musaliar college of Engineering as part of ITech international Conference on advances in Mechanical engineering, 1-2 Dec 2022.\nPanlist for women in Engineering IEOM oraganised by NIT Warangal, 16-18 Aug 2022.\nAdditive Manufacturing for sustainability, as part of I-SMART International conference by FISAT, 22-26 May 2022.\nAdditive Manufacturing for sustainability, FDP on ‘3D Printing and additive manufacturing’ 22 April 2022.\nRole of Professional Bodies, as part of ISTE Chapter activities, Central Poly Vattiyurkavu, Trivandrum, 7 April 2022.\nSmart Manufacturing, Women in mechanical Engineering, ASME, 9 March 2022.\nSelf-Reliance through Productivity, as part of Productivity week celebrations, HLL Lifecare Akkulam Factory Trivandrum on 18 Feb 2022.\nNEP 2020: Highlights and Analysis, Mangalam college of Engineering, Kottayam,11 Nov 2021.\nInnovation Management- ISTE student chapter inauguration, SNMIMT Engg. College, 21 Sept 2021.\nData Annotation: Trends and Application, Keynote address, International Conference on Research Advances in Engineering and Technology, ITech CET, 24 Sept 2021.\nInstitutional Sustainability, Smart Manufacturing, Sustainable SCM-Case study, 9,11,13 Aug 2021, as part of FDP on Sustainable Green Manufacturing-Industry 4.0.\nRepresented India as Panellist in International women Engineers Conclave 2021, IEI Qatar Chapter, 25 June 2021.\nOpportunities in AI for New Al Wurood School in Saudi Arabia 12 June 2021.\nResource person for Professionalism: Timeless Leadership, 24 May 2021, or AICTE –ISTE faculty induction program organised by KSIT College Karnataka, 24-29 May 2021 on the topic Future wireless and Communication: Standards and Technology.\nResource person for Institutional Sustainability: Curriculum Leadership – AICTE Sponsored FDP on Induction training program for faculty, 19-24- April, 2021, organized by Mohandas College of Engineering, Anad TVM, Kerala.\nKeynote Speaker on Institutional Sustainability 22 April for AICTE sponsored I-SMART conference organized by FISAT 22-23 April 2021. Chaired the Track 4 session.\nResource person for Professional Ethics – AICTE Sponsored FDP on Induction training program for faculty, 22-27-March, 2021, organized by Mohandas College of Engineering, Anad TVM, Kerala.\nPanelist speaker on Global Technical Education, 11th Annual conference Singapore 7-11 March 2021, IEOM.\nKeynote at UITM Mara, Malaysia on Sustainable Supply chain -WCOSET- ICSTEE 2021, 9-11 March 202.\nProfessional Ethics instilling Values at Thejus College of Engineering,Thrissur organized by ethics committee and ISTE, 6 March 2021 at 12 noon.\nRisk Management and Accountability at HLL R & D, as part of Assistant managers induction training program. 5 March 2021.\nFuture talks Prayaana, Interface with Smart Manufacturing, 5th Feb 2021.\nWebinar on “National Education Policy 2020: Post Covid Career Strategies”,at Carmal Polytechnic College, Punnapra, Alapuzha on 1 Dec 2020.\nAn invited talk titled “Future Engineers: A journey to self-discovery” was delivered as part of first year Student induction program at MBCET on 21 Nov 2020.\nResource Person for 3 Day FDP on Purposeful research organized by ISTE Kerala Section in Association with Prayaana Labs, OCT 28-30, 2020 on the topic- Research funding research projects: Bootstrapping to obtain research funding.\nPanelist for Kerala Virtual meet for Come back to career on 26 Sept 2020, organized by Prayaana as part of C2C mission for empowering women.\nResource person for topic Post Covid career for the annual meet organized by GEC Kozhikode as part of ISTE chapter, 20 Sept 2020 11am to 1 pm.\nResource person on SMART FACTORIES and AR, 21 July 2020, IFET College, Tamil Nadu for AICTE sponsored FDP on Cyber physical systems in manufacturing, 20-26 July 2020. (11-8-2020, 21-8-2020, 10 -09-2020).\nResource person for OPTIMIZING E-LEARNING, 11 July 2020, organized by Mohandas college of Engineering ANAD, Trivandrum.\nKey note address on Topic Industry-Academia Trends: Post Covid Era 11 am 20/06/2020 -RTET’20 National conference organized by MIT, Kannur, 20-21 June 2020.\nResource person for “Role of professional bodies- Industry 4.0” as part of ISTE students Chapter TECH FEST -ASTRA 2020, on 1 Feb 2020 organized by TKM College of engineering, Kollam.\nResource person for “Role of professional bodies- EXCOM MEET UP” as part of ISTE students’ convention 18th Jan 2020 organized by GEC Barton Hill College of engineering, Trivandrum.\nResource person for Concrete Summit on 4th April 2019, on topic Construction 4.0- Civil Engineering Perceptive, Muthoot Institute of science and Technology, Varikoli, Ernakulam.\nInvited speaker on the topic Tuning Technical education for Industry 4.0 and Society 5.0, at VTU on the occasion of 48th ISTE National Annual Faculty Convention, 19-20 March 2019.\nResource person on the topic Active learning strategies: Improving student retention, at GEC Thrissur as part of AICTE_ISTE faculty induction training program 18-24 Feb 2019.\nResource person for the topic Circular Economy for Sustainability and Productivity, at HLL Lifecare Ltd -AFT as part of Productivity week celebration, on 15 Feb 2019.\nResource person on Management strategies for Industry 4.0 and Inaugurated Symposium and Techfest 2018, organised by ISTE Student chapter of Kalasalingam University, on 13/04/2018. Invited by Faculty Affairs & Centre for Learning Technology, Kalasalingam Academy of Research and Education, Krishnankoil – 626126.\n“Industry 4.0 – The leap frog opportunities for India”, at HLL Lifecare Ltd, PFT as part of productivity week observation on 17th Feb 2018.\nAnt colony optimization and Kill Herd optimization algorithms,17- 21 July 2017 at MBCET, STTP on Optimization techniques for Engineering Application.\n“Role of professional bodies in Technical Education”, Faculty Indiuction Training Program by ISTE _MCET chapter on 27/6/2016-2/7/2016, at Mohandas College of Engineering and Technology, Anad, Nedumangad, Trivandrum.\n“Research Communication”, 27-28 July 2016, 2016 on the occasion of FDP on “Open-source Software Tools Used for Research”, at Caarmel Engineering college, Pathanamthitta. She also delivered the Key Note address and inaugurated the FDP.\nDistinguished Speaker at IEOM 2016, Conference at Malaysia on Global Engineering Education during 8-10 Marc 2016, J W Marriot Kuala lumpur.\nTools for Effective Teaching: Sri Vellappally Natesan College of Engineering on 19th August 2015, in association with ISTE SVNCE Chapter inauguration.\nActive Learning Methods, UKF College of Engineering & Technology, Paripally, Kollam, 21st Nov 2014, in association with ISTE Chapter inauguration.\nSCOPE of ISTE at Muslim Association College of Engineering as Part of ISTE Chapter inauguration on 7th August 2014.\nResource person Analyst at JohnCox Memorial C.S.I Institute of Technology, 1st Nov 2014 as part of FDP, Sponsored by AICTE.\nResource person/Analyst 21st Oct 2014 at GEC B, Trivandrum, Workshop Organised with TEQIP support.\nMicro-teaching a) Resource person/Analyst 7th June 2014 at Muthoot college of Engineering.\nSession on Mind Mapping, as part of Academic Document preparation workshop, GecW on 10th Dec 2013.\nWorkshop on m-Learning, GecW on 2nd July 2013.\nIntroduction to Green Supply Chain Management, 8th May 2013, IEI,Trivandrum.\nManufacturing Process, 8th March 2013, GECW, under VFS.\nLearning and M Governance, 6th Feb 2013, one week training program on “Office automation and Computer Applications” at College of Engineering Trivandrum.\nPedagogy and Tools, 18th August 2012, one day FDP on Innovative teaching in Technical Education, Caarmel Engineering College – ISTE- Faculty chapter, Pathanamthitta.\nM learning as an innovative Teaching Aid, 19th April 2012, Two-day workshop on INNOVATION at GECW innovation center & Coventry University, UK, Organized in association with CERD.\nDEA and PSO at National Seminar on Soft Computing Techniques in Computational Biology, 15th Oct 2011, at SIUCEB.\nParticle swarm Intelligence at GECW, 10th Nov 2011.\nSWARM INTELLIGENCE for STTP at Center for Bioinformatics, Karyavattom, 2010.\nParticle Swarm optimization in STTP ON SOFT COMPUTING: TECHNIQUES & ALGORITHMS, Thrissur Government College, 2009.\nAnt colony optimization in STTP on Nature Inspired algorithms for Engineering Computations, College of Engineering 2009.\nMs Ruby Maria Syriac\nDelivered the first knowledge sharing session on the topic ‘Assembly Modelling – A Hands on Experience’ under the MoU with UITM Mara Malaysia on December 20, 2023.\nMr. Bobin Saji George\nHost Scientist ASEAN India Research training Fellowship\nProgram Committee member and Reviewer for 2022 IEEE World Conference on Applied Intelligence and Computing (AIC 2022) June 17-19, 2022.  The Conference proceedings are included in IEEE Xplore\nResource person, “Applications of CFD in Research and Industry”, Faculty and Student Development Programme by M.E.T Engineering College.\nCo – Chair and Reviewer for International Conference on Applied Mechanics and Optimization, 2019\nResource person on the topic “Dynamic Wind Analysis” for FDP “Finite Element Analysis of Structures using ANSYS”, Dept of Civil Engineering, MBCET (Autonomous).\nResource Person, “Workshop on Ansys FLUENT”, MECHATHON – Series of Workshops by ASME MBCET Chapter.\nChief Speaker, “Renewable Resources for Rural Development” by Dream Team 4 Society (NGO)\nVision\nTo be a Centre of Excellence in Education and Research, imparting ethical values for the betterment of mankind.\nMission\nTo impart Technical Knowledge and Values through continuous Training and Research for the overall development of the Stakeholders.\nBoS\nThe People\nDAB\nFacilities\nNews and Events\nActivities\nResearch\nPlacement\nB. Tech PEOs, POs & PSOs\nVideo Lectures\nSyllabus\nStudent Achievements and Activities\nTime Table\nFormer HoDs"
}