{
    "filename": "mbcet.ac.in_departments_science-humanities_publications-workshops-conferences-seminars_.html",
    "content": "Publications, Workshops & Conferences/Seminars – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nScience & Humanities\n>\nPublications, Workshops & Conferences/Seminars\nPublications, Workshops & Conferences/Seminars\nFaculty activities\nPh. D Awarded\nDr. Vidya Vilas has coordinated the 5-day National Level FDP on Universal Human Values-II, sponsored by AICTE, from 29\nth\nAugust to 2\nnd\nSeptember, 2022. More than 70 participants from various states had attended this 5-day residential FDP.\nSavitha M.T, Assistant Professor (Maths) was awarded her doctoral degree in July 2019.\nDhanya Ramachandran, Assistant Professor (Maths) was awarded her doctoral degree in July 2019.\nNeeradha C. K, Assistant Professor (Maths) was awarded her doctoral degree in August 2018.\nArchana P. Das, Assistant Professor (Chemistry) was awarded her doctoral degree in September 2018.\nFaculty as Resource Person\nFaculty as Resource Person\nDr Renjini M Nair, Asst. Professor, were the judges for the Science exhibition at Sarvodaya Vidyalaya, Nalanchira, Trivandrum.\nDr Suvith V S, Asst. Professor did the judging for the Science exhibition at Sarvodaya Vidyalaya, Nalanchira, Trivandrum.\nMs. Lekshmi. I , Asst. Professor did the judging for the Science exhibition at Sarvodaya Vidyalaya, Nalanchira, Trivandrum.\nMs. Syama S Mohan, Asst. Professor did the judging for the Science exhibition at Sarvodaya Vidyalaya, Nalanchira, Trivandrum.\nMr. Anish M.S, Assistant Professor (S & H) was the:\n1) Resource person at College of Engineering, Kalloopara on 12/09/2023 for handling a session for first year Student Induction Program on the topic:\n“Easy way to learn CALCULUS- An exam oriented approach”\n2) Resource person for the National level Webinar on 03/11/2023 for the Madhava Lecture Series on ‘APPLIED MATHEMATICS’ organized by Mathematics Club, Universal Engineering College, Thrissur.\nDr. Veena Nair took a session on ‘Importance of Technical English and communication skills’ in IEEE-EBSCO Knowledge Feast  at Taj Vivanta.\nResource person at College of Engineering Kallooppara, and handled classes on “Easy way to learn CALCULUS – An exam oriented approach” for the first year BTech students on 27/10/2022\nMr. Anish M.S. has been a Resource Person at College of Engineering, Kallooppara, handling a series of classes on “Application of Vector Calculus, Transforms and Differential Equations in Engineering” for the First Year B.Tech. students from 3\nrd\nto 12\nth\nAugust, 2022.\nMr. Anish M.S. has been a Resource Person at College of Engineering, Kallooppara, handling classes on “Easy way to learn Calculus-An exam oriented approach” for the first year B.Tech. students on 27\nth\nOctober 2022.\nProf. Joseph Cheriyan\nDelivered a talk on ‘Orthogonal projections and principal component analysis , in the FDP on robust control systems organized by EE dept, Barton Hill, Thiruvananthapuram on 26/4/21\nExpert talk on ‘Eigen Problem Values- Some Applications’ for MBCET S2 students on 28/4/2021.\nDr. Suvith V.S delivered a talk on “\nOne Small Step for Man One Giant Leap for Mankind”\non 21\nst\nJuly, 2021 organized by Govt. UP School, Parackal as part of the National Moon Day Celebration.\nProf. Joseph Cherian\nwas a resource person for the Faculty Development programs in the following areas:\n“Linear Fractional Transformation & Singular Value Decomposition” for the workshop on Multivariable control and Estimation organized by Department of Electrical Engineering, CET\n“Numerical Method’s for PDE” in the STTP on Computational Fluid Mechanics organized by the Department of Mechanical Engineering, CET.\n“Mathematical Preliminaries for Fractional Calculus” in the workshop on Fractional Calculus organized by Department of Electronics & Communication Engineering.\n“Linear Algebra and some applications” in the STTP on Power Electronics and Applications conducted by EE department, Govt. College Idukki.\nHe has also given a bridge course for the third shemester B. Tech students at Mohandas College of Engineering & Technology, Anad during June, 2015.\nDr. George Zachariah\nwas the Resource Person for the One Day Seminar on NAAC Accreditation held on 22 November 2018 at the KVVS College of Science and Technology, Adoor.\nDr. Krishnamohan\nwas the resource person on Computational Chemistry and its applications\nWorkshop\nConducted\nMar Ivanios College, Trivandrum on 7,8, February, 2020. (GAMESS software)\nInvited Talks on Computational Chemistry and its Application\nNoorul Islam deemed university, Kanyakumari (April, 2019)\nS.N. Govt. Sanskrit College, Pattambi, Palakkad (February, 2019)\nGovernment College for Women, Trivandrum (December, 2018)\nMajlis Arts and Science College, Malappuram (December, 2018)\nCatholicate College, Pathanamthitta (January, 2018)\nMaharaja’s College Ernakulam (March, 2018)\nMalabar Christian College, Calicut (May, 2017)\nMar Ivanios College, Trivandrum (March, 2017)\nGovt. College (Victoria), Palakkad (January, 2017)\nGovt. College, Chittur (January, 2017)\nGSI, Universität Jena, Germany (December, 2016)\nIndo-Korea Science and Technology Centre, Bangalore (September, 2016)\nBCCMS, Universität Bremen, Germany (April, 2016)\nS.N. Govt. Sanskrit College, Pattambi, Palakkad (February, 2016)\nSt. Thomas College, Thrissur (October, 2015)\nS.N. College, Ala, Chengannuur (December, 2014)\nSt. John’s College, Anchal, Kollam (November, 2014).\nDr. Vidya Vilas\nResource person for the lecture series on Nanobiotechnology conducted on 12th and 13th February, 2020 at the Department of Botany, Mar Ivanios College, Nalanchira\nResource person for the lecture series on Nanobiotechnology conducted on 12th and 13th February, 2020 at the Department of Botany, Mar Ivanios College, Nalanchira\nRESEARCH PUBLICATIONS\nManeesha M, Preethi P . C , Harisankar A, Sreeja T.G, Ratheesh Kumar V.K, Sreevidya Thekku Veedu,  Resmi Raghunandan,   Engineering ZIF-67 with heteroatom-doped carbon dots for ultra-sensitive and selective detection of serum albumin in artificial body fluids. Microchemical Journal Volume 210, March 2025, 113046. ISSN 0026-265X\nMs. Lekshmy O, Chemistry Lab Tutor published a paper entitled, “Iron removal from drinking water system using eco-friendly synthesized MOFs”, in Oriental Journal of Chemistry on April -2024 with ISSN:0970-020.(Scopus database, Q4, ESCI indexed)\nMs. Lekshmy O, Chemistry Lab Tutor published a paper entitled, “Chitosan-based Coating for Corrosion Protection of Copper”, in Futuristic Trends in Chemical, Material Science and NanoTechnology, Vol. 3, Book:1 (pp.251-256), Chapter-16 , 2024, ISBN : 978-93-5747-867-0, IIP series.\nMs. Lekshmy O. Lab Tutor (Chemistry), Department of Science and Humanities published a paper on ” Iron Removal from Drinking Water System using Eco-friendly Synthesized Metal-Organic Frameworks” in Oriental Journal of Chemistry, vol: 40, issue 2, Oriental Scientific Publishing Company, April 2024.\nMs. Lekshmi I, Assistant Professor Department of Science and Humanities participated in one week National Level Online FDP on OBE and Application of Generative AI in Teaching and Research organized by Gauhati University, Assam in association with IPSR Solutions conducted from April 17-24,2024.\nRini Varghese, Steffy Maria Jose,\nLakshmi J S\n, Abraham A, JK Thomas  “Enhanced optical, electrical, dielectric, and photovoltaic properties in strontium titanate by Ce-doping through a modified combustion method” vol. 12, no. 4, pp. 1–11, J. Integr. Sci. Technol.2024.\nRini Varghese, Steffy Maria Jose,\nLakshmi J S\n, JK Thomas ” Investigation of the structural, optical, electrical, and photovoltaic characteristics of nanostructured Ce-doped BaTiO3 by a modified combustion method ” Opt. Quantum Electron., vol. 56, no. 1, pp. 1–26, 2024, doi: 10.1007/s11082-023-05686-9.\nLakshmi JS\n, Rajesh S, Suresh EK, Raimundo RA, Varghese R, Jose SM, et al. Low temperature sintering of Zn 2−xCuxV2O7 (x=0∼2) nanoceramics as an LTCC material, synthesized through combustion route, and a study on the influence of copper in their structural and dielectric behaviour. Ceram. Int., doi: 10.1016/j.ceramint.2023.12.\n118.\nDr\n.\nKrishnamohan G.P\net\nal\npublished “Experimental and Theoretical Investigation of Degradation Activity of Layered Two-Dimensional MoS2-ZnS Nanocomposites in  ECS J. Solid State Sci. Technol., 12, 055004 (2023, SCI indexed).  DOI 10.1149/2162-8777/acd144.\nRenjini M Nair\n, B Bindhu, R S Rimal Isaac; “Boron nitride nanosheets dispersed biopolymer solution as an effective copper corrosion inhibitor in acidic medium”. Polymer Bulletin. (2023).\nhttps://doi.org/10.1007/s00289-023-04673-0 (SCI Indexed/ Scopus indexed) [Impact  Factor 2.87], Springer\nDr. Vidya Vilas\n,\nDr. Archana P. Das\n& Daizy Philip\n, ‘Essential Oil-Mediated Synthesis of Metal and Metal Oxide Nanoparticles’ In: Baskar, C., Ramakrishna, S., Daniela La Rosa, A. (eds) Encyclopedia of Green Materials (2023). Springer, Singapore.\nhttps://doi.org/10.1007/978-981-16-4921-9_3-1\nDr. Veena Nair\npublished a book chapter titled ‘ Task Complexity and Language Proficiency: Its Effect on L2 Writing Production’ in Task-Based Language Teaching and Assessment: Contemporary Reflections from Across the World, Springer Singapore (2022), pp. 139-161. ISBN No. 978\n–\n981\n–\n16\n–\n4225-8.\nDr. Suvith V.S\nFacile synthesis of SnO2/NiO nano-composites: Structural, magnetic and catalytic properties, Ceramics International, 46 (2020), 786–794. Suvith V.S., Devu V.S., Daizy Philip ISSN: 0272-88422.\n2. Tannic acid mediated synthesis of nanostructured NiO and SnO2 for catalytic degradation of methylene blue, Optical and quantum electronics, 52(2020), 12\nSuvith V.S., Devu V.S., Daizy Philip. ISSN: 0306-89193.\nYear: 2020-‘21\nAngel Rose Rajan,\nVidya Vilas\n, Anish Rajan, Annamma John, Daizy Philip (2020). Synthesis of nanostructured CeO2 by chemical and biogenic methods: Optical properties and bioactivity, Ceramics International, Volume 46 (9).\nAngel Rose Rajan,\nVidya\nVilas\n, Anish Rajan, Annamma John, Daizy Philip (2020). Synthesis of CeO2 nanostructures with its exceptional biological and chemocatalytic activities: A comparative study.- Paper accepted in Bulletin of Materials Journal.\nNote:\nDr  Vidya Vilas\nreviewed 4 research publications for AIP Conference Proceedings (iCEE, 2k19, TKM College of Arts and Science). She has been selected as the reviewer of the journal in SN Applied Sciences.\nFUNDED RESEARCH PROJECTS\nKrishna Mohan G P’s project on DJMol – an open source modeling software project with Google cloud resources (one year) has been approved for funding by Google USA.\nGuided a Sc. Chemistry Degree Final Project\non Relativistic effects on atomic radii of elements.\nCo-guided with Dr. V Vinod, MBCET B.Tech Final year Project, ME students, MBCET on\nCarbon dioxide Reduction from The Exhaust Emissions of An IC Engine.\nSEMINARS/CONFERENCES/WORKSHOP/ SYMPOSIA ATTENDED\nDEPARTMENT OF SCIENCE AND HUMANITIES\nMs. Lakshmi J.S, Dr. Renjini Nair and Dr. Preethi P.C. participated in the 6 Day International Faculty Development Program on “Innovation, IP Management & Industry Connect.” organized by the Innovation and Entrepreneurship Development Cell St. Thomas College of Engineering and Technology, Chengannur from 20 to 25 January 2025.\nDr. Veena Nair, Asst. Professor participated in the three day conference ‘EMPOWER-Assistive Technology Conference’ organized by NISH, Thiruvananthapuram (October 17-October 19, 2024).\nMs. Jisha J J and Ms. Uma M, Asst. Professors (S&H) participated in the 5 day online FDP on ‘Algeabraic Structures’ organized by Research Department of Mathematics, Nesamony Memorial Christian college, Marthandam (December 16, 2024 – December 20, 2024)\nMs. Lekshmy O. Lab Tutor (Chemistry), Department of Science and Humanities published  published a book chapter on “Chitosan – based coating for corrosion protection of copper” in Futuristic Trends in Chemical, Material Science and Nano- Technology, vol:3, chapter:16, June 2024.\nDr Renjini M Nair, Asst. Professor attended the Webinar on Cloud & DevOps Opportunities in the AI Era organized by Marian College Kuttikkanam (Autonomous) in association with ipsr solutions limited on 25th May 2024.\nDr Renjini M Nair, Asst. Professor participated in the one day Teachers’ Workshop as part of World Space Week 2024 Celebrations held at Liquid Propulsion Systems Centre (LPSC) and Indian Institute of Space Science & Technology (IIST), Valiamala, Thiruvananthapuram on October 07, 2024.\nDr Suvith V S, Asst. Professor attended the Webinar on Cloud & DevOps Opportunities in the AI Era organized by Marian College Kuttikkanam (Autonomous) in association with ipsr solutions limited on 25th May 2024.\nDr Suvith V S, Asst. Professor participated in the one day Teachers’ Workshop as part of World Space Week 2024 Celebrations held at Liquid Propulsion Systems Centre (LPSC) and Indian Institute of Space Science & Technology (IIST), Valiamala, Thiruvananthapuram on October 07, 2024.\nDr Suvith V S, Asst. Professor attended the International Seminar on Advanced Materials for Sustainable Development and Energy Applications organized by Department of Physics, SRM IST, Ramapuram Campus, Chennai on 09 November 2024.\nMs. Syama S Mohan, Asst. Professor attended a five day national workshop on The power of Math – Interactive Applications in Modern Developments 2024 from 20-07-2024 to 27-07-2024 organized by the Department of Applied Sciences, The Northcap University,Gurugram, Haryana.\nDr. Preethi P C, Asst. Prof. (Dept. of S&H) passed the 15-week NPTEL course  ” Chemistry of Nanomaterials” with a credit of 4, offered by the University of Kerala, Thiruvananthapuram.\nDr Renjini M Nair, Assistant Professor (S & H) participated in the Faculty Development Program from 27-05-2024 to 31-05-2-24 on “R” organized by Saintgits College of Engineering in association with Spoken Tutorial Project, IIT Bombay.\nDr Renjini M Nair has participated in the webinar on “Cloud & DevOps Opportunities in the AI Era” organized by Marian College Kuttikanam (Autonomous) in association with IPSR solutions limited on 25th May 2024\nDr. Archana P.Das, Associate Professor and HoD (Science and Humanities) successfully completed the 12 week NPTEL course ‘Medicinal Chemistry’ sponsored by IISER, Pune and Swayam-NPTEL.\nMs. Lekshmi I, Asst. Prof. (S & H) participated in the one week National Level Online FDP on OBE and Application of Generative AI in Teaching and Research organized by Gauhati University Assam in association with IPSR Solutions conducted from April 17-24,2024.\nDr. Preethi. P. C, Ms. Aparna P. S, Ms. Shijin Shaji and Ms. Dhanya E (Assistant Professors, Department of Science and Humanities) have attended a one week National level Faculty Development Programme on ‘ Outcome Based Education and Application of Generative AI in Teaching and Research’ , organized by the Internal Quality Assurance Cell (IQAC) of Gauhati University, Assam in association with ipsr solutions limited from 17 April 2024 to 24 April 2024 and secured an A grade.\nMs. Shijin Shaji has participated and successfully completed the 5- day online FDP  “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from 1st April to 5th April 2024.\nDr. Preethi. P. C & Ms. Lekshmy. O (S& H) attended a five day FDP on ‘ INNOVATIVE TEACHING AND LEARNING PEDAGOGY’ organized by Research Foundation of India from 20/05/2024 to 24/05/2024.\nDr. Archana P.Das, Associate Prof. & HoD (S & H) attended a five day FDP on Counselling and Academic Mentoring organized by the Human Resource Development Centre (HRDC) of the University from 20/05/2024 to 24/05/24.\nMs. Lekshmi I, Asst. Prof. (Maths), S & H Department,  participated in a ‘Mini-Course on Optimization Theory and Its Applications’ organized by Vietnam Institute for Advanced Study in Mathematics, Hanoi, Vietnam during 18/3/2024 – 21.3.2024.\nDr. Veena Nair participated in  a half day workshop, “Digital Defenders- Strengthening Security Awareness”  at Mar Baselios College of Engineering and Technology  on March 18, 2024  organized by KSAAC. Digital University Kerala.\nDr. Archana P. Das and Dr. Veena Nair participated in an online\nFDP on OBE and Application of Generative AI in Teaching and Research (SPMVV University, Tirupati & IPSR) – 18 Mar 24.\nDr. Veena Nair and Ms. Sanjana D.S. presented a paper titled “Importance of Universal Human Values in Higher Education” at the two day National Conference organized by Mar Ivanios, MBCET and Mar Theophilus College in collaboration with KSHEC, Govt. of  Kerala (14-15 March, 2024)\nMs. Lekshmi I. , Assistant Professor (S &H)\np\nresented a paper entitled\nPresented a paper titled ‘A Fuzzy COPRAS Decision-Making Model to Diagnose Vector-Borne Diseases’ at the Two -Day International Conference on Applied Mathematical Sciences held during December 21-22, 2022 organized by J.J College of Arts and Science, Pudukkottai, Tamil Nadu.\nPresented a paper titled ‘A fuzzy NoVaRM Vaccine Selection Decision making Model for COVID-19-A Case Study in India’ at the International Conference on Recent Trends in Applied Mathematics held during February 24-25, 2023 organized by Loyola College, Chennai.\nPresented a paper titled ‘A Comparative Study Of F- MARCOS and F-COPRAS Methods To Diagnose Vector-Borne Diseases’ at the National Conference on Advances in Graph Theory on March 3, 2023 organized by Malankara Catholic College, Kaliakkavilai, Tamil Nadu.\nPresented a paper titled ‘An Extended Application of Fuzzy COPRAS Decision-Making Model in Medical Diagnosis’ at the National Conference on Applied Mathematics and Numerics held during March 8-10, 2023 Organized by Mar Ivanios College & Indian Institute of Space Science and Technology, Trivandrum.\nA Dam Rehabilitation Model Based on Fuzzy Value Based Ranking Method- A Case Study – Neyyar Gravity Dam, India’ at the International Conference on Recent Trends in Applied Mathematics held during February 22-23, 2024 organized by Loyola College, Chennai.\nParticipated in the International workshop on ‘Advancements in Graph Theory’ organized by Vellore Institute of Technology, Chennai from February1-2, 2024.\nDr. Renjini M Nair has presented a paper entitled “IMPERMEABLE NATURE OF BORON NITRIDE NANOSHEET BASED BIOPOLYMER SOLUTION”  in the international conference on Advanced Materials and Technology(ICAMT 2024) organized by the Department of Physics in association with the IQAC of  NSS college for  Women, Neeramankara, Thiruvananthapuram on 09/03/2024.\nDr. Renjini M Nair, Dr Preethi P C and Ms Syama Mohan from the Dept of Science and Humanities (Mar Baselios College of Engineering and Technology) has successfully participated in the five-day Faculty Development Programme on “Digital Forensics” organized by the Department of Computer Science and Engineering in association with CSI Student Branch, Mar Baselios College of Engineering and Technology, Nalanchira, Thiruvananthapuram from 19-02-2024 to 23-02-2024.\nMs. Sruthi Janardhanan ( Research Scholar, KTU ) has authored and presented her research paper titled ” STRESS-STRENGTH MODEL: RELIABILITY COMPUTATION WITH RANDOM CYCLES, INCREMENTAL STRESS, DECREASING STRENGTH AND EXPONENTIAL STRENGTH VARIABLES” at the International Conference on Applied Mathematics and Nanoscience  (ICAMN- 2024)  held at Vidya Academy of Science and Technology, Thrissur, Kerala during January 23-25 , 2024.\nSABITHA S NAIR\nINTERNATIONAL CONFERENCE ON APPLIED MATHEMATICS AND NANO SCIENCE (ICAMN-2024)\nOrganized by Vidya  Academy of Science and Technology (VAST), Thrissur, Kerala, India in association with Kerala Mathematical Association (KMA) & Centre for Studies in Discrete Mathematics (CSDM) from 23 – 25 January 2024.\nInternational Conference on Semigroups, Algebras, Discrete Structures, and Applications 2024\nICSADA 2024 – INTERNATIONAL CONFERENCE ON SEMIGROUPS, ALGEBRAS, DISCRETE STRUCTURES, AND APPLICATIONS 2024\nOrganized by the department of  Mathematics, Mar Ivanios College (Autonomous) Thiruvananthapuram in association with the Institute of Mathematics Research and Training (IMRT) From 15 -17 February 2024.\nAKHILA MOHAN\nINTERNATIONAL CONFERENCE ON APPLIED MATHEMATICS AND NANO SCIENCE (ICAMN-2024)\nOrganized by Vidya Academy of Science and Technology (VAST), Thrissur, Kerala, India in association with Kerala Mathematical Association (KMA) & Centre for Studies in Discrete Mathematics (CSDM) from 23 – 25 January 2024.\nInternational Conference on Semigroups, Algebras, Discrete Structures, and Applications 2024\nICSADA 2024 – INTERNATIONAL CONFERENCE ON SEMIGROUPS, ALGEBRAS, DISCRETE STRUCTURES, AND APPLICATIONS 2024\nOrganized by the department of  Mathematics, Mar Ivanios College (Autonomous) Thiruvananthapuram in association with the Institute of Mathematics Research and Training (IMRT) From 15 -17 February 2024.\nMs Lakshmi JS\npresented a paper “Synthesis and characterization of Zn_(2-x) Cu_x V_2 O_7  (x=0~2) nanostructured ceramics for LTCC applications” in the International Conference on Nanotechnology and Materials Science at Mar Ivanios College, Thiruvananthapuram on 18 th and 19 th December 2023.\nMs Lakshmi JS\npresented a paper “Structural and electrical studies of CeVO4 nanoceramics for LTCC applications” in the National Conference on Advanced Functional Materials -2023 at VTMNSS College, Dhanuvachapuram on 23 rd and 24 th March 2023.\nMs Lakshmi JS\npresented a paper entitled “Single step combustion, synthesis and characterisation of CeVO4 nanoceramics for LTCC applications” in the International Conference on Materials Science at Bharata Mata College, Thrikkakkara on 9 th and 10 th January 2023.\nDr. Archana P.Das,\nAssistant Professor (S & H) presented a paper ‘Synthesis, characterization and cytotoxicity of some amino derivatives of embelin’ in the two day International Conference on Nanotechnology and Materials Science organized by the PG and Research Department of Chemistry, Mar Ivanios College (Autonomous), Thiruvananthapuram (18-19 December, 2023).\nMs. Syama S. Mohan and Ms. Sruthi Janardhanan\n,  Asst. Professors (S & H) attended a 5-Day Online Workshop on Mathematics for AI Level I:Foundation,held from 20/11/2023 to 25/11/2023 conducted by MERIT in collaboration with Mathlab Research.\nMs. Syama S. Mohan and Ms. Sruti Janardhanan\n, Assistant Professors (S & H) attended a 5-Day Online Hands on Session on Python for AI Level I: Foundation, held from 06/11/2023 to 10/11/2023 conducted by MERIT in collaboration with Mat lab Research.\nDr. Veena Nair\nCoordinated a UHV cell-TLC workshop titled ‘Effective Administrative Governance through behavioural skills (Nov 4, 2023). Resource Person: Dr. Mary Matilda , Former Principal, Maharaja’s College.\nDr. Veena Nair\nParticipated in a 7 day FDP titled ‘Psychological Skills For Teaching & Learning’ (Oct. 10, 2023 – Oct 16,2023) offered by TLC, Ramanujan College, Delhi University\nDr. Veena Nair\nParticipated in a workshop titled “AI-Powered Academic Writing: Exploring Opportunities for Researchers and Educators” organized by Department of Research & Publications, A2Z EduLearningHub LLP on 10th October 2023.\nDr. Veena Nair\nparticipated in the 10-day international online workshop titled “AI for Academics: 75 Essential Tools”  organized by Fatima Mata National College, Assumption College, Bharat Mata College, Rajagiri College of Management and Applied Science and Lore and Ed Research (26 Sep-9 Oct 2023) .\nDr. Renjini M. Nair\n, Asst. Professor, S & H participated and Completed 5-day online Faculty development program on “Inculcating Universal Human Values in Technical Education” organised by AICTE from 29 th May to 2 nd June, 2023.\nMs. Anaswara Johny\nparticipated in “Áwareness and Internal Auditor Training with ISO 9001:2015” (April 25-26, 2023) at MBCET, Thiruvananthapuram.\nDr. Renjini M. Nair\nand\nMs. Anaswara Johny\nparticipated in the 5 day FDP on “ UNIVERSAL HUMAN VALUES” organized by AICTE from (May 29 -June 2, 2023).\nMs. Syama S. Mohan\nparticipated in a one day webinar on “Empowering Excellence Through MATLAB AND SIMULINK” on 4 August 2023 organized by CoreEl Technologies, Bengaluru.\nLakshmi J.S\npresented a paper in the International Conference on Materials Sciences at Bharata Mata College, Thrikkakkara (9 -10 January 2023).\nLakshmi J.S\npresented a paper in the two day National Conference on Advanced Functional Materials-2023 at VTM NSS College, Dhanuvachapuram (23-24  March 2023).\nMs\n.\nAmmu\nMaria\nAshok\npresented at a paper titled ‘A study of adaptation of Mahabharata in English Translation’ at The interdisciplinary international conference on Mahabharata Epic across Asia at The English and Foreign Language University (Central University), Hyderabad.\nMs. Sabitha S. Nair\nMs. Sabitha S Nair participated in a 5 day FDP on discrete mathematics  organized by department of mathematics , School of Advanced sciences, vellore Institute of technology from 13 to 17 th June 2023\nMs. Sabitha S Nair,  has participated in the National Conference on Applied Mathematics and Numerics (NCAMN 2022) held on 8th to 10th March 2023 at Mar Ivanios College, Trivandrum.\nMs. Sabitha S Nair,  has participated and presented a paper\n“On the edge chromatic curling number of graphs\n”\nin the National Conference on Operations research ,Differential Equations , Numerical analysis ,Computing and Applications held from 23rd to 25th March 2023 at Mohandas College of Engineering and Technology, Trivandrum.\nMs. Anaswara Johny, Asst. Professors, Department of Science and Humanities participated in a 5 day FDP on Discrete Mathematics  organized by Department of Mathematics, School of Advanced Sciences, Vellore Institute of Technology from 13 to 17 th June 2023.\nDr. Veena Nair and Dr. Vidya Vilas attended the Southern, South-Central, South Western Regional Conference of UHV Volunteers held from 28\nth\nto 30\nth\nApril, 2022 by AICTE at RV College of Engineering, Bengaluru.\nDr. Veena Nair completed a 5-day online UHV Refresher Part-2 FDP organized by AICTE from 20\nth\nto 25\nth\nJune, 2022.\nDr. Vidya Vilas and Dr. Archana P. Das participated in the International Symposium on Advanced Functional Materials (ISAFM-2022), organized by the Department of Chemistry, Mar Ivanios College (Autonomous) in association with Chemical Research Society of India on 27\nth\nJuly, 2022.\nDr. Vidya Vilas coordinated the 5-day National Level FDP on Universal Human Values-II, sponsored by AICTE, from 29\nth\nAugust to 2\nnd\nSeptember, 2022. More than 70 participants from various states had attended this 5-day residential FDP.\nDr. Vidya Vilas successfully completed a MOOC Course on “Mental Health” from 10\nth\nto 16\nth\nOctober, 2022 with an ‘A’ Grade.\nJisha J.J. presented a paper titled “The Laplacian Energy of Divisor Graphs” at the International Virtual Conference on Progress in Mathematics towards Industrial Applications (PMTIA-2022) held at SRM Institute of Science and Technology on 28\nth\nand 29\nth\nOctober, 2022.\nUma M. presented a paper titled ‘The Laplacian Energy of Cayley Graph’ at the International Virtual Conference on Progress in Mathematics towards Industrial Applications (PMTIA-2022) held at SRM Institute of Science and Technology on 28\nth\nand 29\nth\nOctober, 2022.\nUma M., Asst. Prof. (S & H) presented a paper titled ‘Energy of Cayley Graph’ in the 2nd International Conference on Advanced Information Science and Computing Systems (ICAISCS) organized by the Department of Computer Science and Applications, Christ Nagar College, Maranallor, Trivandrum on 28\nth\nJanuary 2023.\nJisha J.J, Asst. Prof. (S & H) presented a paper titled ‘Energy of Divisor Graph’ in the 2nd International Conference on Advanced Information Science and Computing Systems (ICAISCS) organized by the Department of Computer Science and Applications, Christ Nagar College, Maranallor, Trivandrum on 28\nth\nJanuary 2023.\nAnaswara Johny, Asst. Prof. (S & H) attended a 5-day online Orientation program on Statistical data analysis using R programming (Theory and practice) organized by Centre for Skill Development and Innovative Research from 20\nth\nto 24\nth\nFebruary, 2023.\nSabitha S. Nair and Ms. Syama S. Mohan, attended a three-day online National Conference on Applied Mathematics and Numerics organized by Post Graduate and Research Department of Mathematics Mar Ivanios College (Autonomous) Trivandrum and Department of Mathematics Indian Institute of Space Science and Technology (IIST) Trivandrum from March 8\nth\nto 10\nth\n, 2023.\nAnaswara Johny and Ms. Syama S. Mohan, participated in the National Conference on Operations research, Differential Equations, Numerical analysis, Computing and Applications held from 23rd to 25th March 2023 at Mohandas College of Engineering and Technology, Trivandrum.\nDr, Renjini M. Nair and Ms. Anaswara Johny Participated in the 5 day FDP on “ UNIVERSAL HUMAN VALUES” organized by AICTE from 29\nth\nMay 2023 -2nd June 2023.\nSabitha S. Nair, Asst. Prof. participated and presented a paper on “The Edge Chromatic Curling Number of Graphs ” at the National Conference on Operations research, Differential Equations, Numerical analysis, Computing and Applications held from 23rd to 25th March 2023 at Mohandas College of Engineering and Technology, Trivandrum.\nGeorge Zachariah, NAAC Advisor, addressed the Faculty Team at the Mohandas College of Engineering and Technology, Anad, on 21\nst\nMarch 2023, on the process of NAAC reaccreditation.\nDevika S. Mohan ,S.M. Nair ,T.R. Gireeshkumar ,N.C. Kumar , (2022 ) “Biochemical Composition and Nutraceutical Potential of Knoxia Corymbosa Wild “, International Journal of Advances in Science, Engineering and Technology(IJASEAT) , pp. 30-34, Volume-10, Issue-4.\nMs. Syama S. Mohan Participated in a 3 day National Conference on APPLIED MATHEMATICS AND NUMERICS organized by Post Graduate and Research Department of Mathematics, Mar Ivanios College Trivandrum and Department of Mathematics Indian institute of Space Science and Technology (IIST) Trivandrum from 8th to 10th March 2023.\nMs. Syama S. Mohan  Participated in the 3 day Faculty Development Programme on LINEAR ALGEBRA AND ITS APPLICATIONS organized  by  Department Of Mathematics, LBS  Institute of Technology for Women from 11th to 13th April 2022.\nSruthi Janardhanan Participated in two day seminar on “GRAPH THEORY & ITS APPLICATIONS” organized by the Department of Science and Humanities of MBCET College (Autonomous) on 20\nth\nand 21\nst\nMay 2022.\nMs. Sruthi Janardhanan Participated in the 5 day FDP on “ UNIVERSAL HUMAN VALUES” organized by AICTE from 28\nth\nMarch 2022 -1\nst\nApril 2022.\nThe faculty members of Physics, Chemistry, Mathematics, and English had conducted a Bridge Course for the first year B.Tech. students during the third week of the Student Induction Program from 7\nth\nto 10\nth\nNovember, 2022.\nMolecular Dynamics of Carbon Capture from the Emissions of an IC Engine Using ZSM-5, in ‘Advances in Multidisciplinary Analysis and Optimization – Lecture Notes in Mechanical Engineering’, Springer, Singapore, ISBN 978-981-19-3937-2 (September 2022).\nExploring Potential Energy Surface with Mathematica: An Algorithmic Demonstration of Minimum Energy Path, Stationary Points and Transition State Krishnamohan G. P. , Omar H., Sreeja T. D., Roy K. B., World Journal of Chemical Education. 2022, 10(4), 124-130.\nTheoretical Atomic Radii of Elements (H-Cm): A Non-Relativistic Study with Gaussian Basis Set Using HF, Post-HF and DFT Methods, G. P. Krishnamohan, Sooraj Sunil, Ajith Kumar, Jamesh Joseph, ChemRxiv (2021).\nDJMol: An open-source modeling platform for computational chemistry and materials science with a Python interpreter, G. P. Krishnamohan, R. Sunil, K. Gupta, SC Lee, J. Comput. Chem., 42, 2116 (2021).\nDJMol – A Generic Open source Modeling Platform for Computational Materials Science and Chemistry, published by IKST (Indo-Korea Science and Technology Center, Bangalore), authored by G. P. Krishnamohan, R. Sunil, K. Gupta, S. C. Lee (2020; Printed Book ISBN: 978-9354-071041).\n2021\nFDP ATTENTED\nSl.No.\nName of faculty\nDetails\n1\nSABITHA S NAIR\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022.\n2\nLAKSHMI J S\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022.\n3\nDr ARCHANA P DAS\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from August 16-August 21 , 2021.\n4\nJISHA J J\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022.\n5\nUMA M\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022.\n6\nDr VEENA NAIR\nParticipated and successfully completed  5 days Faculty Development Program- Student Induction on UHV Refresher1 (Part 1)  conducted online during 7-11 February, 2022.\nParticipated and successfully completed  5 days Faculty Development Program- Student Induction on UHV conducted online during 4-8 October, 2021.\nParticipated in the Two Week Online Faculty Development Programme on Continuing Professional Development: Practising,  Researching and Publishing organised by the Department of Humanities and Social Sciences, National  Institute of Technology, Tiruchirappalli from 12- 23July, 2021.\n7\nVINU V\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 28- April 1, 2022.\n8\nDELEESA BABU\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022\n9\nSUVITH V S\nParticipated and completed the One Week (7 Days) online Short-Term Faculty Training Programme (Interdisciplinary) on “DIGITAL CONTENT MANAGEMENT ON E-LEARNING”, organized by Sree Narayana College for Women, Kollam, in academic collaboration with Kerala State Higher Education Council from June 13th to June 19th of 2021.\n10\nSRUTHI JANARDHANAN\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 28- April 1, 2022.\n11\nANISH M.S.\nFive Days Online Faculty Development Programme(FDP) on “Effective Teaching and Learning through Moodle” organized by Sree Narayana College, Kollam in academic collaboration with Kerala State Higher Education Council, from 31/05/2021 to 04/06/2021.\nThree days KTU – sponsored online Faculty Development Program on “Mathematical Foundations for Artificial Intelligence and Machine Learning”, conducted by Muthoot Institute of Technology and Science, Kochi from 23/06/2021 to 25/06/2021.\nFifteen Days KTU – sponsored Faculty Development Program(FDP) on “Mathematics for Machine Learning” organized by College of Engineering, Trivandrum from 30/06/2021 to 16/07/2021.\nThree days KTU – sponsored Faculty Development Program(FDP) on “Cyber Security and Forensics” jointly organized by ACM Kottayam Chapter and CCE, Amal Jyothi College of Engineering, Kanjirapally from 01/09/2021 to 03/09/2021.\nThree days KTU – sponsored Faculty Development Program on “Mentoring and Thinking Skills for Engineering Faculty”, organized by Department of Computer Applications, Amal Jyothi College of Engineering, Kanjirapally from 01/09/2021 to 03/09/2021\n12\nSALINI K S\nParticipated and successfully completed the 5-day online  FDP on the theme “Inculcating Universal Human Values in Technical Education” organized by All India Council for Technical Education(AICTE) from March 14-March 18 , 2022\n13\nANASWARA JOHNY\nNational FDP on “Teaching – Competencies for Self –  Directed Learning”, conducted by Internal Quality Assurance Cell (IQAC), Mar Baselios Institute of Technology & Science Kothamangalam from 28\nth\nto 30\nth\nJuly 2021.\n“Ethics in Profession and Student Psychology” conducted by SNGCE, Department of Electrical and Electronics Engineering from 19\nth\nto 24\nth\nJuly 2021.\nCONFERENCES/SEMINARS/WORKSHOPS ATTENDED\nSl.No.\nName of faculty\nDetails\n1\nSABITHA S NAIR\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\n2\nLAKSHMI J S\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\nParticipated in 5-day workshop on ‘Academic Writing’ from November 1-November 6, 2021.\n3\nDr ARCHANA P DAS\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\nParticipated in the 5-day online workshop on “Academic Writing” organized by the Department of Science and Humanities, MBCET, Thiruvananthapuram, 1-6 November, 2021.\n4\nJISHA J J\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\nParticipated in the International Webinar on Applied Mathematics organized by the PG & Research Department of Mathematics, Thiagarajar College, Madurai on 19-20 April, 2022.\nParticipated in the Three Days International Level Workshop on Research Methodology Paradigms -SPECTRUM 2022 organized by the Research & Development Cell, St. Francis College,during 11- 13April 2022.\n5\nUMA M\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\n6\nDr KRISHNA MOHAN G P\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\n7\nDr VEENA NAIR\nParticipated in the UHV Regional Conference organized by AICTE at RV College of Engineering, Bengaluru from 28\nth\nto 30\nth\nApril, 2022.\nParticipated in the UHV Regional Conference organized by AICTE at RV College of Engineering, Bengaluru from 28\nth\nto 30\nth\nApril, 2022\nParticipated in the\nTwo Week Online Faculty Development Programme on Continuing Professional Development: Practising,  Researching and Publishing\norganised by the Department of Humanities and Social Sciences, National  Institute of Technology, Tiruchirappalli from 12 to 23 July, 2021.\n8\nDr VIDYA VILAS\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\nParticipated in the UHV Regional Conference organized by AICTE at RV College of Engineering, Bengaluru from 28\nth\nto 30\nth\nApril, 2022\n9\nSUVITH V S\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\n10\nSRUTHI JANARDHANAN\nParticipated in two day seminar on Graph theory and its applications in Engineering from May 20-May 21,2022\n11\nANASWARA JOHNY\nParticipated in Two-day National Webinar on “Linear Algebra and its Applications”, organized by the Department of Science and Humanities, FISAT on 19\nth\nand 20\nth\nNovember, 2021.\nLIST OF R&D PROJECTS, SANCTIONED AMOUNTS AND THE PERIOD\nIN HOUSE R&D PROJECT 2021-22\nSl.No.\nName of faculty\nTitle\nSanctioned amount\n1\nDR VIDYA VILAS,\nDR ARCHANA P. DAS\nPhytosynthesis of  Bioactive Metal-Metal oxide Nanocatalysts using Essential Oil of\nCymbopogon citratus\n(Lemongrass)\nRs. 100000/-\n2.\nDr. Veena Nair\nTask Complexity in Second Language Writing: An analysis using Natural Language Processing Techniques\nRs. 20,000/-\nDr. Krishna Mohan G.P. is consultant of an ongoing project for Indo-Korea Science and Technology center, Bangalore.\nLIST OF OUTREACH ACTIVITIES OF THE FACULTY\nAnish M.S\nHandled a series of classes on “Application of Vector Calculus, Transforms and Differential Equations in Engineering” for the S2 BTech students at College of Engineering Kallooppara, during the period 03/08/2022 to 12/08/2022.\nProf. Joseph Cheriyan\nInvited talk on “Applications of Linear Algebra”, Devaswom Board College, Sasthankotta.\nKeynote address, LBS Institute of Technology for Women, Poojappura, Thiruvananthapuram, April 11, 2022.\nKrishna Mohan G.P\nInvited talk on “Basics of Molecular Modeling” in Govt. Engineering College, Barton Hill, Thiruvananthapuram on May 16, 2022.\nAnish M. S.\nResource person at College of Engineering, Kalloopara during 16/03/2022 to 22/03/2022 for First year Induction Program-“Easy way to learn CALCULUS- An exam oriented approach” organized by Department of Basic Science, College of Engineering, Kalloopara.\nInvited talk at Amal Jyothi College of Engineering, Kottayam, on 21/06/2021. Handled a forenoon session (2 hours) to provide Motivation and Academic guidance to KEAM & NEET Entrance aspirants who are attending Entrance crash course         conducted by SMYM Diocese of Kanjirapally. Topic: “Tips and Tricks to crack          competitive examinations”\nInvited talk at Amal Jyothi College of Engineering, Kottayam, on 15/07/2021. Handled an afternoon session (2 hours) to provide motivation and academic guidance to KEAM Entrance aspirants who are attending Entrance crash course conducted by SMYM Diocese of Kanjirapally.\nTopic: “Last minute preparations for competitive examinations “\nLIST OF JOURNAL PUBLICATIONS\nSl.No.\nName of faculty\nDetails\n1\nDR KRISHNA MOHAN G P\nG. P. Krishnamohan, R. Sunil, K. Gupta, SC Lee, DJMol: An open-source modeling platform for computational chemistry and materials science with a Python interpreter, J. Comput. Chem., 42, 2116 (2021).\nG. P. Krishnamohan, J. H. Omar,T. R Sreeja,  K. B. Roy, S. Sunil, Exploring potential energy surfaces with Mathematica, World Journal of Chemical Education, (UGC-care listed journal-2022-accepted).\n2\nDR VEENA NAIR\nPublished a book chapter titled ‘ Task Complexity and Language Proficiency: Its Effect on L2 Writing Production’  in Task-Based Language Teaching and Assessment: Contemporary Reflections from Across the World, Springer Singapore, pp. 139-161. ISBN No. 978\n–\n981\n–\n16\n–\n4225-8, 2022.\n3\nDR VIDYA VILAS\nAngel Rose Rajan,\nVidya Vilas\n, Anish Rajan, Annamma John and Daizy Philip, Synthesis of CeO2 nanostructures with its exceptional biological and chemocatalytic activities: A comparative study,\nBulletin of Materials Science, 44:16\n(2021) 1-10.\nLIST OF CONFERENCE PUBLICATIONS\nSl.No.\nName of faculty\nDetails\n1\nDR KRISHNA MOHAN G P\nDeepak L, Ganesh A, Dit R.S., Sreehari S.H., Vinod V., Krishnamohan G.P.,\nMolecular Dynamics of carbon capture from the emissions of an IC engine using ZSM-5\n., 4th National conference on Multidisciplinary Design, Analysis and Optimization-IISC Bangalore, 2022 (January).\nDr. Krishna Mohan G.P. won Vakkom Maoulavi Foundation Merit Award (2022) for developing Open source academic software for education and research.\n2022\nMs. Sabitha Nair\nCoordinated a two day (May 20-21, 2022) seminar on the topic  “Graph Theory and its Applications in Engineering”.\nDr. Archana P. Das\nparticipated in the International Symposium on Advanced Functional Materials (ISAFM-2022) organized by the Department of Chemistry, Mar Ivanios College (Autonomous) in association with Chemical Research Society of India.\nparticipated in “Orientation program on AICTE Technical book translation” organised by Kerala University of Digital Sciences, Innovation and Technology in association with AICTE, Sept 15,2022\nparticipated in KTU sponsored 3 day FDP on orientation for NSS program officers organised by MBCET, Thiruvananthapuram from 10-12 Aug 2022.\nMs\n.\nSruti Janardhanan\nvolunteered in the AICTE sponsored UHV Introductory FDP held from August 29- September 2, 2022 at MBCET, Thiruvananthapuram.\nDr. Veena Nair\nvolunteered in the AICTE sponsored UHV Introductory FDP held from August 29- September 2, 2022 at MBCET, Thiruvananthapuram.\nparticipated in 1st Southern, South-Central, South-Western Region Conference of UHV Volunteers between 28th to 30th April 2022 by AICTE at RV College of Engineering, Bengaluru, Karnataka, India\nparticipated in the online workshop on ‘Neuroscience in Education’ organized by Centre of Professional Education, Navrachana University, Vadodara held on August 27, 2022.\nparticipated in the 6 days – UHV-II FDP conducted online during 20 Jun – 25 Jun, 2022.\nDr. Vidya Vilas\nCoordinated the AICTE sponsored UHV Introductory FDP held from August 29- September 2, 2022 at MBCET, Thiruvananthapuram.\nparticipated in the International Symposium on Advanced Functional Materials (ISAFM-2022) organized by the Department of Chemistry, Mar Ivanios College (Autonomous) in association with Chemical Research Society of India\nparticipated in 1st Southern, South-Central, South-Western Region Conference of UHV Volunteers between 28th to 30th April 2022 by AICTE at RV College of Engineering, Bengaluru, Karnataka, India\nMr. Anish M.S\nResource Person for a series of lectures on “Application of Vector Calculus, Transforms and Differential Equations in Engineering” at College of Engineering, Kalooppara, Thiruvalla for B.Tech first year students from August 8-August 12, 2022.\nDr.  Krishnamohan G.P.\nKrishna Mohan has published a conference proceeding paper entitled, “\nMolecular Dynamics of Carbon Capture from the Emissions of an IC Engine Using ZSM-5\n” in ‘Advances in Multidisciplinary Analysis and Optimization – Lecture Notes in Mechanical Engineering’, Springer, Singapore, ISBN 978-981-19-3937-2 (September 2022).\nPublished an article entitled, “Exploring Potential Energy Surface with Mathematica: An Algorithmic Demonstration of Minimum Energy Path, Stationary Points and Transition State”, in World Journal of Chemical Education, 2022, September, Vol. 10, No. 4, 124-130.\nDepartment of Electronics of Barton Hill Engineering college, Thiruvananthapuram selected Dr Krishna Mohan as a resource person under, Technical Education Quality Improvement Programme (TEQIP Phase II) on the topic: Application of Density Functional methods on modeling of nano-electronics materials.\nDr. Vidya Vilas\nParticipated in the International Conference on Recent Advances in Material Science (ICRAMS 2020) organized by Research Committee and Post graduate and Research Departments of Physics and Chemistry, Mahatma Gandhi College, Thiruvananthapuram (MGC ARC), Mahatma Gandhi College, Thiruvananthapuram, Kerala from 22-23 January 2020.\nParticipated in Learn Moodle Basics organized by Moodle HQ in April 2020.\nParticipated in Online Learning Workshop for Faculty organized by Qaspir from April 1-3, 2020.\nParticipated in Part 1:Online Learning Workshop for Faculty organized by Qaspir from April 15-17, 2020.\nParticipated in Part 2: Online Learning Workshop for Faculty organized by Qaspir from April 22-24, 2020.\nParticipated in Online Learning and Content Development organized by FLAIR Kerala, Directorate of Collegiate Education, Kerala from April 18-2 May 2020.\nParticipated in Make and Edit Video Classes organized by Internal Quality Assurance Cell of Christ College from May 1- May 5, 2020.\nParticipated in Part 3: Online Learning Workshop for Faculty organized by Qaspir on May 8, 2020.\nParticipated in Effective ways for reaching Millenium Learners organized by Department of Chemistry, Morning Star Home Science College, Angamaly, Kerala on 10 May 2020.\nParticipated in New Age Teaching Technologies organized by St’ Aloysius Institute of Technology, Jabalpur, India from May 12-18, 2020.\nParticipated in Part 4: Online Learning Workshop for Faculty organized by Qaspir from May 13-15, 2020.\nParticipated in Smart Materials and Coatings organized by Department of Chemistry and Centre for Research, St’ Teresa’s College (Autonomous), Ernakulam, Kochi on May 21, 2020.\nParticipated in Materials Science: Webinar Series – 1 organized by Centre for Nanoscience and Nanotechnology (CNSNT), Sathyabhama Institute of Science and Technology (Deemed to be University) from May 18-23, 2020.\nParticipated in Virtual Learning Environment organized by APA College of Arts and Culture, Palani and Unnat Bharat Abhiyan(C-36569) from May 18-24, 2020.\nParticipated in Creative Adaptation – Reaching out through digital classrooms organized by St’ Thomas College of Teacher Education, Pala in collaboration with the UGC-HRDC, University of Kerala, Thiruvananthapuram, from May 19-25, 2020.\nParticipated in Innovative teaching strategies for intellectually diverse students organized by Department of Home Science and Centre for Research, St’ Teresa’s College (Autonomous), Ernakulam, conducted on 27th May, 2020\nParticipated in Blended Learning organized by Albertian Institute of Management in association with ICT Academy of Kerala and Albertian Centre for Human Resource Development and Research, St’ Albert’s College (Autonomous) on 28th May, 2020.\nParticipated in Faculty Development Programme on Google Apps organized by Department of Science and IQAC, Christ College of Science and Management, Malur, Karnataka from 29-30 May, 2020.\nParticipated in Student and teacher relations: An Online Paradigm organized by APA College of Arts and Culture, Palani and Unnat Bharat Abhiyan(C-36569) on 05th June, 2020\nParticipated in Orientation/Induction programme for faculties in Universities/colleges/institutes of higher education organized by Teaching Learning Centre, Ramanujan College, University of Delhi from June 4-July 1, 2020.\nParticipated in FDP on Advanced Concepts for developing MOOCs organized by Teaching Learning Centre, Ramanujan College, University of Delhi from 02\nnd\nJuly – 17\nth\nJuly, 2020.\nParticipated in Positive Youth Development organized by Centre of Youth Welfare and Empowerment and Directorate of Distance Education, Alagappa University, Karaikkudi on July 3, 2020.\nParticipated in Webinar on Classroom Management Tools organized by Dept. of Commerce, SCMS School of Technology and Management, Muttom, Aluva on 23 July 2020.\nParticipated in A Paradigm Shift to Digital Era: Equipping Teachers for Virtual Classrooms organized by BNV College of Teacher Education from 24-25 July 2020.\nParticipated in FDP on Managing Online Classes and Co creating MOOCs 3.0 organized by Teaching Learning Centre, Ramanujan College, University of Delhi from 25\nth\nJuly – 10\nth\nAugust, 2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Webinar on National Education Policy, 2020 – Reforming and Rejuvenating teaching and learning in HE Institution for the 21\nst\nCentury organized by IQAC, Nirmala College, Muvattupuzha, Kerala on August 8, 2020.\nParticipated in National Education Policy Autonomy Status: Challenges and Opportunities organized by Rani Parvati Devi College of Arts and Commerce, Belagavi, Karnataka on August 8, 2020.\nParticipated in FDP (Interdisciplinary) on Towards a Digital Era of Teaching and Learning organized by UGC-HRDC, University of Kerala in collaboration with KSMDB College, Sasthamcotta from August 12-18, 2020.\nParticipated in Online Learning Leadership (Digital Leader) organized by Qaspir.\nParticipated in FDP on ICT Tools in teaching Chemistry organized by Teresian Teaching Learning Centre and Department of Chemistry and Centre for Research from September 2- 6, 2020.\nParticipated in Webinar on National Education Policy, 2020 organized by Research and Extension Committee of Department of Education, Aligarh Muslim University Centre, Malappuram from September 9-10, 2020.\nParticipated in Use of ICT in Teaching and Learning Practical of Chemistry, Issues and Challenges organized by Department of Chemistry and IQAC, L.V.H. College, Panchavati, Nashik on September 15, 2020.\nDr. Archana P. Das\nParticipated in Online Faculty Development Program on “Role of Chemistry in COVID-19” organized by Department of Chemistry, School of Basic Sciences, Vels Institute of Science, Technology and  Advanced Studies (VISTAS) on May 13, 2020.\nParticipated in VIRTUOSA 2020, National Webinar Series organized by KSMDB College, Sasthamcotta, Kerala from May 14-20, 2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nMs. Jisha J.J.\nParticipated in Berchmans Webinar Series In Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11, 2020.\nParticipated in Faculty Development Programme on Outcome Based Education in Higher Education Sector organized by Mar Baselios Institute of Technology & Science& Amal Jyothi College of Engineering from July 23-25,2020.\nParticipated in International webinar on Statistics organized by Carmel College, Mala from July 27-28,2020.\nParticipated in Three-Day International Conference on Productive Mathematical Discourse organized by Christ Nagar College, Maranalloor, Thiruvananthapuram from August 3-5, 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modeling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6-7, 2020.\nParticipated in FDP on Mathematics for Engineering Research organized by Sree Buddha College of Engineering,Pattoor, Alappuzha from August 10-14, 2020.\nParticipated in Two-Day National Level E-Workshop On Performing Statistical Data Analysis Using Ms Excel organized by Dr. M.G.R\nEducational And Research Institute, Adayalampattu Phase -II Campus from August 18-19, 2020.\nParticipated in National Webinar on ‘The Curious Case of Cyber Security’ organized by St. Aloysius College, Edathua on August 22, 2020.\nParticipated in National Webinar on ‘Modelling the Invisible Mathematics‘ organized by St. Aloysius College, Edathua on August 25, 2020.\nParticipated in National Level Webinar On “I-STEM: A Gateway For Researchers Stepping Towards AatmNirbhar Bharat organized by Dr. M.G.R Educational And Research Institute, Adayalampattu Phase -II Campus on August 25, 2020.\nMs. Uma. M.\nParticipated in National webinar on technology adoption in mathematics class room organized by Alagappa University on July 8, 2020.\nParticipated in Berchmans Webinar Series In Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11, 2020.\nParticipated in Faculty Development Programme on Outcome Based Education in Higher Education Sector organized by Mar Baselios Institute of Technology & Science& Amal Jyothi College of Engineering from July 23-25,2020.\nParticipated in International webinar on Statistics organized by Carmel College, Mala from July 27-28,2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Three-Day International Conference on Productive Mathematical Discourse organized by Christ Nagar College, Maranalloor, Thiruvananthapuram from August 3-5, 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modeling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6-7, 2020.\nParticipated in FDP on Mathematics for Engineering Research organized by Sree Buddha College of Engineering, Pattoor, Alappuzha from August 10-14, 2020.\nParticipated in Two-Day National Level E-Workshop On Performing Statistical Data Analysis Using Ms Excel organized by Dr. M.G.R\nEducational And Research Institute, Adayalampattu Phase -II Campus from August 18-19, 2020.\nParticipated in National Webinar on ‘The Curious Case of Cyber Security’ organized by St. Aloysius College, Edathua on August 22, 2020.\nParticipated in National Webinar on Modelling the Invisible Mathematics organized by St. Aloysius College, Edathua on August 25, 2020.\nDr. Savitha MT\nParticipated in National webinar on technology adoption in mathematics class room organized by Alagappa University on July 8, 2020.\nParticipated in Berchmans Webinar Series In Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11, 2020.\nParticipated in Faculty Development Programme on Outcome Based Education in Higher Education Sector organized by Mar Baselios Institute of Technology & Science& Amal Jyothi College of Engineering from July 23-25,2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Three-Day International Conference on Productive Mathematical Discourse organized by Christ Nagar College, Maranalloor, Thiruvananthapuram from August 3-5, 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modeling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6-7, 2020.\nParticipated in FDP on Mathematics for Engineering Research organized by Sree Buddha College of Engineering, Pattoor, Alappuzha from August 10-14, 2020.\nParticipated in National Webinar on Modelling the Invisible Mathematics organized by St. Aloysius College, Edathua on August 25, 2020.\nParticipated in FDP on ICT Tools for Teaching Learning Process- Post Pandemic Educational Strategies ” organized by Department of Physics and IQAC Sree Narayana College Kollam in collaboration with The Kerala State Higher Education Council from August 17-23, 2020.\nMs. Lekshmi I.\nParticipated in National webinar on technology adoption in mathematics class room organized by Alagappa University on July 8, 2020.\nParticipated in Berchmans Webinar Series In Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11, 2020.\nParticipated in Faculty Development Programme on Outcome Based Education in Higher Education Sector organized by Mar Baselios Institute of Technology & Science& Amal Jyothi College of Engineering from July 23-25,2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in National Webinar on’ Fuzzy Modelling and Decision Making Applications’ organized by ISTE, Saintgits College of Engineering on August 1, 2020.\nParticipated in Webinar on ‘Recent Trends in Fuzzy Modeling Applications and Recent Trends in the Real World’ organized by Institute of Technical and Scientific Research on August 2, 2020.\nParticipated in Three-Day International Conference on Productive Mathematical Discourse organized by Christ Nagar College, Maranalloor, Thiruvananthapuram from August 3-5, 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modeling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6-7, 2020.\nParticipated in International Conference on ‘Graph Connections’ organized by Bishop Chulaparambil Memorial College in association with MG University, Kottayam from August 6-8, 2020.\nParticipated in FDP on Mathematics for Engineering Research organized by Sree Buddha College of Engineering, Pattoor, Alappuzha from August 10-14, 2020.\nParticipated in FDP on ‘ Application & Implements of Mathematics’ organized by Hindusthan College of Engineering and Technology, Coimbatore from August 17-23, 2020.\nParticipated in National Level Webinar On “I-STEM: A Gateway For Researchers Stepping Towards AatmNirbhar Bharat organized by Dr. M.G.R Educational And Research Institute, Adayalampattu Phase -II Campus on August 25, 2020.\nDr. Dhanya Ramachandran\nParticipated in National webinar on technology adoption in mathematics class room organized by Alagappa University on July 8, 2020.\nParticipated in Berchmans Webinar Series In Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11, 2020.\nParticipated in the Webinar on “Evading Social Engineering Attacks: COVID’19 ” organized by NetSec Research Group, Department of Computer Science and Engineering ,Mar Baselios College of Engineering and Technology on July 21, 2020.\nParticipated in Faculty Development Programme on Outcome Based Education in Higher Education Sector organized by Mar Baselios Institute of Technology & Science& Amal Jyothi College of Engineering from July 23-25,2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Webinar on ‘Recent Trends in Fuzzy Modeling Applications and Recent Trends in the Real World’ organized by Institute of Technical and Scientific Research on August 2, 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modeling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6-7, 2020.\nParticipated in International Conference on ‘Graph Connections’ organized by Bishop Chulaparambil Memorial College in association with MG University, Kottayam from August 6-8, 2020.\nParticipated in FDP on Mathematics for Engineering Research organized by Sree Buddha College of Engineering,Pattoor, Alappuzha from August 10-14, 2020.\nParticipated in National Webinar on ‘Modelling the Invisible Mathematics‘ organized by St. Aloysius College, Edathua on August 25, 2020.\nDr. Neeradha C.K\nParticipated in Berchmans Webinar Series In Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11, 2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Three-Day International Conference on Productive Mathematical Discourse organized by Christ Nagar College, Maranalloor, Thiruvananthapuram from August 3-5, 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modeling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6-7, 2020.\nMs. Lakshmi J.S\nParticipated in Talk on Recent trends in Raman spectroscopy organized by Department of Physics, University of Kerala on July 15, 2020.\nParticipated in Webinar on “Evading Social Engineering Attacks: COVID’19 ” organized by NetSec Research Group, Department of Computer Science and Engineering, Mar Baselios College of Engineering and Technology on July 21, 2020.\nParticipated in International webinar-CROSSROADS 2020 organized by PG and Research Department of Physics, SN College, Kollam on 22 July 2020\nParticipated in Webinar on Astronomy and Astrophysics organized by Department of Physics, Mar Ivanios College on 25 July 2020.\nParticipated in FDP on Outcome Based Education in Higher Education Sector organized by MBITS & AJCE from 23-25 August 2020.\nParticipated in Lecture on Emerging Solar Cell Technologies organized by Bishop Moore College on July 28, 2020.\nParticipated in Effective Online Teaching Tools organized by TLC and Dept of Civil Engineering, Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Short term FDP on “Pedagogical And E-Learning Tools For Teaching organized by SD College & The Kerala State Higher Education Council from 4-10 August 2020\nParticipated in National Webinar on Next Generation Challenges in Astro technology organized by Department of Basic Sciences and Humanities, RSET on August 12, 2020.\nParticipated in National Webinar on “Silicon to Systems – How the world has transformed after the transistor” jointly organized by Department of Physics and Internal Quality Assurance Cell of All Saints’ College on August 15,2020.\nParticipated in FDP (Interdisciplinary) on Towards a Digital Era of Teaching and Learning organized by UGC-HRDC, University of Kerala in collaboration with KSMDB College, Sasthamcotta from August 12-18, 2020.\nParticipated in FDP on “How to write a research paper/Book chapter for Scopus Publication organized by Department of management Studies, New Horizon College of Engineering on September 4, 2020.\nDr. Veena Nair\nParticipated in webinar on Applying CEFR to your curriculum organized by Cambridge Assessment English on December 11, 2019.\nParticipated in Online Learning Workshop for Faculty organized by QASPIR and CPD from April 1-3, 2020.\nParticipated in webinar on Managing interaction and feedback in the virtual classroom organized by Cambridge Assessment English on April 23, 2020.\nParticipated in webinar on Strategies For Academic Publications organized by Internal Quality Assurance Cell (IQAC) & IETE Student’s Forum  of  Sree Ayyappa College, Chengannur, Kerala on May 20, 2020.\nParticipated in webinar on Future learners need learning strategies organized by Cambridge Online Experience Asia on May 20, 2020.\nParticipated in webinar on Prospects Of Intellectual Property Rights organized by Internal Quality Assurance Cell (IQAC) & IETE Student’s Forum  of  Sree Ayyappa College, Chengannur, Kerala on May 22, 2020.\nParticipated in webinar on The New Normal in Education organized by Internal Quality Assurance Cell, St. Albert’s College (Autonomous) on May 23, 2020.\nParticipated in FDP on Curriculum Development organized by Children’s University, Gandhinagar and MHRD, Savitra Bai Phule University, Pune from 19 May-26 May\nParticipated in webinar on Teaching Live English Lessons Online organized by British Council on May 25, 2020.\nParticipated in webinar on Innovative Teaching Strategies for Intellectually Diverse Students organized by Teresa’s College Ernakulam on May 27, 2020.\nParticipated in webinar on Assessing Speaking Online organized by Cambridge Assessment English on May 28, 2020.\nParticipated in webinar on Writing at C1 and C2 organized by Cambridge Online Experience Asia on June 5, 2020.\nParticipated in webinar on Listening at C1 and C2 organized by Cambridge Assessment English on June 7, 2020.\nParticipated in webinar on Speaking at C1 and C2 organized by Cambridge Assessment English on 19 June 2020\nParticipated in webinar on Introducing new online self-access materials for B2 First for Schools and C1 Advanced learners organized by Cambridge Assessment English on 25 June 2020\nParticipated in webinar on Attentive and Focused Listening: Some Strategies organized by ELTAI, India on June 28, 2020.\nParticipated in webinar on Communicative English skills for Engineering Students and Faculty organized by MBITS in association with ASAP, Govt. of Kerala and TCS from June 28-30, 2020.\nParticipated in webinar on FDP on Effective and Efficient Online Teaching and Content Development  organized by Audyogik Tantra Shikshan Sansthas, Institute of Industrial and Computer Management and Research, Pune, Maharashtra from July 8-9, 2020.\nParticipated in webinar on Teaching Language and Literature: Need for Meaningful Integration organized by ELTAI, India on July 12, 2020.\nParticipated in International Digital Conclave on Innovations in Teaching-Learning: A global perspective organized by Marian College Kuttikkanam & Amal Jyothi College of Engineering from 14-16 July 2020\nParticipated in FDP on “Outcome Based Education in Higher Education Sector” organized by MBITS, Kothamangalam from 23-25 July 2020\nParticipated in webinar on E-Readiness by Educational Institutions during Covid-19 organized by RSET on July 21, 2020.\nParticipated in One Day National Workshop on “The Importance of ICT and its tools”  organized by Saradha Gangadharan College, Puducherry on 23rd July 2020\nParticipated in webinar on Online workshop on EFFECTIVE ONLINE TEACHING TOOLS  organized by Teaching and Learning Centre and Department of Civil Engineering Mar Baselios College of Engineering and Technology from 29-31 July, 2020.\nParticipated in Catalyst Chats organized by MBCET from August 3-7 2020.\nParticipated in webinar on Multiple Techniques for Learning English as a Second Language organized by ELTAI, India on August 9, 2020.\nParticipated in Short term Faculty Development Programme (Interdisciplinary) on “Towards a Digital Era of Teaching and Learning”   organized by UGC-HRDC, University of Kerala, Thiruvananthapuram in collaboration with KSMDB College, Sasthamcotta from August 12-18, 2020\nParticipated in International Webinar on ” Second Language Acquisition Research and Insights for Effective English Language Teaching” on August 13, 2020.\nParticipated in FDP on E-contents and ICT tools for innovative and Effective Teaching and Learning Process organized by Roorkee College of Management and Computer Applications, Roorkee, Uttarakhand from August 8-14, 2020.\nMs. Sabitha Nair\nParticipated in Spectral Graph Theory-  Research Oriented Lecture Series organized by Mar Thoma College, Thiruvalla on October 5, 2020\nParticipated in Rayleigh Quotient and Some characterisations- Research Oriented Lecture Series organized by Mar Thoma College, Thiruvalla on October 17, 2020.\nParticipated in National webinar on “Graph theory & problem-solving using sage math” organized by SD College, Alapuzzha from November 4- 6, 2020.\nParticipated in National webinar on “Graph theory & problem-solving using sage math” organized by SD College, Alapuzzha from November 4- 6, 2020.\nParticipated in international webinar-Security In Cyberspace organized by MBITS from November 9-11, 2020.\nPUBLICATIONS\nDhanya Ramachandran published a paper titled ‘Inverse Quartic Spline Interpolation Using Polynomial Iteration Method’ in International Review of Pure and Applied Mathematics, Vol. 14, Number 2, July- December 2018.\nNeeradha.C.K ( June,2018) . Linear Mappings on Strongly Magic Squares. Proceedings of the  International Conference on Mathematics.\nNeeradha.C.K , Dr. V. Madhukar Mallayya. (January, 2018). Eigen Values of 4×4 Strongly Magic Squares. Proceedings of the  National Conference on Algebra, Analysis and Applications\nNeeradha. C. K.(2018). Linear Mappings on Strongly Magic Squares. Mathematical Sciences International Journal, Spl Issue, Vol 7,pp 34-38, ISSN 2278-8697\nNeeradha.C.K, Dr T.R. Sivakumar and Dr.V.Madhukar Mallayya. (2017, February). Linear Transformation On Strongly Magic Squares. American Journal Of Mathematics and Statistics, Vol 11(2).DOI: 10.5923/j.ajms.20170703.03\nNeeradha.C.K , Dr.V. Madhukar Mallayya. (2017). Dot Products and Matrix Properties of 4×4 Strongly Magic Squares. International Journal Of Theoretical and Applied Mathematics, 3(2), 54-59.doi: 10.11648/j.ijtam.20170302.11\nNeeradha. C. K., Dr.T.R Sivakumar and Dr.V.Madhukar Mallayya. (2017). Ring Morphisms on Strongly Magic Squares. European Journal of Basic And Applied Sciences, 4(1), 29-35.ISSN 2059-3058\nNeeradha.C.K , Dr. V. Madhukar Mallayya. (2017). Group Isomorphisms On Strongly Magic Squares. Journal Of Scientific Research in Physical and Mathematical Sciences, 4(2), 1-7.ISSN: 2349-7149\nVeena Nair (2018). Published a paper, “Role of pre-tasks in Second Language Writing”, BELTA Journal, Vol. 2, Issue 1.\nSavitha M.T., Dr. Mary George,, “Ranking of Fuzzy numbers based on Value”, ‘Bulletin of Kerala Mathematical Association’, ISSN: 0973-2721, Vol. -15,No.2 (Dec- 2017), 291-300.\nSavitha M.T., Dr. Mary George, “Multi Criteria Decision Making Model Based on the value of Fuzzy Numbers-Multiple Decision  Makers”, ‘Indian Journal of Applied Research”, ISSN:2249-555X, August-2017\nSabitha Nair. Published a paper titled “Galois Group of the Cyclotomic Extension of Q” in the conference proceedings of National Conference on Mathematical Methods for Engineering Applications (NACMMEA-17) July 2017.\nSavitha M.T., Dr. Mary George, “A New Decision Model Based on the Value of Fuzzy Numbers” , ‘Journal of Natural Sciences and Mathematics’ Kingdom of Saudi Arabia,  Ministry of Higher Education,  Qassim University, ISSN: 1658-4031, Volume 10.2, 2017\nSavitha M.T., Dr. Mary George, “A New Ranking Method Based on Arithmetic Mean operation of Fuzzy Numbers”, ‘Indian Journal of Mathematics and Mathematical Sciences’, ISSN : 0973-3329,  June- 2017.\nSavitha M.T., Dr. Mary George, “Performance Evaluation using Extent Fuzzy AHP and Fuzzy Rule Based System” ,‘Bulletin of Kerala Mathematical Association’, ISSN: 0973-2721, June- 2017.\nSavitha M.T., Dr. Mary George, “Multi Criteria Decision Making Model”, ‘International Journal of Advanced Technology in Engineering and Science (IJATES)’, ISSN: 2348-7550, Volume 5.4, April 2017.\nSavitha M.T., Dr. Mary George, “New Methods for Ranking of Trapezoidal Fuzzy Numbers”, ‘Advances in Fuzzy Mathematics”, ISSN: 0973-533X ,Vol.- 12, Number 5 (2017), 1159-1170.\nSavitha M.T.  “Application of Fuzzy Theory in Optimization Problems-A Review” in the proceedings of the national Conference on “Recent Trends in Pure and Applied Mathematics” organized by Post-Graduate and Research Department of Mathematics, Mar Ivanios College.\nDhanya Ramachandran,”Inverse cubic spline by applying reversion of series method”, Journal of Natural Sciences and Mathematics, Vol.10, No.1, pp.71-86, 2017.\nDhanya Ramachandran, “Bivariate cubic spline interpolation”, International Journal of Mathematics and its Applications, Volume 5, Issue 1-c, pp. 397-400, 2017.\nDhanya Ramachandran, “Two variable cubic spline Interpolation”, IOSR Journal of Mathematics (IOSR-JM) , e-ISSN: 2278-5728, p-ISSN: 2319-765X, Volume 13, Issue 1, Version VI, pp: 01-05, 2017.\nDhanya Ramachandran, “Minimizing property of  two variable cubic spline interpolation”, International Journal of Mathematics and its Applications, Volume 5, Issue 3, pp. 39-42, 2017.       .\nDhanya Ramachandran, “Interpolation by inverse cubic spline Method”, International Journal of Mathematics Trends and Technology (IJMTT), Vol. 43, Number 4,  pp. 256-259, 2017.\nDhanya Ramachandran, “Comparison of inverse cubic spline formulas”, Bulletin of Kerala Mathematics Association, Vol. 15, No.2, pp. 229-233, 2017.\nArchana P. Das, Annette Fernandez, B. Arunkumar , Shiny P. Laila, V.S. Vishnu and B.N. Bessy Raj, “Synthesis, characterization, in silico and in vitro studies of an amino derivative of embelin as potent anticancer agent against human breast cancer cell line MCF-7”, International Journal of Research and Reviews in Pharmacy and Applied sciences, Vol.7 Issue.1, 1426-1437, 2017.\nLekshmi I. (2017). A Study On  The Application Of Fuzzy Sets In Medical Diagnosis. NACMMEA-2017 Conference Proceedings.\nJisha J.J. (2017). Approximation of Sine Function by Cubic Splines. NACMMEA-2017 Conference Proceedings.\nNeeradha. C. K, Dr. T.R Sivakumar and Dr.V. Madhukar Mallayya (2017). Mathematical Properties of 9×9 Strongly Magic Squares. International Journal Of Engineering Sciences & Research Technology, Volume 6, Issue 4.ISSN: 2277-9655\nNeeradha. C. K., Dr. T.R Sivakumar and Dr.V. Madhukar Mallayya. (2017). Linear Algebraic Properties of 4×4 Strongly Magic Squares. Journal Of Natural Sciences and Mathematics, 10(1).\nAlex Rufus, Sreeju N.,\nVidya Vilas\n, Daizy Philip, Biosynthesis of hematite (α- Fe2O3)nanostructures: Size effects on applications in thermal conductivity, catalysis and antibacterial activity,\nJournal of Molecular Liquids\n242 (2017) 537-549\nNeeradha. C. K and  Dr. V. Madhukar Mallayya. (2016, December ). Strongly Magic Squareas Abelian Groups. Int. J. of Mathematical Sciences and Applications, Vol. 6( No. 2), pp 559-563. ISSN: 2230-9888\nNeeradha C. K andDr.V. Madhukar Mallayya. (2016, December). Mappings On Strongly Magic Squares. International J. of Math. Sci. & Engg. Appls. (IJMSEA), Vol. 10 (No. III), pp. 39-45.ISSN 0973-9424\nDr.V. Madhukar Mallayya and Neeradha. C.K. (2016, Jan-Dec ). Strongly Magic Squares and Group Morphisms. American Journal of Mathematics and Sciences, Vol 5(1), 51-56.ISSN No: 2250-3102\nC.K. Neeradha and Dr.V. Madhukar Mallayya. (2016). Distinctive Properties of Strongly Magic Square. International Journal of Mathematics And its Applications, Volume 4 (Issue 2 C), pp 179-183. ISSN: 2347-1557\nNeeradha.C.K. andDr.V.Madhukar Mallayya. (2016, August). Dot Products of Fourth Order Strongly Magic Squares. International J. of Math. Sci. & Engg. Appls. , 10(II), pp. 91-98.ISSN 0973-9424,\nNeeradha.C.K.  and Dr. V Madhukar Mallayya. (2016). Strongly Magic Squares As Rings and  Fields. International Research Journal of Pure Algebra, 6(11), 1-5.ISSN 2248–9037\nNeeradha. C.K. and Dr.V Madhukar Mallayya. (2016, December). Magic Squares : A Brief Note on its Applications. Bulletin of Kerala Mathematical Association, pp  209-215.\nNeeradha. C.K. and Dr.V Madhukar Mallayya. (2016, December). Functions and Morphisms on Strongly Magic Squares.Proceedings of the  International Conference on Special Functions & Applications (ICSFA-2016).\nDhanya Ramachandran, “Inverse cubic spline”, International Journal of Mathematics and Mathematical Sciences, Vol.12, No.1, pp. 41-52, 2016.\nNeeradha.C.K. and Dr.V.Madhukar Mallayya. (2016, August). General Properties of Strongly Magic Squares. International Journal of Scientific and Innovative Mathematical Research, Volume 4(8), pp 7-14.ISSN 2347-307X (Print) & ISSN 2347-3142 (Online) DOI: http://dx.doi.org/10.20431/2347-3142.0408002\nNeeradha. C.K. and Dr.V Madhukar Mallayya. (2016, August).Some Properties of  Strongly Magic Squares.Proceedings of the  3rd International Seminar SVASH.\nNeeradha C. K and V. Madhukar Mallayya. (2016, August). Strongly Magic Square As Vector Space. International J. of Pure & Engg. Mathematics , Vol. 4 (No. II), pp. 1-9.ISSN 2348-3881\nArchana P. Das, Dr. Annette Fernandez, Arun Kumar B, “Embelin derivative as anticancer agent for breast cancer- in silico screening and docking studies” International Journal of Emerging Research Trends in Engineering and Technology, -Vol-II , Pages: 136 – 139,  February 2016.\nNeeradha. C. K. and Dr. V. Madhukar Mallayya. (2016, January-June). Generalised Form of a 4×4 Strongly Magic Squares. Indian Journal Of Mathematics and Mathematical Sciences, 12(1), 79-84.ISSN: 0973-3329\nNeeradha.C.K. and Dr .V Madhukar Mallayya. (2016, January-June). Special Properties of Strongly Magic Squares. International Journal of Mathematical Sciences & Applications, Vol. 6(1), pp 103-108.ISSN No: 2230-9888\nNeeradha C. K andDr.V. Madhukar Mallayya. (2016, December). Mappings On Strongly Magic Squares. International J. of Math. Sci. & Engg. Appls. (IJMSEA), Vol. 10 (No. III), pp. 39-45.ISSN 0973-9424\nDr.V. Madhukar Mallayya and Neeradha. C.K. (2016, Jan-Dec ). Strongly Magic Squares and Group Morphisms. American Journal of Mathematics and Sciences, Vol 5(1), 51-56.ISSN No: 2250-3102\nC.K. Neeradha and Dr.V. Madhukar Mallayya. (2016). Distinctive Properties of Strongly Magic Square. International Journal of Mathematics And its Applications, Volume 4 (Issue 2 C), pp 179-183. ISSN: 2347-1557\nNeeradha.C.K. andDr.V.Madhukar Mallayya. (2016, August). Dot Products of Fourth Order Strongly Magic Squares. International J. of Math. Sci. & Engg. Appls. , 10(II), pp. 91-98.ISSN 0973-9424,\nNeeradha.C.K.  and Dr. V Madhukar Mallayya. (2016). Strongly Magic Squares As Rings and  Fields. International Research Journal of Pure Algebra, 6(11), 1-5.ISSN 2248–9037\nNeeradha. C.K. and Dr.V Madhukar Mallayya. (2016, December). Magic Squares : A Brief Note on its Applications. Bulletin of Kerala Mathematical Association, pp  209-215.\nNeeradha. C.K. and Dr.V Madhukar Mallayya. (2016, December). Functions and Morphisms on Strongly Magic Squares.Proceedings of the  International Conference on Special Functions & Applications (ICSFA-2016).\nDhanya Ramachandran, “Inverse cubic spline”, International Journal of Mathematics and Mathematical Sciences, Vol.12, No.1, pp. 41-52, 2016.\nNeeradha.C.K. and Dr.V.Madhukar Mallayya. (2016, August). General Properties of Strongly Magic Squares. International Journal of Scientific and Innovative Mathematical Research, Volume 4(8), pp 7-14.ISSN 2347-307X (Print) & ISSN 2347-3142 (Online) DOI: http://dx.doi.org/10.20431/2347-3142.0408002\nNeeradha. C.K. and Dr.V Madhukar Mallayya. (2016, August).Some Properties of  Strongly Magic Squares.Proceedings of the  3rd International Seminar SVASH.\nNeeradha C. K and V. Madhukar Mallayya. (2016, August). Strongly Magic Square As Vector Space. International J. of Pure & Engg. Mathematics , Vol. 4 (No. II), pp. 1-9.ISSN 2348-3881\nArchana P. Das, Dr. Annette Fernandez, Arun Kumar B, “Embelin derivative as anticancer agent for breast cancer- in silico screening and docking studies” International Journal of Emerging Research Trends in Engineering and Technology, -Vol-II , Pages: 136 – 139,  February 2016.\nV. Vilas\n, D. Philip & J. Mathew, Essential oil mediated synthesis of silver nanocrystals for environmental, anti-microbial and antioxidant applications,\nMaterials Science and Engineering C\n61 (2016) 429–436\nV. Vilas\n, D. Philip & J. Mathew, Facile one-pot synthesis of crystalline palladium nanoparticles with exceptional catalytic and antiradical activity,\nMaterials Chemistry and Physics\n170 (2016) 1-11\nNeeradha. C. K. and Dr. V. Madhukar Mallayya. (2016, January-June). Generalised Form of a 4×4 Strongly Magic Squares. Indian Journal Of Mathematics and Mathematical Sciences, 12(1), 79-84.ISSN: 0973-3329\nV. Vilas\n, D. Philip & J. Mathew, Biosynthesis of Au and Au/Ag alloy nanoparticles using\nColeus aromaticus\nessential oil and evaluation of their catalytic, antibacterial and antiradical activities,\nJournal of Molecular Liquids\n221 (2016) 179–189\nShiny P.L., Annette F., Rema D.V.K., Vishnu V.S., Arun K.B., Kavitha R.P.K., Archana P.D., Evaluation of In silico and In vitro pharmacological activities of 1,3,8-trihydroxyanthraquinone, International journal of research and reviews in pharmacy and applied science., 5(1), 2015, 1173-1188.\nShiny, P.L., Annette, F., Arun, K., Vishnu, V.S., Rema, D.K., Archana, P.D., Thomas, O., Synthesis, Single Crystal Study, in silico Analysis, in vitro Anti-inflammatory and Anticancer Activities of 7-hydroxy-14H-naphtho[2,3- a]phenothiazine-8,13-dione, Drug Delivery Letters, 5(2), 2015, 140-150.\nArchana, P. Das., Annette, F., Arunkumar, B., Shiny, P.L., In silico screening and molecular docking studies of embelin and its derivatives as potent anti cancer agents-A green chemistry approach, International Journal of Emerging Research Trends in Engineering and Technology, 2(4), 2015,632-637.\nAmmu Maria Ashok. (2015). Effectiveness of Role Play in Enhancing Communication Skills of English Language Learners” in Language in India (Journal), volume 15:4, April 2015.\nA. Rajan,\nV. Vilas\n& D. Philip, Catalytic and antioxidant properties of biogenic silver nanoparticles synthesized using\nAreca catechu\nnut,\nJournal of Molecular Liquids\n207 (2015) 231-236\nA. Rajan,\nV. Vilas\n& D. Philip, Studies on catalytic, antioxidant, antibacterial and anticancer activities of biogenic gold nanoparticles,\nJournal of Molecular Liquids\n212 (2015) 331-339\nV. Vilas\n, D. Philip & J. Mathew, Phytochemical-capped biogenic gold nanocrystals with chemocatalytic and radical scavenging potential,\nJournal of Molecular Liquids\n200 (2014) 390-397\nV. Vilas\n, D. Philip & J. Mathew, Catalytically and biologically active silver nanoparticles synthesized using essential oil,\nSpectrochimica Acta A\n132 (2014)743-750\nVeena Nair (2009). Published a paper, “Structural Complexity, Lexical Variety and Accuracy: ‘Developmental’ or ‘Proficiency’ measures?” in EFL Journal (EFLU), 2009.\nSalini K.S. published  “Home Schooling and Socialization Myth- an Analysis”.\nSalini K.S. published a paper titled “A Study on the Behavioural Characteristics Among Children Of Workaholic Parents”.\nResearch and Development\nA collaborative project has been initiated by Dr. Krishna Mohan  G.P (Principal Investigator) with Indo-Korea Science and Technology center, Bengaluru (a subsidy of South Korean government) and Cycloides Inc., SEZ , Technopark. This open source project aims to develop an IDE for computational materials science.\nVision\nSustained excellence as a leading Centre for Basic Sciences and Humanities education imbibing its essential concepts, thereby enabling the future Engineers to have a competitive edge with a strong sense of Values.\nMission\nEnhance scientific temper among students in creating Technological and Engineering solutions and further develop analytical skills, soft skills, management skills and entrepreneurship skills, to mould them into better Professionals.\nBoS\nInstitute electives\nMinor Baskets\nThe People\nFacilities\nNews and Events\nDepartmental Activities\nPublications, Workshops & Conferences/Seminars\nFormer HoDs"
}