{
    "filename": "mbcet.ac.in_internal-complaints-committee-icc_.html",
    "content": "Internal Complaints Committee (ICC) – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nInternal Complaints Committee (ICC)\nInternal Complaints Committee (ICC)\nMAR BASELIOS COLLEGE OF ENGINEERING AND TECHNOLOGY,THIRUVANANTHAPURAM\nINTERNAL COMPLAINTS COMMITTEE (ICC)\nIn pursuance of UGC (Prevention, prohibition and redressal of sexual harassment of women employees and students in higher educational institutions) Regulations 2015 read with Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act 2013 (SHWW Act 2013), and  as per the AICTE Regulations, Internal Complaints Committee (ICC)  which was constituted  earlier (office order 1) has later been   reconstituted (office order 1 &office order 2) to deal with the complaints relating to Sexual Harassment at workplace.\nLoading...\nTaking too long?\nReload document\n|\nOpen in new tab\nOn receipt of a complaint, ICC shall conduct preliminary enquiry so as to ascertain the truth of the allegations by collecting the documentary evidence and the recording statements of possible witnesses including the complainant. ICC shall then submit the preliminary enquiry report to the Principal along with all the original documents collected during the preliminary enquiry proceedings. In case the allegations are not in the nature of sexual harassment, ICC may refer such complaints to the Grievance Redressal Cell or the other sections concerned.\nWhere sexual harassment occurs as a result of an act or omission by any third party or outsider, ICC shall take all steps necessary and reasonable to assist the affected person in terms of support and preventive action.\nICC shall comply with the procedure prescribed in the aforementioned UGC Regulations 2015 and the Sexual Harassment Act for inquiring into the complaint in a time bound manner.\nIf ICC concludes that the allegations made were false, malicious or the complaint was made knowing it to be untrue or forged, or misleading information has been provided during the inquiry, the complainant shall be liable to be punished as per the relevant provision of the UGC Regulations 2015.\nMember Secretary, ICC shall receive the complaints of sexual harassment, if any, on behalf of ICC and shall co-ordinate the deliberations of the ICC on the complaints received.\nWho can approach ICC FOR HELP?\nAny female (faculty, student or staff) of MBCET Thiruvananthapuram.\nDefinition of Sexual Harassment:\n‘Sexual Harassment’ includes any unwelcome sexually inclined behavior, whether directly or indirectly, such as:\nPhysical contact and advances\nDemand or request for sexual favours\nSexually coloured remarks\nShowing any pornography, or\nAny other unwelcome physical, verbal or non-verbal conduct of sexual nature.\nWhat are the possible actions that can be taken against the respondent?\nWarning\nWritten Apology\nBond of good behavior\nAdverse remark in the Confidential Report\nStopping of increments/ Promotion\nSuspension\nDismissal\nAny other relevant actions\nIf you think you are harassed or being harassed, what should you do?\nInform the chairperson by email\n[email protected]\n. To know more about ICC procedure, you may refer to the related documents, the details of which are given below.\nYour complaint will be kept CONFIDENTIAL.\nInquiry process:\nThe inquiry shall be completed within a period of 90 days from the date of the complaint. On completion of the inquiry, the ICC shall provide a report of its findings to the employer within a period of 10 days from the date of completion of the inquiry and such report be made available to the parties concerned.\nIf the allegations against the respondent has been proved, it shall recommend punitive actions to be taken against the respondent to the employer. The employer shall act upon the recommendation within 60 days of receiving it.\nUseful Documents and Notices:\n1) Office Orders 1,2 &3  2) Handbook on Sexual Harassment of Women at Workplace 3) Ministry of Women & Child Development Order dated 27 October,2014  4)  UGC Regulations for Higher Educational Institutions,2015 (The Gazette of India,May2,2016)  5)  UGC Orders dated 14 May 2019 & 10 June 2021.\nUGC Orders & Regulations\nUGC Regulations for Higher Education Institutions\nMinistry of Women and Child Welfare Order\nUGC Order dated 10.06.2021\nUGC Order dated 14.05.2019\nEvents\nANNUAL REPORT 2022-23\nAnnual Report 2021\nHandbook\nHANDBOOK On Sexual Harassment of Woman at Workplace\nOffice Orders\nJune 2024\nMarch 2023\nApril 2022\nMarch 2021\nOctober 2020\nUGC Orders & Regulations\nEvents\nHandbook\nOffice Orders\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}