{
    "filename": "mbcet.ac.in_faculty_ms-dhanya-l-k_.html",
    "content": "Ms. Dhanya L K – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nComputer Science & Engineering\n>\nMs. Dhanya L K\nEmployee Code / ID No.\n—–\nQualifications\nM.tech ,PHD (doing at CUSAT)\nOrcid ID\nDhanya L K (0000-0002-1383-4384) – My ORCID\nIndustry / R & D Experience\n3 Years\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9447791479\nAreas of Interest / Current Research\nNatural Language Processing,Machine Learning ,Data science\nResearch,  Consultancy, Publication\nJournals:\nIntegrating Hybrid Neural Networks and Domain-Specific Embeddings for Detecting Hate Content in Code Mixed Social Media Comments  ISSN: 2182-2069 / E-ISSN: 2182-2077 published in Journal of Internet Services and Information Security (JISIS), volume: 14, number: 3 (August), pp. 316-329.\nHierarchical Structure Generation for Malayalam using Hybrid Approach” by Dr. Elizabeth Sherly, Dr. L.K. Dhanya, and Dr. Rajeev R.R. was published in the International Journal of Application or Innovation in Engineering & Management (IJAIEM), Volume 4, Issue 9, in September 2015, spanning pages 108-112.\nInternational Conferences :\n“Hate Speech Detection in Asian Languages: A Survey” was published in the 2021 International Conference on Communication, Control and Information Technologies and published in IEEE explorer.\n“Survey on the Design and Development of Indian Language Chatbots”, which was published International Conference on Communication, Control and Information Technologies  conference in 2021 and published in IEEE explorer.\n“Comparative Performance of Machine Learning Algorithms in Detecting Offensive Speech in Malayalam-English Code-Mixed Data” was published in Advances in Distributed Computing and Machine Learning (2022)  and Published in Springer.\n“Analysis of Machine Learning Algorithms for Predicting the Suitable Career After High School”, which was featured in the Proceedings of the Third International Conference on Communication, Computing, and Networking Technologies  and Published in Springer.\nNational conference :\n“S-O-V based Parser for Malayalam using Hybrid Approach” with Dr. Rajeev R.R., which was presented at the UGC-sponsored National Conference on Recent Trends in Information Technology.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nNO\nAcademic / Professional Outreach Activities\n—–\nMembership in Professional bodies/ organizations\nACM\nCommunity Outreach Activities\n—–\nAwards / Distinctions / Rank / Other Achievements if any\n—-\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}