{
    "filename": "mbcet.ac.in_faculty_ms-vandana-p_.html",
    "content": "Ms. Vandana P – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nElectrical and Electronics Engineering\n>\nMs. Vandana P\nEmployee Code / ID No.\n10312024\nQualifications\nM.Tech\nOrcid ID\nhttps://orcid.org/0000-0002-4131-1804\nIndustry / R & D Experience\nIndustry Experience CTS- 2.5 years\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n405\nAreas of Interest / Current Research\nElectrical Machines, Electromagnetics, Network Analysis\nResearch,  Consultancy, Publication\nVandana. P, “Line following smart car using RFID”, International Research Journal of Engineering and Technology, June 2020.\nMs. Vandana P, “IoT based Health Monitoring System”, International Journal of Research in Engineering, Science and Management, June 2019.\nKeerthana P.S., Ms. Vandana P., “Fuzzy Controller Based Efficient Brake Force Prediction with Hybrid Energy Storage System in Regenerative Braking System”, International Journal of Innovative Research in Science, Engineering and Technology, April 2018.\nAashitha Baby, Ms. Vandana P., “Electric Car Driven by Brushless DC Motor in Four Quadrants using Hysteresis Current Controller”, 7th International Conference on Advances in Science, Engineering & Technology, April 2017.\nAashitha Baby, Ms. Vandana P., “Four Quadrant Operation of BLDC Motor using Hysteresis Current Controller”, 7th International Conference on Advances in Science, Engineering & Technology, April 2017.\nAashitha Baby, Ms. Vandana P., “A Torque Ripple Compensation Technique for a BLDC Motor Drive fed from Solar PV Array using SEPIC converter”, International Journal of Advanced Research in Electrical, Electronics and Instrumentation Engineering, June 2016.\nSreesha A.S, Ms. Vandana P., “Four Quadrant Operation of BLDC Motor with Current Controller”, International Journal of Engineering Trends and Technology (IJETT), October 2015.\nMs. Vandana P., Prof. A.S. Shajilal, “Modeling and Simulation of Four Quadrant Operation of a Sensorless Brushless DC Motor”, in the Proceedings of National Conference on Technological Trends (NCTT), College of Engineering Trivandrum, August 2012.\nMs. Vandana P., Dr. G. Pavithran, “Scope of Commercial Tapping of Bio Sources”, National Workshop on Sustainable Energy jointly organized by EMC-K, PPRI and GIFT, December 2013.\nMs. Vandana  P., Dr. G. Pavithran, “Strategies to meet the Electricity Demand in India”, 2nd National Energy Congress, May 2013.\nMs. Vandana  P., Dr. G. Pavithran, “Different Approaches for Conservation of Energy to Protect Environment”, 1st National Energy Congress, March 2011.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\n—–\nMembership in Professional bodies/ organizations\nISTE Life Member, ECS\nCommunity Outreach Activities\nILLUMINA Activities\nAwards / Distinctions / Rank / Other Achievements if any\n—–\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}