{
    "filename": "mbcet.ac.in_faculty-department_mechanical-engineering_.html",
    "content": "Mechanical Engineering – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nEmployee Code / ID No.\n10608006\nQualifications\nPhD.\nOrcid ID\n0000-0002-5065-1130\nIndustry / R & D Experience\n1 year\nEmail ID\n[email protected]\nAlternate E-mail ID\n–\nMobile No (Optional) / Intercom Extension No.\n152\nAreas of Interest / Current Research\nCAD/CAM, Manufacturing\nResearch,  Consultancy, Publication\nInternational Journal Papers\nRemil, G.T., Deepak, L.K., Manu, R., 2021, “STEP AP 242 Managed Model-Based 3D Engineering: An Application Towards the Automation of Fixture Planning”, Int. J. Autom. Comput.. https://doi.org/10.1007/s11633-020-1272-x\nCopyright\nCopyright with number: SW-14005/2020 dated 14/12/2020 received from Copyrights Office, Govt. of India, FiXplan, a software for feature extraction and fixture planning.\nInternational conference\nRemil, G.T., Manu, R., 2016, “Automatic Feature Recognition based Fixture Design for Prismatic Components” proceedings of 6th International All India Manufacturing Technology Design and Research Conference (AIMTDR) held at College of Engineering Pune, India, 16-18 Dec, pp. 795-798.\nRemil, G.T., Anirudh, M.V., Deepak, L.K., Manu, R., 2016 “Fixture Design based on Automatic Feature Recognition” proceedings of International Conference on Design and Manufacturing (IConDM2016) held at Indian Institute of Information Technology Kancheepuram, India, 16-17 Dec, pp. 133-137.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\n–\nMembership in Professional bodies/ organizations\nISTE\nCommunity Outreach Activities\nActive in NSS\nAwards / Distinctions / Rank / Other Achievements if any\n–\nQualification: DOING B.Tech, Diploma, ITI\nQualification: ITI, Diploma MS Office, Degree(Hindi)\nDr. Muraleedharan Nair K. secured B.Tech in Mechanical Engineering from TKM College of Engineering. He then joined the Central Power Research Institute (CPRI), gaining significant experience in the field of Energy Audit and Management. He obtained M.Tech in Propulsion Engineering from College of Engineering, Trivandrum. He further honed his expertise by pursuing Ph.D in Thermal and Fluid Science at the prestigious Indian Institute of Technology (IIT) Kanpur and dedicated six years to research and development, focusing on innovative projects. He secured the Best Paper Award at the 5th International and 41st National Conference on Fluid Mechanics and Fluid Power, held at IIT Kanpur in 2014. He is a KTU approved Ph.D supervisor and his research interests include advanced topics such as flow-induced oscillations, aero acoustics, and LES. He has several national and international conference and journal publications in these areas and extensive experience handling funded projects, most notably with the Indian Space Research Organization (ISRO) and Centre for Engineering Research and Development (CERD). He has been a key figure in various national and international conferences, serving on national advisory boards, organizing committees, and as a session and review chair. He was also the organizing chair of ICAMeO-2019 and serves as a subject expert on committees of central level organizations.\nEmployee Code / ID No.\n10616061\nQualifications\nBTech in Mechanical Engineering, TKM college of Engineering\nMTech in Propulsion Engineering, College of Engineering Trivandrum\nPhD in Thermal and Fluid science, Indian Institute of Technology, Kanpur\nOrcid ID\nhttps://orcid.org/0000-0002-0666-2668\nIndustry / R & D Experience\nIndustry-2years ,R&D-6 years,Teaching-15.5 years\nEmail ID\n[email protected]\n,\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9074744097\nAreas of Interest / Current Research\nFlow induced oscillations,Aero acoustics,LES\nResearch,  Consultancy, Publication\nFunded projects\nISRO,Gvt.India\nCERD-Gvt.Kerala\n24  publications\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nKTU approved supervisor\nAcademic / Professional Outreach Activities\nFunctioned as memeber of National advisory committee ,organizing committee, organizing chair, session chair,reviewer for different Internantional conferences ,subject experts for department promotion, ISRO\nMember of National Advisory Committee AJWTF7-2018\nOrganizing chair-ICAMeO-2019,\nOrganizing Committee member, session  and review chair of  national and international conferences\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nBest Paper award  in the 5\nth\nInternational and 41\nst\nNational Conference on Fluid Mechanics and Fluid Power, IIT Kanpur,2014.\nQualification: ITI (NCVT)\nQualification: ITI\nQualification: ITI(NCVT)\nProf. Rajesh TN did his Ph. D from NIT Calicut in 2019. He completed his B-Tech in Mechanical Engineering and M-Tech in Thermal Science from College of Engineering, Thiruvananthapuram in 1999 and 2007 respectively. He joined MBCET in 2008 and served in various administrative roles. He was the Head of Department of Mechanical Engineering from 2019-2023. He has a teaching experience of over 20 years. His area of research includes Reactive and non-reactive flow and Analysis of Thermal systems. Rajesh has authored many publications in International journals and conferences and has served on many conference committees.\nEmployee Code / ID No.\n10609009\nQualifications\nM-Tech(Thermal Science), Ph.D\nOrcid ID\nhttps://orcid.org/0000-0002-3076-4330\nIndustry / R & D Experience\nResearch studies at National Institute of Technology Calicut and Indian Space Research Organisation, Thiruvananthapuram from 2010-2015\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9847367020/0471-2545868(Ext.193)\nAreas of Interest / Current Research\nReactive and Non-Reactive fluid flow , Analysis of thermal systems, Bio-Mechanical systems\nResearch,  Consultancy,\nPublication\nJournals\nSam Rony Zachariah, Arva S Swami, Libin K Lukose, Aswin Raj, and Rajesh T.N,\nDesign and Analysis of a Rehabilitative aid for Spastic Feet, 2022,\nAIP Conference proceedings 2463,020061 (2022)\nhttps://doi.org/10.\n1063/5.0080364\nRajesh T.N., T.J. Sarvoththama Jothi, Jayachandran T., (2020) “Performance analysis of a vortex chamber under non-reacting and reacting conditions, Sådhanå (2020) 45:43, https://doi.org/10.1007/s12046-020-1271-1\nT.N.Rajesh, T.J. Sarvoththama Jothi, Jayachandran T., (2019) ” Preliminary Studies on Non-Reactive Flow Vortex Cooling “, Recent Patents on Mechanical Engineering,12, DOI: 10.2174/2212797612666190510115403\nNaduvilethil R.T., Jegathjothi S.J.T., Thankappan J, 2018, Hot test studies in a spark ignited vortex combustion chamber, Chemical Energy Transactions, 71, 1345-1350, DOI: 10.3303/CET1871225.\nRajesh T.N., T.J. Sarvoththama Jothi, Jayachandran T., (2018) ” Cold flow studies in a vortex thrust chamber”, Aircraft Engineering and Aerospace Technology, https://doi.org/10.1108/AEAT-07-2017-0167.\nInternational Conferences\nSam Rony Zachariah, Arva S Swami, Libin K Lukose, Aswin Raj, and Rajesh T.N, “ Design and Analysis of a Rehabilitative aid for Spastic Feet”, in Proceedings of the Recent Innovation in science and Technology RIST 2021, International Virtual Conference(Online platform), June 19 &20, 2021, EKC Technical campus, Kerala, India.\nT.N. Rajesh, T.J.S. Jothi and T. Jayachandran,“Experimental and numerical analysis of cold flow behavior in a vortex combustion chamber”, in proceedings of the International Conference on Innovative Approaches in Mechanical Engineering and Materials Science, June 15-2017, Paper No. 6,Trinity college of Engineering, Trivandrum, India.\nT.N. Rajesh, T.J.S. Jothi and T. Jayachandran,“Analysis of Vortex Combustion Cold Wall Chamber”,in proceedings of the 2th International Conference on Thermal, Energy and Environment, 2016,Paper No. 8, March 25-26,Kalasalingam University, Tamilnadu, India.\nT.N. Rajesh, T.J.S. Jothi, and T. Jayachandran, “Analysis of Vortex Combustion Cold Wall Chamber”,in proceedings of 1st International ISHMT-ASTFE Heat and Mass Transfer Conference,IHMTC 2015, Paper No. 969, December 17-19, 2015, ISRO, India\nNational Conferences\nHarishankar.S, Aswin A Asokan , Madhav Murali, Rejath R.S and Rajesh T.N, “ Design of a centrifugal impeller for lean supercharging of motorcycle engines”, in Proceedings of the 35th Indian Engineering Congress(Online platform), Paper No. MC/120/13, December 18-20 2020.\nNithin Jo Varghese, Muhammed N and Rajesh T.N,“ Mathematical modelling of a lower limb extremity using Euler-Lagrangian method”, in Proceedings of the 4th National Conference INCAM 2019 , July 3-5 2019, Paper No. 205, IISc, Bangalore\nT.N. Rajesh, T. Jayachandran and T.J.S. Jothi,“Studies on vortex cooling of a combustion chamber”,in Proceedings of the 44th National conference on FMFP, December 14-16, 2017, Paper No. 123, Amrita University, Amritapuri Campus, Kollam, Kerala.\nT.N. Rajesh, T.J.S. Jothi and T. Jayachandran,“Cold flow investigation of flow behavior in a vortex combustion cold wall”, in Proceedings of the 42nd National Conference on FMFP, December 14-16 2015, Paper No. 235, NITK, Suratkal.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\nSyllabus designed for the Open elective course Automotive Technology (MET 435) in 2019 scheme for APJ Abdul Kalam Technological University\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nDesign and development of a centrifugal supercharger system for lean supercharging of a single cylinder SI engine-PI for CERD funded students project 2021(Rs 32500).\nDesign and development of a Rehabilitative aid for Spastic Feet-PI for KSCSTE funded students project 2021(Rs10000).\nGuided the student project titled Design and development of physiotherapy aid for paraplegic patients which won the First prize (Rs 1 lakh) in Dr APJ Abdul kalam Innovation Ecosystems organised by ICT Academyin 2018.\nEmployee Code / ID No.\n10608010, KTU-F4731\nQualifications\nPh.D.\nOrcid ID\n0000-0003-3897-3388\nIndustry / R & D Experience\n–\nEmail ID\n[email protected]\nAlternate E-mail ID\n–\nMobile No (Optional) / Intercom Extension No.\n–\nAreas of Interest / Current Research\nMechanical Vibrations, Nonlinear Dynamics\nResearch,  Consultancy, Publication\nPublications in peer reviewed journals\nVinod V, Bipin Balaram, “On the spatial spread of active control in a Van der Pol ring via synchronisation and its stabilisation using parameter mismatch”,\nCommunications in Nonlinear Science and Numerical Simulation\n– Elsevier,  Volume 117, February 2023, 106944; Impact factor 4.186; Q1 Journal\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, Effect of configuration symmetry on synchronization in a van der Pol ring with nonlocal interactions, Nonlinear Dynamics, Springer, 89(3), 2103-2114, 2017. Impact factor (2020): 5.022.,Q1 Journal\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, Effect of oscillator and initial condition differences on the dynamics on a ring of dissipatively coupled van der Pol oscillators, Journal of Mechanical Science and Technology, Springer, 29(5), 1931-1939, 2015. Impact factor (2020):1.734., Q2 Journal.\nInternational Conferences\nAdithya Krishna Menon, Vinod V “Proposal of A Mutual Inertia Force Coupling on The Wake Oscillator Model For Vortex Induced Vibrations”, 9th International and 49th National Conference on Fluid Mechanics and Fluid Power, IIT Roorkee, December 2022\nStrategies of Amplitude Control in a ring of self-excited oscillators, Vinod V, Bipin Balaram, 16th International Conference on Dynamical Systems – Theory and Applications, Lodz University of Technology, Poland, 2021.\nSangeeth,Mohan N R, Vinod V, Comparative study on the synchronization of coupled Van der Pol Oscillators under Reactive , Dissipative and Conjugate coupling, 7th Asian Joint Workshop on Thermal Physics and Fluid Science, 2018.\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, An initial condition dependent oscillation control in an odd and even number van der Pol ring., 10th Conference on Nonlinear Systems and Dynamics, IISER, Kolkata, 2016.\nDeepak B S, Hari Venkit, Vinod V, Effect of forcing frequency on mutually coupled Van Der Pol oscillators, Dynamic Days Asia Pacific 08, Indian Institute of Technology, Chennai, 2014.\nVinod V, Bipin Balaram, M.D. Narayanan, Mihir Sen, Mutual synchronization of dissipatively coupled limit cycle oscillators in a ring, 8th Conference on Nonlinear Systems and Dynamics, Indian Institute of Technology, Indore, 2013.\nNational Conferences\nDeepak L, Ganesh A, Dit R.S., Sreehari S.H., Vinod V., Krishnamohan G.P., Molecular Dynamics of carbon capture from the emissions of an IC engine using ZSM-5., 4th National conference on Multidisciplinary Design, Analysis and Optimization-IISC Bangalore, 2021.\nVinod V, Sajikumar K.S., Design and analysis of an antenna mounting structure for satellite application, Awarded as the best paper in Machine Design, National Conference on Technological Trends, 2007.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\nKTU Board of Studies Member\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nBest paper Award in Machine Design (NCTT -2007), College of Engineering Trivandrum\nEmployee Code / ID No.\n10606007\nQualifications\nM.Tech,\nPh.D\nOrcid ID\nhttps://orcid.org/0000-0001-5859-2625\nIndustry / R & D Experience\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n–\nAreas of Interest / Current Research\nComopsite Materials\nResearch,  Consultancy, Publication\nSredha Prem, Jeswin Wilson, Shelby Mathew Varghese, Pradeep M, ” BCI Integrated Wheelchair controlled via Eye Blinks and Brain Waves”, Techno Societal-2020, 3rd International Conference on Advanced Technologies for Societal Applications.\nP. Mohan, R. R. Kumar and S. A. Lal, “Analytical approach for large size reinforced square hole with rounded corners in orthotropic circular cylindrical shells,” Journal of Aerospace Sciences and Technologies, 2021.\nP. Mohan and R. R. Kumar, “An Analytical Approach for Large Size Optimised Reinforced Hole in Composite Circular Cylindrical Shells,” in 71st International Astronautical Congress (IAC) – The Cyber Space Edition, 12-14 October 2020.\nP. Mohan and R. R. Kumar, “A Non-Singular Anlytical Technique for Reinforced Non-Circular Holes in Orthotropic Laminate,” Int. J. of Applied Mechanics and Engineering, pp. 92-105, 2020.\nP. Mohan and R. R. Kumar, “Stresses in Orthotropic Circular Cylindrical Shells with Large Size Reinforced Holes – A Fourier Series Approach,” Composites: Mechanics, Computations, Applications: An International Journal , p. 10(4):299–309 , 2019.\nP. Mohan and R. R. Kumar, An Analytical Approach for the Design of Reinforced Circular Hole in a Composite Shell, ICAISET 19, 2019.\nPradeep M., R. Ramesh Kumar, “Analytical Prediction of Full Field Stress Distribution in Orthotropic Shell with Reinforced Hole”,  ICCE 25, Rome, Italy, 2017.\nPrakash I L, Pradeep M, “Reduction in Stress Concentration of Pin Loaded Holes on Composite Plates”, proceedings of National Conference on Futuristic Technologies in Mechanical Engineering NCFT -2015, Thiruvananthapuram.\nJibin Jacob, Pradeep M, “Kinematic Analysis of Universal Joint and Proposition for Compliant Universal Joint”, proceedings of National Conference on Futuristic Technologies in Mechanical Engineering NCFT -2015, Thiruvananthapuram.\nAaron G Johns, Arun Mohan Alenchery, Rajin Raju Sachin John, Stephen Mathew and M Pradeep, “Improving Performance of Fiat 118ne Engine & Hydraulic Loading Unit”, MBCET Journal of Research, Volume 3/ November 2014, ISSN 2277-4645.\nPradeep M. & Dileeplal J., “Analysis of the effect of variation of process parameters in a turning operation”, National Conference on intelligent control and instrumentation, 2006.\nPradeep M. & Dileeplal J., “Statistical analysis and process performance studies for a typical machining process”, National Conference on intelligent control and instrumentation, 2006.\nFunded Project – “Mitigation of plastic waste”, 2015 -16 funded by KSCSTE (CO PI, 3.5 Lakhs)\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\n–\nMembership in Professional bodies/ organizations\nISTE\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nFirst Rank for M.Tech\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}