{
    "filename": "mbcet.ac.in_departments_electrical-electronics-engineering_research-consultancy_.html",
    "content": "Research & Consultancy – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nElectrical and Electronics Engineering\n>\nResearch & Consultancy\nResearch & Consultancy\nResearch Activities\nResearch activities are carried out in the department in various fields like Control systems, Power Electronics, Electric Vehicles, etc.\nFaculty as Research Guide\nSl No\nName of Faculty\nName of Research Scholar\nUniversity\nRegistered Year\nTopic\n1.\nDr. Abraham T Mathew (2020 to 2024)\nMs. Renuka V S\nNIT Calicut\n2018\nStability and Control of DC Community Grid\nMs. Sony M G\nNIT Calicut\n2019\nPower Systems Operation and Control\n2.\nDr S Ushakumari\nMs. Namitha Murali\nAPJ Abdul Kalam Technological University\n2018\nDesign, Modelling and Implementation of an efficient PMSM drive for an electric three-wheeler\nMs Vijayasree G\nAPJ Abdul Kalam Technological University\n2019\nDesign, Modelling and Performance Analysis of high-speed Homopolar Inductor Alternator\nMs. Sabna M\nAPJ Abdul Kalam Technological University\n2019\nCondition Monitoring of five phase PMSM\n3.\nDr. Nisha G K\nMs. Sandhya P\nAPJ Abdul Kalam Technological University\n2021\nWireless Charging in EV\n4.\nDr. Shalu George K\nMr. Rejish Babu F R\nAPJ Abdul Kalam Technological University\n2022\nEnergy Cooperation among Microgrids\nMr. Arunlal N L\nAPJ Abdul Kalam Technological University\n2020\nMore Electric Aircraft\nFaculty pursuing Research\nSl No\nName\nResearch Centre\nUniversity\nArea of Research\n1.\nMr. Rejish Babu F. R.\nMar Baselios College of Engineering and Technology\nAPJ Abdul Kalam Technological University\nMicrogrids\n2.\nMs. P Sandhya\nMar Baselios College of Engineering and Technology\nAPJ Abdul Kalam Technological University\nWireless charging in EV\n3.\nMs. Jomole Joseph P\nAmrita School of Engineering\nAmrita Vishwa Vidyapeetham\nEnergy trading\n4.\nMs. Manju Sreekumar\nAmrita School of Engineering\nAmrita Vishwa Vidyapeetham\nConnected Autonomous Vehicles\n5.\nMs. Shyju Susan Mathew\nCollege of Engineering, Thiruvananthapuram\nAPJ Abdul Kalam Technological University\nRobotics\n6.\nMs. Sojy Rajan\nCollege of Engineering, Thiruvananthapuram\nAPJ Abdul Kalam Technological University\nMicrogrids\n7.\nMr. Aswin R B\nCollege of Engineering, Thiruvananthapuram\nAPJ Abdul Kalam Technological University\nUnmanned Aerial Vehicles\n8.\nMs. Surasmi N L\nCollege of Engineering, Thiruvananthapuram\nAPJ Abdul Kalam Technological University\nPower Electronics\n9.\nMr. Praveen Raj R S\nCollege of Engineering, Thiruvananthapuram\nUniversity of Kerala\nMicro Grids\n10.\nMs. Soumya A V\nVIT, Vellore\nVIT,Vellore\nMicro Grids\n11.\nMs.  Elizabeth Varghese\nCollege of Engineering, Thiruvananthapuram\nUniversity of Kerala\nFractional Order Controllers for Aerospace Systems\n12.\nMs. Sheenu P\nHindustan Institute of Technology & Science\nHindustan University\nDigital signal Processing\nResearch Groups\nThe Department of Electrical and Electronics Engineering has conducted many seminars and workshops for students and faculties to promote research and there are many R&D activities and consultancy works undertaken by the department. There is a research lab in the department to facilitate and promote research activities.\nThere are three major research groups involved in the research activities namely\nControl Systems Research Group\nPower Electronics Research Group\nEV Research Cell\nThe faculties are members of the above groups based on their area of expertise. These groups conduct regular meetings to discuss and decide on the activities to be conducted.\nEV Research Cell Activities\nEV Research Cell Coordinator:\nDr. Nisha G K\n(\nORCID\n:\nhttps://orcid.org/0000-\n0002-7798-906X,\nVidwan:\nhttps://vidwan.\ninflibnet.ac.in/profile/193120\n)\nThe EV Research group, Department of Electrical and Electronics Engineering organised an invited lecture on “Foundation to Electric Vehicles” for the students of EEE on 19 May 2023. The resource person for the session was Mr. Pradeep Kumar Keloth (Adjunct Professor of Practice at Amrita School of Engineering, Coimbatore and MBCET, Former HoE, Electrification at Bosch). Around 45 students attended the talk.Faculty coordinators:\nDr. Dishore S V\nand\nMr. Anil J\n, Assistant Professors, EED.\nThe EV Research Cell in association with Illumina, the Association of the Department of Electrical and Electronics Engineering, organized an Online Expert Talk on “\nOverview of EV environment and Opportunities\n” on 25/11/2022 from 10:30 am to 12:00 pm. The Resource person for the session was Mr. Ramesh G, Consultant, Manatec E-Drive. Around 40 participants attended the session.\nCoordinators\n: Mr. Aswin R B (94473 29628), Dr. Dishore S. V. (77087 57675), Assistant Professors, EED.\nVISIT TO EMC:\nA team of faculty from EED comprising of Dr. S Ushakumari, Dr. Nisha G.K., Mr. Aswin R.B. and Dr. Dishore S. V. paid a visit to the Energy Management Centre (EMC), Trivandrum on 24.11.2022. This was for discussing the possibilities of collaboration with EMC on the scheme for retrofitting the conventional autorickshaw and converting to an e-rickshaw. The team submitted a proposal to EMC for setting up a retrofitting facility on campus.\nResearch Group Activities\nControl Systems Research Group\nThe Control Systems Research group, Department of Electrical and Electronics Engineering organised an invited talk on the Control Aspects of Soft landing of Chandrayaan – 3 for the final year students on\n08 December 2023\n. The resource persons for the session were\nMs. Revathi H\n, Group Director, LPSC, ISRO and\nMr. Benoy Joseph K\n., Divisional Head, LPSC, ISRO.\nThe Control Systems Research group, EED organized an expert talk on “Role of Optimal guidance in soft landing of Chandrayan- 3” on 13 September 2023. The resource person was\nDr. Radhakant Padhi\n, Hal Chair Professor, Dept. of Aerospace Engineering, IISc., Bengaluru. The talk was coordinated by Mr. Aswin R B, Assistant Professor, EED.\nThe Control Systems Research group, Department of Electrical & Electronics Engineering, MBCET is organizing a Webinar on “Introduction to Unmanned Aerial Vehicles” on 18.09.2021. The resource person was Ms. Lima Agnel Tony, Robert Bosch Centre for Cyber-Physical Systems Ph.D. fellow, Department of Aerospace Engineering, Indian Institute of Science, Bangalore. The programme was coordinated by Mr. Aswin R B and Ms. Keerti S Nair.\nThe Control Systems Research Group, Department of Electrical & Electronics Engineering, MBCET organized a Webinar on “Dynamics and Control of Aerial Vehicles” on 28.05.2021. The resource person was Dr. Elizabeth Rita Samuel, Associate Professor and Head of the Department of EEE, Rajagiri School of Science and Technology (Autonomous). The programme was coordinated by Dr. Shalu George K and Ms. Anu Gopinath.\nThe Control Systems Research Group, Department of Electrical & Electronics Engineering, MBCET organized a Webinar on “Introduction to Model Predictive Control and its Applications” on 22.05.2021. The resource person was Dr. Chinmay Rajhans, Assistant Professor, VJTI, Mumbai. The programme was coordinated by Ms. Elizabeth Varghese and Ms. Shyju Susan Mathew.\nPower Electronics Research Group\nThe Power Electronics Research Group, EED, organized an Expert talk on “Indian Power Challenges and Way forward” for the final year students of EED on 24/02/2023 from 09:30 am to 11:30 am. The resource person was Mr. Shine Raj (Assistant Engineer, TRAC, KSEBL). Coordinator:\nMr. Anil J\n, Assistant Professor, EED.\nThe Power Electronics Research Group, EED, organized a Webinar on “Energy Management” for the final year students of EED on 13/02/2023 from 09:30 am to 12:30 pm. The resource person was Mr. Jose Philip (Building Energy Efficiency Expert, GRIHA Certified Professional, BEE Certified Energy Manager, Certified Resource person of ANERT). 70 students participated for the Webinar.\nThe Power Electronic Research Group, Department of Electrical and Electronics Engineering, MBCET organized an Expert talk for the final year students on Electrical Safety Aspects, on 14 October 2022 from 2:00 pm to 4:30 pm in Faraday Hall. The Resource person for the webinar was Sri. Suresh Kumar S., Nodal Officer Litigation (AEE), KSEB, Electrical Circle, Kattakada. The session was coordinated by\nMs. Vandana P. and Mr. Aswin R B\n, Assistant Professors, EED. Around 70 students attended the session.\nCoordinators:\nMs. Revathy K P\nand\nMs. Anila A V\n, Assistant Professors, EED.\nThe Power Electronic Research Group, Department of Electrical and Electronics Engineering, MBCET organized a webinar for the pre-final year students on EV Mid-drive Motor Test kit and CAN Analyser, on 6 May, 2022 from 2:30 pm to 3:30 pm. The webinar was coordinated by Mr. Rejish Babu F R and Ms. Anila A V, Assistant Professors, EED. Around 50 students attended the Webinar.\nPower Electronic Research Group and EV Research Cell, Department of Electrical and Electronics Engineering, MBCET organized a Two-day Webinar on Modeling and Simulation of EVs using MATLAB and Simulink, on 28 February 2022 and 3 March 2022 for final year B.Tech students, M.Tech students and members of the MBCET EV research cell. The resource person was Dr. Deb Singdeo, Education Customer Success Engineer, MathWorks India. The webinar was coordinated by Mr. Ajish Ashok, Assistant Professor, EED.\nThe Power Electronics Research group, Department of Electrical and Electronics Engineering, organized a webinar on “Solar Photovoltaic Systems” on 8 January 2022. The Speaker was Mrs. Radhika J M, Project Engineer, ANERT. The online platform for the webinar was Google Meet. Ms. Surasmi N L and Ms. Anila A. V., Assistant Professors, EED, coordinated the programme.\nPower Electronics Research Group, Department of Electrical and Electronics Engineering, MBCET organized a webinar on “Grid Integration of Wind Power Systems” on 29 November 2021 from 02:00 pm – 03:00 pm (IST). The session was handled by Ms. Teena George, Assistant Professor, Vimal Jyothi Engineering College, Kannur. The online platform for the webinar was Google Meet. Ms. Manju Ann Mathews and Ms. Shilpa Susan Peter, Assistant Professors, EED, coordinated the programme.\nPower Electronics Research Group, Department of Electrical & Electronics Engineering in association with EV Research Cell, organized a Webinar on “Electric Vehicle Charging System and Challenges” on 09.10.2021. The resource person was Mr. Sooraj V., Senior Hardware Engineer, TATA Elxsi. The programme was coordinated by Ms. Shilpa George and Mr. Ajish Ashok.\nPower Electronics Research Group, Department of Electrical & Electronics Engineering, MBCET organized a Webinar on “Vector Control of Three Phase Induction Motor” on 06.09.2021. The resource person was Prof. A. S. Shajilal (Retd), College of Engineering Trivandrum, Former HOD EEE Dept. Mar Baselios College of Engineering and Technology. The programme was coordinated by Mr. F R Rejish Babu and Mr. Ajish Ashok.\nThe Power Electronics Research Group, Department of Electrical & Electronics Engineering in association with EV Cell MBCET organized a Webinar on “Control Strategies for PMSM driven Electric Vehicle” on 26.06.2021. The resource person was Mr. Keloth Pradeep Kumar, Head of Department, Electrification Topics, Robert Bosch Engineering and Business Solution. Around 80 members participated in the programme. The programme was coordinated by Ms. Archana A N and Mr. Ajish Asok.\nThe Power Electronics Research Group, Department of Electrical & Electronics Engineering, MBCET organized a Webinar on “The role of Power Electronic Controllers for EV Charging Infrastructure” on 19.06.2021. The resource person was Dr. K Deepa, Assistant Professor, Department of EEE, Amrita School of Engineering, Bangaluru Campus Around 80 members participated in the programme. The programme was coordinated by Ms. Sojy Rajan C and Mr. Ajish Asok.\nThe Power Electronics Research Group, Department of Electrical & Electronics Engineering, MBCET organized a Webinar on “Career Prospects and Higher Studies after Electrical Engineering” on 05.06.2021. The resource person was Dr. Imthias Ahamed T P, Professor, Department of EEE, TKMCE. Around 100 members participated in the programme. The programme was coordinated by Ms. Vandana P and Mr. Aswin R. B.\nThe Department of Electrical and Electronics Engineering in association with IPCS – The Global Technology Service Provider conducted an Online Training Programme on Introduction to Industrial Automation on 29 and 30 April 2021 from 2 to 4 PM. The programme was organized by Power Electronics Research Group of the Department as a 2-day workshop, aimed at enhancing your practical knowledge in Industrial Automation. Final year and pre-final year B.Tech students (all branches) attended. The programme was coordinated by Ms. Surasmi N L and Ms. Jeneena Babu.\nPower Electronics Research Group, Department of Electrical & Electronics Engineering, MBCET organized a Webinar on “Emerging Trends in the Electric Vehicle Space” on 21 April 2021 from 12:00 PM – 01:00 PM (IST) in Google meet. The Speaker was Ms. Latha Chembrakalam, Vice President, Engineering, Robert Bosch Engineering and Business Solutions Ltd. The programme was coordinated by Ms. Sandhya P. and Mr. Ajish Ashok.\nPower Electronics Research Group, Department of Electrical & Electronics Engineering, MBCET organized a Webinar on “Industrial Applications of Power Electronics” on 8 April 2021 from 2.30pm – 3.30pm (IST) in Google meet. The Speaker was Mr. A. Saravana Kumar, Scientist-E/Joint Director, Power Electronics Group, CDAC. The programme was coordinated by Ms. Sandhya P. and Ms. Manju Ann Mathews.\nCollaborative Research Work\nThe Department of Electrical & Electronics Engineering, MBCET entered into a collaboration with “THESPACESLAB”, a start-up company working in the aerospace application for expanding the possibility of research and consultancy of the College. A research project involving Programming, Modelling, Computation and Simulation has been initiated.\nTopic: Orbital Debris Propagation\nFaculty involved:\nPrincipal investigator          – Ms. Elizabeth Varghese\nCo-investigator                   – Mr. Aswin R. B.\nMs. Amala Justin has joined as the Research Assistant to this project. The total outlay for this project including the monthly remuneration is Rs 2,00,000/-.\nIn-house Projects\nApproval granted for following in-house R&D projects, recommended by the MBCET research promotion committee.\n“Smart Meeting Room”:\nSheenu P. and Ms. Soumya A.V.\nAmount sanctioned: Rs. 42,000/-\n“Solar Powered Water Pumping System”:\nSandhya P.\nAmount sanctioned: Rs. 85000/-\n“\nVibration Energy Harvesting\n”:\nArchana A. N. and Ms. Shilpa Susan Peter\nAmount sanctioned: Rs. 35000/-\n“Design and Implementation of Control Strategy for Load Sharing and Circulating Current Minimization in Grid Application”:\nNisha G K and Ms. JeneenaBabu\nAmount sanctioned: Rs. 73000/-\n“SVPWM based Dual Multilevel Inverter fed Induction Motor Drive for Common Mode Voltage Elimination”:\nMidhun G.\nAmount sanctioned: Rs. 65000/-\n“A comparison on the performance of BLDC motor drive with DBR, Luo and BL-Luo as Converters”:\nDr Nisha G K, Ms C. SojyRajan, Mr Midhun G.\nAmount sanctioned: Rs. 1,00,000/-\n“Optical tuning Of PID controller for a second order system” :\nElizabeth Varghese and Ms. Anu Gopinath\nAmount sanctioned: Rs. 40,000/-\n“Speed and Position control system of DC servo motor”:\nMs. Shyju Susan Mathew and Ms. Keerthi S Nair\n.\nAmount sanctioned: Rs. 55,000/-\nFunded Student Projects\nThe student project entitled “Pisces Care Bot” guided by Mrs. Manju Sreekumar, Assistant Professor, EEE received the\nKerala State Council for Science, Technology and Environment (KSCSTE)\nfinancial assistance of Rs. 9910/-. Student Project Members: Abhijith A, Ananth A J, Gautham B R, Ravishankar S.\nThe student project entitled “Public Bus Transport Information System for Visually Impaired People” guided by Ms. Jomole Joseph P, Assistant Professor, EEE received the\nKerala State Council for Science, Technology and Environment (KSCSTE)\nfinancial assistance of Rs. 10,000/-. Student Project Members: Gokul R, Abhimanyu A L, Arya P K, Sruthi P Nair.\nThe student project entitled “Fire Extinguishing Drone” guided by Ms. Elizabeth Varghese, Associate Professor, EEE received the\nKerala State Council for Science, Technology and Environment (KSCSTE)\nfinancial assistance of Rs. 10000/-. Student Project Members: Al Thanzeer Muhammed, Ananthakrishnan G S, Vaishnav S S.\nThe student project entitled “IoT based dam monitoring and Pre disaster management” guided by Ms. Sheenu P, Assistant Professor, EEE received the APJ Abdul Kalam Technological University\nCentre for Engineering Research and Development (CERD)\nfinancial assistance of Rs. 12,000/-. Student Project Members: Noel Mathew Jacob and Vaishnavi Sreekumar. CERD funding list (Sl. No.: 46)\nThe student project entitled “Demand Management system using AI and IoT” guided by Ms. Manju Sreekumar, Assistant Professor, EEE received the financial assistance of Rs. 34,000/- from\nEnergy Management Centre (EMC)\n. Student Project Members: Vishnu M Nair, Abinshah Ameer, Amaze Anna Toms, Nanditha Sai Prasanth and Vaishnavi.\nThe student project entitled “AQI mapping using UAV” guided by Mr. Praveen Raj, Assistant Professor, EEE (Student Project Members: Adarsh Sudarsanan, Amalu S Panicker, Karthik J, Sachu Pradeep) and “Plant Box: A Controlled-Environment Agricultural Technology Platform” guided by Ms. Shyju Susan Mathew, Assistant Professor, EEE (Student Project Members: Prince K Francis, Amal S, Roshan Roy, Navaneeth M S) received the mentoring and support from International\nCentre for Free and Open Source Software (ICFOSS)\n.\nMoU's\nMoU between EMC and MBCET\nAn MoU has been signed between EMC and MBCET on\n6 January 2023\nfor promoting the industry-academic interaction activities and to help achieve academic excellence of the Department of Electrical and Electronics Engineering, and to conduct joint/collaborative research and consultancy in the areas of Electric Vehicles and E-Mobility and promote Energy Conservation and Environmental Protection through such activities.\nMoU between SPACELABS and MBCET\nAn MoU has been signed between SPACELABS and MBCET on\n5 July 2022\n. The Spacelabs is a software firm established in Kerala and engaged in offering software products and services with operations in India and represented by its duly authorized representative, Ms. Sheela D S , CEO. purpose of this MoU is to use the expertise of the faculty of the MBCET and engage a dedicated qualified person for the research-oriented activities.\nMoU between CDAC (T) and MBCET\nAn MoU has been signed between CDAC (T) and MBCET on\n27 May 2022\n. The purpose of this MoU is to formally express the mutual wish of MBCET and C-DAC (T) to associate in the studies and research in the subject areas of Cyber Security and Forensics, Cyber Law, Software Technologies, Cloud Computing, GIS Technology, 5G Networks, Power Electronics, Energy Systems, Control Systems and Instrumentation, VEGA Processor and in the efforts of Collaborative Teaching, Research and Development. This is a legally non-binding agreement, which outlines an intention to promote collaboration between the two parties for a socially productive cause. This document would be followed by an Agreement, in future, specifying the areas of collaboration and sharing, which will have the legal binding.\nMoU between Tata Elxsi Ltd. and MBCET\nAn MoU has been signed between Tata Elxsi Ltd. and MBCET on\n25 February 2022\n. The main objective of this MoU is to build a strong and mutually fruitful relationship between TE and MBCET. The primary goals are to develop and foster strategic linkages with MBCET and the departments at TE, to assist the students and enhance their knowledge about the latest technologies in which TE is involved with a view to make them productive from the first day of their employment and to understand the needs and expectations of both the parties and to identify the measures required to meet requirement therein. Planned activities include technical presentations and talks, Projects for Undergraduate and Post-graduate students, Lab visits, Technical and Soft-skill trainings, and Placement of Competent students.\nInitiatives for this collaboration has been taken by the Department of EEE under the guidance of Dr. S Ushakumari, Professor, EED and Dr. Nisha G. K, HoD, EED and with the support of Vice Principal, Dr. Viswanath Rao and Principal, Dr. Abraham T Mathew. Ms. Shyju Susan Mathew was given charge to coordinate the activities and be the Point of Contact.\nMoU between Vydyuthi Energy Services and MBCET\nOn 3 December 2020, the IET MBCET On Campus crossed a new milestone, with the signing of the MoU between MBCET and Vydyuthi Energy Services (VES) for the collaborative venture of IET Outreach 150.\nMoU signed with Vydyuthi Energy Services\nMoU between KILA and MBCET\nThe IET Team visited the Kerala Institute of Local Administration – KILA Director General on 23 December 2020) and discussed about MBCET-KILA collaboration for Outreach 150. The idea was approved, and extended willingness for working together with MBCET. An MoU has been signed between MBCET and KILA on this regard on 19 March 2021.\nMoU between LNCPE and MBCET\nAn MoU between the MBCET and LNCPE was signed on 12 March 2019 to conduct 2-day FIRST INTERNATIONAL MEET on Applications of Engineering in Sports, NEXUZ’19 – The International Meet, in the month of August 16 &17 2019\nFaculty Interactions with outside world\nDr. Nisha G K ,\nProfessor, EEE Department served as session chair for the International Conference on Applied Mechanics & Optimisation\n(ICAMeO-2025)\non 29th May 2025.\nDr. Nisha G K ,\nProfessor, EEE Department served as session chair for the AICTE sponsored International Conference on Recent Trends in Energy, Environment , Science and Technology (CREEST- 2025) held @ UKF College of Engineering and Technology on 9th May 2025.\nDr. Nisha G K\nhas been selected as one of the Core Committee Members in the IEEE India Council Industry Academia Young Professionals Committee (IAYPC) 2025.\nEMPOWERING MINDS FOR A VIKASIT BHARATH – FACULTY PARTICIPATE IN PRESTIGIOUS NAAC ROUND TABLE CONFERENCE\nAs part of Janmabhumi’s Grand Golden Jubilee Celebration in Thiruvananthapuram, a high-level Round Table Conference titled\n“Empowering Minds, Enhancing Quality for Vikasit Bharath”\nwas held on April 19 at Udaya Suites.\nDr. Nisha G K\n(Professor, EED & IQAC Coordinator) and\nMs. Deepa P L\n(Assistant Professor, ECE) represented our institution at this significant event that brought together educational visionaries and national-level policymakers.\nThe conference featured\nProf. (Dr.) Anil Sahasrabudhe\n, Chairman of the Executive Committee of the National Assessment and Accreditation Council (NAAC), who also holds key positions as Chairman of the National Board of Accreditation (NBA), Chairperson of the National Innovation Foundation-India, and Chairperson of the National Educational Technology Forum (NETF).\nEminent experts from NCTE, AICTE, and the Department of Higher Education, Government of India, also participated in the discussions.\nThe conference focused on the vision of Vikasit Bharath, exploring collaborative strategies to enhance the quality of teaching and learning, foster holistic student development, and strengthen institutional infrastructure to support the nation’s educational aspirations.\nINDUSTRIAL VISIT BY FACULTY\nDr. Elizabeth Varghese\n, Associate Professor and HoD, EED,\nDr. Nisha G.K.,\nProfessor, EED and IQAC coordinator,\nDr, Soumya A V,\nAssociate Professor, EED,\nMr Aswin\nand\nMr. Midhun G\n, Assistant Professor/s, EED  visited\nHykon india unit 1 Thalore\non 4 March,2025.  The team had a detailed discussion on future collaborations and projects with Hykon R and D team and the Department. The team also visited the factory and production units. Discussions also happened regarding student placements and internship opportunities.\nDr. Nisha G K\n, Professor, EED and IQAC Coordinator has participated in the one-day education conclave on\n“Education for Viksit Bharat: Bharatiya Knowlwedge System and Quality Education in Kerala”\nheld on January 24, 2025 at Maurya Rajadhani, Thiruvananthapuram, Kerala. The conclave was organised by the Central University of Kerala, Vidhyabyasa Vikasa Kendram and the Chamber of Kerala Colleges.\nDr. Shalu George,\nAssociate Professor in the Electrical Engineering Department (EED), and Yash Chhalotre from S4 EL attended the inauguration of the IPR Centre and Startup Cell organized by APJ Abdul Kalam Technological University on June 19, 2024, at Mascot Hotel in Thiruvananthapuram. Yash Chhalotre served as one of the Technical Volunteers for the event. Dr. Shalu George was one of the 50 invited faculty members from the university’s affiliated colleges.\nDr. Nisha G K\n, Professor, EEE Department served as session chair for the IEEE International Conference on E-mobility, Power Control and Smart Systems (ICEMPS)18-20 April 2024.\nDr. Ushakumari S\n., Dean Corporate Relations and Professor, EED, MBCET was invited as resource person to deliver expert lecture in ‘Need for Value Education’ and ‘Holistic Transformation of Human being’, on 8 and 9 January 2024, as part of the Short Term Training Programme on “Recent Research Trends in Green Energy Technologies”, organized by Centre of Sustainable Development in collaboration with the Department of Mechanical Engineering and Department of Civil Engineering, College of Engineering Trivandrum.\nIn connection with the visiting faculty programme in the Dept. of Electrical Engineering, College of Engineering Trivandrum,\nDr. Elizabeth Varghese\n, Associate Professor and HoD, EED delivered lectures on “Modelling and Control of Fractional Order Systems” on 13, 18 and 19 December 2023.\nDr. S. Ushakumari\n, Dean, Corporate Relations and Professor, EED was invited as the Resource person for the Student induction program on Universal Human Values for Mechanical Engineering on 19, 21 and 31 October 2023 and for Electrical Engineering on 14 and 21 October 2023 at College of Engineering Trivandrum.\nDr G K Nisha\n, Professor, EED participated in the inauguration session of IEEE Kerala Section’s 40th Anniversary Celebrations at Mascot hotel on 10 December 2023.\nDr. Soumya A V and Mr. Aswin R B\n, Assistant Professors, EED along with 43 students from S5 EE visited Kerala Electricals and Allied Engineering Co Ltd (KEL) Mamala on 08  December 2023.\nMs. Manju Sreekumar and Ms. C. Sojy Rajan\nalong with second-year students of Department of Electrical and Electronics Engineering visited the Milma production unit, Thiruvananthapuram Dairy at Ambalathara on 27 November 2023 to get an idea about the stages of milk production process when Milma opened its unit as part of the National Milk Day celebrations on November 26 and 27, commemorating the 102\nnd\nbirth anniversary of Verghese Kurien, the Father of the White Revolution in India to the public.\nDr. Nisha G K\n, Professor, EED attended the Kerala Leadership Summit, a gathering of women leaders from different industries and government organisations, organised by IEEE WiE Kerala Section as part of WiECON-ECE’23 on 26 November 2023 at Hotel Apollo Dimora, Trivandrum.\nDr. Shalu George K\n., Associate Professor, EED and\nMs. Soumya A V\n., Assistant Professor, EED, along with a group of students of S8 EE visited the National Institute of Speech and Hearing (NISH) on 01 March 2023, as part of the discussion of their project entitled “Smart Ergonomic Office Chair”.\nDr. Shalu George K\n., Associate Professor, EED and\nMs. Soumya A V\n., Assistant Professor, EED, along with\nDr. Nidhi\nM B\n. (Associate Professor, MED),\nDr. Alice Thomas\n(Assistant Professor, CED), and\nMs. Amritha B J\n(Assistant Professor, ECED) attended the one-day Mentor Sensitization Programme conducted as part of the 2-day Camp, ‘Huddle – 2’ of the project “Innovation by Youth with Disabilities (I-YwD)” at the National Institute of Speech and Hearing (NISH) on 24 February 2023\nShyju Susan Mathew\ndelivered a talk on the topic Robot Kinematics on 29 August 2022, as part of the Faculty Development Programme on Control Systems & Robotics, organized by the Department of Electronics & Communication Engineering, College of Engineering, Muttathara.\nDr.Nisha G K\n, Professor and Head, EED, MBCET, delivered a technical talk on Electric Vehicles on 25 May 2022 at 5:45 pm at The Institution of Engineers (India) Hall, Visvesvaraya Bhavan, Thiruvananthapuram.\nShyju Susan Mathew\ndelivered a talk on the topic Introduction to Robotics and its Applications on 04 April 2022, as part of the Faculty Development Programme on Robotics: Control and Applications – Phase I, organized by the Department of Electrical and Electronics Engineering, Mar Baselios College of Engineering and Technology (Autonomous), Thiruvananthapuram.\nDr.Nisha G. K.\n, Professor and Head, EED, MBCET, delivered a talk on Electric Vehicles in the 20th Annual State Students Convention of ISTE, Daksha’22 hosted by Government Engineering College, Kannur on 08 January 2022 from 1.00 pm to 2.30 pm.\nDr.Nisha G. K.\n, Professor and Head, EED, MBCET, handled a session on Electric Vehicles, for the Webinar organized by ISTE Kerala Section on 10 December 2021 at 10:30 am in Google Meet.\nDr.Nisha G. K.\n, Professor and Head, EED, MBCET, delivered a talk on Electric Vehicles in the 20th Annual State Students Convention of ISTE, Daksha’22 hosted by Government Engineering College, Kannur on 08 January 2022 from 1.00 pm to 2.30 pm.\nManju Ann Mathews\ndelivered a talk on the topic “Energy Storage Technology for Renewable Integration” on 18 February 2021, as part of the Faraday talk Series organized by the Department of Electrical Engineering, College of Engineering Thiruvananthapuram.\nJomole Joseph P.\ndelivered an expert talk on “Problem Identification – Design Thinking” for first year students of EEE, MBCET on 8 January 2021, for CE students on 22 January 2021 and for other branches on 27 January 2021, as part of Expert talk session of Life Skill.\nArchana A. N.\ndelivered a talk on “Distribution System Reliability Evaluation” in the Faraday talk Series organized by the Department of Electrical Engineering, College of Engineering Thiruvananthapuram on 21 January 2021.\nF. R. Rejish Babu\ndelivered a talk on “Home Energy Audit” for the NSS volunteers of MBCET on 12 January 2021, as part of a 7-day special camp conducted by National Service Scheme MBCET Unit.\nDr.Nisha G. K.\ndelivered a talk on “PWM and Space Vector Modulation Three Phase Inverters” for S5 students of ECE, MBCET on 5 December 2020 as part of Expert talk session of Power Electronics and Instrumentation.\nShyju Susan Mathew\ndelivered a talk on “Introduction to Robotics and Control” in the Faraday Talk Series organized by the Department of Electrical Engineering, College of Engineering Trivandrum on 24 September 2020.\nElizabeth Varghese\ndelivered a talk on Design of Fractional Order Controllers in the Faraday Talk Series organized by the Department of Electrical Engineering, College of Engineering Trivandrum on 17 September 2020.\nShalu George K.,\nand\nMs. Shyju Susan Mathew\nhandled a session of a 1-day Webinar on Introduction to Robotic Control on 03 July 2020 organized by Department of Mechanical Engineering, Adi Shankara Institute of Technology in association with ASME Students Section.\nDr.Nisha G.K.\ndelivered an expert talk on “Three Phase Transformer” at Marian Engineering College on 20 November 2019.\nDr.Nisha\nG. K.\ndelivered an expert talk on “Finite Element Analysis” for S8 EEE students of MBCET on 15 November 2019.\nDr.Nisha\nG. K.\ngave an expert talk on “Future scope in Electrical Engineering” at Marian Engineering College, Kazhakuttam on 7 August 2019.\nDr.Nisha G. K.\ngave an invited talk on Electric and Hybrid Vehicles at Marian Engineering College on 9th October 2018.\nInteractions in connection with Research\nFaculty:  Dr. Nisha G K\n1\nKTU Ph D Guideship\nName of the Scholar\n:\nMs. Sandhya P (MBCET)\n2\nExternal Doctoral Committee Member for the research scholar under Anna University Chennai\nName of the Research Supervisor\n:\nDr. M  Marsaline Beno\nName of the Scholar\n:\nMr. Saravanan\n3\nExternal Doctoral Committee Member for the NDF research scholar under APJ KTU (2018-19 Even Semester admission)\nName of the Research Supervisor\n:\nDr. Shiny G.\nDr. David Solomon George\nName of the Scholar\n:\nA Gouri\n5\nExternal Doctoral Committee Member for the research scholar under APJ KTU\nName of the Research Supervisor\n:\nDr. Shiny G\nName of the Scholar\n:\nSHANI S J\n6\nInternal Doctoral Committee Member for the Research Scholar under APJ KTU\nName of the Research Supervisor\n:\nDr. Jayakumari J (KTU-F33227)\nName of the Scholar\n:\nMs. Parvathy Prathap\n7\nExternal Doctoral Committee Member for the research scholar under APJ KTU\nName of the Research Supervisor\n:\nDr. MINI V P (KTU-F22138)\nName of the Scholar\n:\nMs. Nikhila M P\n8\nExternal Doctoral Committee Member for the research scholar under APJ KTU\nName of the Research Supervisor\n:\nDr. MINI V P (KTU-F22138)\nName of the Scholar\n:\nMs. Vijayasree G\n9\nExternal Doctoral Committee Member for the research scholar under APJ KTU\nName of the Research Supervisor\n:\nDr. Godwinraj D\nName of the Scholar\n:\nMs. C Sreeja\n10\nExternal Doctoral Committee Member for the research scholar under APJ KTU\nName of the Research Supervisor\n:\nDr Harikumar R\nName of the Scholar\n:\nMs. Monish M\n11\nSubject expert and question paper setter for the Comprehensive Viva voce of Research Scholar Ms. NAMITHA MURALI under the supervision of Associate Professor Dr. Mini V P, Professor, Department of Electrical and Electronics Engineering, College of Engineering Trivandrum\n12\nSubject expert and question paper setter for the Comprehensive Viva voce of Research Scholar Ms. Lekshmi S under the supervision of Dr. Lal Priya P S Associate Professor, Department of Electrical and Electronics Engineering, College of Engineering Trivandrum\n13\nDr. Nisha G K was selected as KTU curriculum Committee member from 2019 to 2021.\n14\nInternal Doctoral Committee Member for the Research Scholar under APJ KTU\nName of the Research Supervisor\n:\nDr. Sheryl Arulini A (KTU-F42539)\nName of the Scholar\n:\nMs. Rinku R S\nFaculty: Dr. Shalu George K\nInternal Doctoral Committee Member for the Research Scholar under APJ KTU\nName of the Research Supervisor   :  Dr. G K Nisha\nName of the Scholar                           :  Ms. Sandhya P (MBCET)\nIndustry-Institute collaboration Initiatives\nThe Department of EEE has initiated an EV Research cell. For its activities, collaboration with different companies and agencies such as Vydyuthi Energy Services, Charge MOD, Energy Management Centre (EMC) has been initiated. The Research Cell aims to create awareness about e-mobility, EV Technologies and enhance R&D works and career opportunities for faculty and students in this emerging area. Planned activities include internship, workshops, STTPs, project support to the student project groups with support from Faculty, Industrial experts and Domain experts, which may open the base for major projects and research later. The final objective of the cell is to develop an EV model and a charging station in the campus by Faculty and students. Ms. Jomole Joseph was given charge to coordinate the activities and be the Point of Contact with the collaborating industries/Agencies. The team includes Dr. Nisha G K, Ms. Archana A N, Ms. Shilpa George and Mr. Ajish Ashok under the guidance and support of Vice Principal, Prof. Viswanath Rao and Principal, Dr. Abraham T Mathew.\nThe Institution is paving the path ahead for the students in Electric Vehicles by setting up an Electric Vehicle (EV) Skill Development Lab on the campus as a part of the Kerala Electric Vehicle Community initiative. By promoting EV capacity-building programs among the faculties and students, the college is set to be a role model in the education sector in preparing future graduates to be a #SustainableArmy to fight against climate change. Vydyuthi Energy Services in association with Chargemod delivered an E-Rickshaw for the lab as a part of their EV Community Development Program initiative.\nInternship Programmes and Activities\nJuly 2024 – February 2025\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\n(July 2024 – February 2025)\nSUMMARY SHEET\nSl No\nBatch & Class\nTotal number of students who attended internships during the AY 2022-’23\nTotal strength of the class\nPercentage\n1\n2024 -’28 Batch EE\n0\n58\n0.0\n2\n2024 – ’28 Batch EL\n0\n63\n0.0\n3\n2023 -’27 Batch EE\n30\n62\n48.4\n4\n2023 – ’27 Batch EL\n34\n62\n54.8\n5\n2022 -’26 Batch EE\n14\n48\n29.2\n6\n2022 – ’26 Batch EL\n17\n43\n39.5\n7\n2021-’25 Batch EE\n1\n50\n2.0\nOverall Percentage\n96\n386\n24.9\n2021-’25\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2021-’25\nCLASS:\nEE\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\nYBI Foundation\n6/6/2024-20/6/2024 & 15 days\nAdarsh H.\n1\n2022-’26\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2022-’26\nCLASS:\nEE\nSl No\nIndustry/Organisation\nDates of internship programme and no of days\nNames of the students attented\nTotal number of students attended\n1\nKSEB:- Transformer maintainance and repairing unit, Thirumala\n1/7/24 – 5/7/24 (5 days)\nMerlin Raji\n1\n2\nKSEB Substation,Paruthippara\n8/7/24 – 12/7/24 ( 5 days)\nRonn Koshy, Athul Krishna P, Madhav Madhusoodan,Aaron Joseph\n4\n3\nKSEB 110 KV Substation,\nThirumala, TVM\n01-07-2024 to 05-07-2024\n(5 days)\nJaish J S, Karthik K, Thejas Krishna A L,\nVaishnav K\n4\n4\nKSEB 110KV Substation,\nMedical College, TVM\n02-07-2024 to 06-07-2024\n(5 Days)\nDevika B A, Rohith Babu S, Sachith S Santhosh, Sriparvathi SP,  Suryanarayanan S\n5\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2022-’26\nCLASS:\nEL\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\nVSSC Thiruvananthapuram\n9/12/24 – 23/12/24 (11 days)\nRachel Antony P\n1\n2\nRevertech IT solutions\n4/01/2025 – 8/01/2025\nSrevya S Deep, Thamanna Prasanth, M S Manas,Mohammed Afroz,Tiya Mathew,Sourav V Nair, Ujwal Reji\n7\n3\nKeltron\n9/12/14-16/12/24\nAdithya S Pillai,Anand S Ganesh,Berni Albert,Dhanush Krishnan A U,Kurias Mathew,Nanda V S,Niranjan B,Philip B George,Vishak B Shrinivas\n9\n4\nLogicPlum\n4/12/2024-31/12/2024\nMilan S\n1\n2023-2027\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2023-2027\nCLASS:\nEE\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\n110KV Substation, Paruthippara\n27-11-24 to 02-12-2024                 (5 days)\nAkshitha Mohan R V,Bhagya R Nair , Arpitha R N, Anna Koshy,Anupama M , Shreya Ann Jacob\n6\n2\nKSEB 110kV SUB-STATION (PARUTHIPPARA)\n17/12/24 to 21/12/24 (5 Days)\nAadhikesh S, Deepak N.S.,Feba Maria Nelson, Gautham Krishna M, Lesin Lama Levan, Udit Krishna\n6\n3\nKSEB 110kV SUB-STATION (PARUTHIPPARA)\n6/12/24 to 11/12/24 (5 Days)\nJonath Vinamsi,Allen Anil,Alin Stanly,Nandana Priya P,Aromal P Nair,Meghna P ,Adith.M\n7\n4\nKSEB 110kV Substation, Medical College\n9/12/2024 to 13/12/2024 (5 Days)\nD Maheshwar, Dheeraj R.S, Festin Fleenton Pereira, Harisaran S.P\n4\n5\nSmart City Thiruvananthapuram Ltd\n26/12/24 – 4/1/25\nChristopher George, Adarshkumar, Pranav B, Anudeep Krishna, Jeevan B\n5\n6\nVizhinjam International Seaport Ltd\n17/12/24 to 21/12/24  (5 days)\nHiran H.       Niranjan B.\n2\nDEPARTMENT OF EEE-INTERNSHIP DETAILS FOR THE ACADEMIC YEAR 2024-’25\nBATCH:\n2023-2027\nCLASS:\nEL\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended\nTotal number of students attended\n1\nAT group at MBCET & IEEE EMBS Kerela Chapter\n1st to 12th July 2024 , 10 days\nSooraj R Pillai, Abhishek J, Hanok, Manuraj\n4\n2\nKeltron\n12th to 26td Dec 2024, 2 weeks\nAdithyan J, Saurav G Nair,\nSooraj R Pillai, Sreeram R Nair,\nAdvaith Renjith\n5\n3\nKeltron\n6th to 12th Dec 2024, 1 week\nPrathyusha N Nair\n1\n4\nKeltron\n10th to 16th Dec 2024, 1 week\nNiranjan Babu J\n1\n5\nEqugit Solutions Technopark\n19th Dec 2024 to 19th Jan 2025, 30 days\nAdithya S Krishna, Shibin S R, Gouri Nandhana\n3\n6\nICT ACADEMY,Technopark\n16th Dec 2024 to 12th Jan 2025,1 month\nAmal S Shafeek,Aneeta Sibi,Anna Susan George,Ardra S,Bhadra G Nair,Hanok Samuel Boban,Jayasree G Kalkura,Manuraj M S,Meenakshi M S,Namitha Mohan\nSabeeh Ahamed P S\n11\n7\n110 KV Substation Paruthippara\n30th Dec 2024 to 3rd Jan 2025,5 days\nAshtami Viswanath,V S Sivapriya\n2\n8\nKELTRON\n09-07-2024 TO 15-07-2024\nDhiya K., Deepthe S. ,Ryan Mathew Mannual,Aman Khan,Abraham Jacob\n5\n9\nALGOL SOFT TECH PRIVATE LIMITED\n2.12.24 to 14.12.24\nArdra S & Bhadhra G Nair\n2\nDEPARTMENT OF EEE\nINTERNSHIPS MORE THAN ONE WEEK FOR THE ACADEMIC YEAR 2024-’25  (July 2024 to February 2025)\nSl No\nIndustry/Organisation\nDates of the Internship Programme & no of days\nNames of students attended and Semester\nTotal number of students attended\n1\nYBI Foundation\n6/6/2024-20/6/2024 & 15 days\nAdarsh H. – S7 EEE\n1\n2\nAMAZON WEB SERVICES\n8-07-2024 to 04 Sep 2024   & 1 month\nVarsha Rachel George,Rachel Antony,Sinta Maria Richard,Santra Anna Richard,Josna Jomon (S5 EL)\n5\n3\nAT group at MBCET & IEEE EMBS Kerela Chapter\n1st to 12th July 2024 , 10 days\nSooraj R Pillai, Abhishek J, Hanok, Manuraj,V.S Sivapriya,Ashtami Vishwanath (S3 EL)\n6\nInternship details of students\nAcademic Year\nTotal number of students who attended internships\n2021-22\n92\n2020-21\n88\n2019-20\n89\nInternship Programmes\nAn introductory webinar session on “Zero-Watt smart energy monitor” was conducted for EEE students by Mr. Ansha Naji, Senior Manager, Business Development, NTPC and Technical Head, Alpha Geek Enterprises on 12/02/2022 from 10:45 am – 11:30 am. This was held as a part of the internship program on “Zero-Watt Technology” to be offered by Alpha Geek for EEE students. The interns will get an extensive exposure to the technical, business and marketing aspects for a start-up. Ms C. Sojy Rajan, Assistant Professor, EED was the coordinator of the event.\nA 5-day internship programme on Motion Control using LabVIEW was conducted from 17/07/18 to 21/07/18. Mr. Shino G. Babu, TIERA Trivandrum was the resource person. 24 students successfully completed the programme. The programme was coordinated by Ms. C. Sojy Rajan, Assistant Professor.\nConsultancy\nConsultancy details for academic year 2024 – 2025\nProject Title\nDuration\nFunding Agency\nAmount\nSpace Avionics Test and Evaluation Laboratory\n1 year\nVSSC\n44,000\nElectrical Maintenance Cell\n1 year\nMBCET\n1,44,000\nTotal Amount\n188,000/-\nCompleted Consultancy Work:\nThe Department of Electrical and Electronics Engineering has completed an industry sponsored research consultancy project, the details of which are as follows.\nTitle\n:\nOrbital Debris Propagation and Proximity Awareness\nClient\n:\nTHESPACELABS\n, Thiruvananthapuram (Ref. No.: MBT/PO/EED-RC/2022)\nDuration\n: 6 months\nProject Coordinator\n: Dr. S Ushakumari, Dean Corporate Relations\nResearch Assistant\n: Ms. Amala Justin\nProject in-charge\n: Ms. Elizabeth Varghese, Assoc. Professor, Dept. of Electrical and Electronics Engineering, Mr. Aswin R B, Assistant Professor, Dept. of Electrical and Electronics Engineering.\nProject cost\n: Rs. 2 Lacs\nVision\nTo be a Centre of Excellence in Electrical & Electronics Engineering Education, Research and Application of knowledge to benefit the society at large.\nMission\nTo mould quality Electrical Engineers, fostering creativity and innovation to address global issues.\nBoS\nDepartment Advisory Board\nThe People\nFacilities\nNews and Events\nActivities\nConferences\nWorkshops & Seminars\nResearch & Consultancy\nPlacement\nB. Tech PEOs, POs & PSOs\nOpportunities\nCurriculum & Syllabus\nTime Table\nVideo Lectures\nFormer HODs\nDepartment Google Site"
}