{
    "filename": "mbcet.ac.in_faculty_ms-ruby-maria-syriac_.html",
    "content": "Ms. Ruby Maria Syriac – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nMechanical Engineering\n>\nMs. Ruby Maria Syriac\nEmployee Code / ID No.\n10613041\nQualifications\nM.Tech\nOrcid ID\nttps://orcid.org/0000-0001-5878-8417\nIndustry / R & D Experience\nIndustry:Structural Engineer in Aries Marine Sharjah from Sept 2007 to Feb -2009\nR&D: Research Scholar in CUSAT from Nov 2018 onwards\nEmail ID\n[email protected]\nAlternate E-mail ID\n–\nMobile No (Optional) / Intercom Extension No.\n–\nAreas of Interest / Current Research\nFinite Element Analysis, Composites\nResearch,  Consultancy, Publication\nRuby Maria Syriac, A.B.Bhasi, Y. V. K. S.Rao, Parametric responses of carbon-epoxy composite with delamination using cohesive gap element , Materials Today: Proceedings, Elsevier.DOI: 10.1016/ j.matpr. 2021. 07.316.\nRuby Maria Syriac, A.B.Bhasi, Y. V. K. S.Rao, A review on characteristics and recent advances in piezoelectric thermoset composites, AIMS Materials Science, 7 (6): 772–787. DOI: 10.3934 /matersci. 2020.6. 772.\nRuby Maria Syriac, A.B.Bhasi, Structural Health Monitoring of Smart Composites: A Review’, Green Buildings and Sustainable Engineering, Springer Transactions in Civil and Environmental Engineering, pp 49-59,2018.\nMinnu S, Ruby Maria Syriac, Analysis of dynamic behavior of a pre-stretched circular hyper elastic membrane with finite deformation at International Conference on Technological Advancements and Green Governance, 2014 (ICTAGG ‘14), Sivaji College of Engineering, Manivila.\nMinnu S, Ruby Maria Syriac, Effect of pre-stretch on circular hyper elastic membrane with finite deformation National Conference on Futuristic Technologies in Mechanical Engineering, 2014 (NCFT 14), MBCET, Trivandrum,pp 16-25.\nAkashRajan, Minnu S, Ruby Maria Syriac,  Jayaraj Kochupillai “Effect of lateral pressure and pre-stretch on a annular circular hyper elastic membrane with finite deformation“ Paper ID:376, International Conference on Theoretical, Applied, Experimental and Computational Mechanics 2014 ( ICTACEM ) , IIT Kharagpur.\nAkash Rajan, Viji B Vijayan, Ruby Maria Syriac, Jayaraj Kochupillai, Effect of tank wall flexibility on the modal characteristics of fluid solid tank Structures, Paper ID: 409, International Conference on Theoretical, Applied, Experimental and Computational Mechanics 2014 ( ICTACEM ) , IIT Kharagpur.\nViji B Vijayan, Ruby Maria Syriac, Finite Element Analysis of Fluid Solid Tank Structures, International Conference on Technological Advancements and Green Governance, 2014 (ICTAGG ‘14), Sivaji College of Engineering, Manivila.\nViji B Vijayan, Ruby Maria Syriac, Finite Element Analysis of Fluid Solid Tank Structures with Slosh, National Conference on Futuristic Technologies in Mechanical Engineering, 2014 (NCFT 14), MBCET, Trivandrum.\nRuby Maria Syriac, Sajikumar K.S, Failure prediction of adhesively bonded single lap joint, National Conference on Technological Trends,2012, CET,Trivandrum.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n–\nAcademic / Professional Outreach Activities\n–\nMembership in Professional bodies/ organizations\nISTE (LM 73158), ISAMPE\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nSecured the highest CGPA in Machine Design at University level (2011) fron Kerala University\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}