{
    "filename": "mbcet.ac.in_faculty_dr-k-muraleedharan-nair_.html",
    "content": "Dr. K Muraleedharan Nair – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAbout Us\n>\nDr. K Muraleedharan Nair\nDr. Muraleedharan Nair K. secured B.Tech in Mechanical Engineering from TKM College of Engineering. He then joined the Central Power Research Institute (CPRI), gaining significant experience in the field of Energy Audit and Management. He obtained M.Tech in Propulsion Engineering from College of Engineering, Trivandrum. He further honed his expertise by pursuing Ph.D in Thermal and Fluid Science at the prestigious Indian Institute of Technology (IIT) Kanpur and dedicated six years to research and development, focusing on innovative projects. He secured the Best Paper Award at the 5th International and 41st National Conference on Fluid Mechanics and Fluid Power, held at IIT Kanpur in 2014. He is a KTU approved Ph.D supervisor and his research interests include advanced topics such as flow-induced oscillations, aero acoustics, and LES. He has several national and international conference and journal publications in these areas and extensive experience handling funded projects, most notably with the Indian Space Research Organization (ISRO) and Centre for Engineering Research and Development (CERD). He has been a key figure in various national and international conferences, serving on national advisory boards, organizing committees, and as a session and review chair. He was also the organizing chair of ICAMeO-2019 and serves as a subject expert on committees of central level organizations.\nEmployee Code / ID No.\n10616061\nQualifications\nBTech in Mechanical Engineering, TKM college of Engineering\nMTech in Propulsion Engineering, College of Engineering Trivandrum\nPhD in Thermal and Fluid science, Indian Institute of Technology, Kanpur\nOrcid ID\nhttps://orcid.org/0000-0002-0666-2668\nIndustry / R & D Experience\nIndustry-2years ,R&D-6 years,Teaching-15.5 years\nEmail ID\n[email protected]\n,\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9074744097\nAreas of Interest / Current Research\nFlow induced oscillations,Aero acoustics,LES\nResearch,  Consultancy, Publication\nFunded projects\nISRO,Gvt.India\nCERD-Gvt.Kerala\n24  publications\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\nKTU approved supervisor\nAcademic / Professional Outreach Activities\nFunctioned as memeber of National advisory committee ,organizing committee, organizing chair, session chair,reviewer for different Internantional conferences ,subject experts for department promotion, ISRO\nMember of National Advisory Committee AJWTF7-2018\nOrganizing chair-ICAMeO-2019,\nOrganizing Committee member, session  and review chair of  national and international conferences\nMembership in Professional bodies/ organizations\n–\nCommunity Outreach Activities\n–\nAwards / Distinctions / Rank / Other Achievements if any\nBest Paper award  in the 5\nth\nInternational and 41\nst\nNational Conference on Fluid Mechanics and Fluid Power, IIT Kanpur,2014.\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}