{
    "filename": "mbcet.ac.in_faculty_ms-uma-m_.html",
    "content": "Ms. Uma M – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nScience & Humanities\n>\nMs. Uma M\nEmployee Code / ID No.\n10713022\nQualifications\nM.Sc, M.Phil, B.Ed in Mathematics(Pursuing Ph.D)\nOrcid ID\n—–\nIndustry / R & D Experience\n—–\nEmail ID\n[email protected]\nAlternate E-mail ID\n[email protected]\nMobile No (Optional) / Intercom Extension No.\n9497268323, Intercom:702\nAreas of Interest / Current Research\nSpectral Graph Theory\nResearch,  Consultancy, Publication\nFDPs & Conferences attended:\nParticipated in the International Webinar on Applied Mathematics organized by the PG& Research Department of Mathematics, Thiagarajar College, Madurai on 19th to 20 th April 2022.\nParticipated in the Three Days International Level Workshop on Research Methodology Paradigms -SPECTRUM 2022 organized by the Research & Development Cell, St. Francis College, during 11th to 13th April 2022.\nParticipated in the National Webinar on Statistics in Research Data Analysis organized by the Department of Mathematics, Noorul Islam Centre for Higher Education, Kumaracoil on 28th June 2021.\nParticipated in online workshop on Recent Trends in Domination and Graph Labelling (RTDGL 2021) organized by Department of Mathematics, Ramanujan College, University of Delhi in collaboration with Academy of Discrete Mathematics and Applications (ADMA) during 27th to 31st May 2021.\nParticipated in the workshop, Role of Science and Humanities Department in Engineering College, organized by the Department of Science and Humanities of the college on 27th November 2020\nParticipated in the National Webinar on Graph Theory & Problem-Solving Using Sage Math organized by the PG & Research Department of Mathematics, SD College, Alappuzha on 4th to 6th November 2020.\nParticipated in National Level Webinar On “I-STEM: A Gateway for Researchers Stepping Towards AatmNirbhar Bharat organized by Dr. M.G.R Educational and Research Institute, Adayalampattu Phase -II Campus on August 25th, 2020.\nParticipated in National Webinar on ‘Modelling the Invisible Mathematics‘ organized bySt. Aloysius College, Edathua on August 25th 2020.\nParticipated in National Webinar on ‘The Curious Case of Cyber Security’ organized by\nSt. Aloysius College, Edathua on August 22nd, 2020.\nParticipated in Two-Day National Level E-Workshop on Performing Statistical Data Analysis Using Ms Excel organized by Dr. M.G.R Educational and Research Institute, Adayalampattu Phase -II Campus from August 18th to 19th , 2020.\nParticipated in FDP on Mathematics for Engineering Research organized by Sree Buddha College of Engineering, Pattoor, Alappuzha from August 10th to 14th , 2020.\nParticipated in International Webinar Series on Advances in the Mathematical Modelling of Infectious Diseases organized by Mar Ivanios College(Autonomous), Thiruvananthapuram from August 6th to 7th , 2020.\nParticipated in International webinar on Statistics organized by Carmel College, Mala from July 27th to 28th ,2020.\nParticipated in Faculty Development Programme on Outcome Based Education in Higher Education Sector organized by Mar Baselios Institute of Technology & Science& Amal Jyothi College of Engineering from July 23rd to 25th ,2020.\nParticipated in Berchmans Webinar Series in Mathematics on Introduction to Gröbner basis organized by St Berchmans College, Changanassery on July 11th , 2020.\nParticipated in Three-Day International Conference on Productive Mathematical Discourse organized by Christ Nagar College, Maranalloor, Thiruvananthapuram from August 3-5, 2020.\nParticipated in Five Day FDP on “Engineering Next-Gen Materials”  organized by  the Department of Science and Humanities, Mar Baselios College of Engineering & Technology, Thiruvananthapuram from June 18-22, 2024.\nParticipated in Five Day FDP on “Algebraic Structures” organized by the Research Department of Mathematics, Nesamony Memorial Christian College, Marthandam from December 16-20, 2024.\nParticipated in two days International Conference  on “Algebraic Graph Theory, Graph Theory and Topology” organized by the Research Department of Mathematics, Nesamony Memorial Christian College, Marthandam from January 09-10, 2025.\nPaperpresentations:\nPresented a paper titled “The Laplacian Energy Cayley Graphs” in the  International Conference on AI – Powered Approaches to Graph Theory and Applications (INAIGA-2025) on 28 May 2025.\nPresented a paper titled “A study on energy of graphs from groups” at the International Conference of Networking and Computer Application (ICNCA 2023),  NICHE  on 5th May 2023.\nPresented a paper titled “Energy of Cayley Graph” in the 2nd International Conference on Advanced Information Science and Computing Systems (ICAISCS) organized by the Department of Computer Science and Applications, Christ Nagar College, Maranallor, Trivandrum on 28 January 2023.\nPh.D Research Guidance ( Research Scholar, E-mail ID, Research Topic/ Tentative Thesis Tittle)\n—–\nAcademic / Professional Outreach Activities\n—–\nMembership in Professional bodies/ organizations\n—–\nCommunity Outreach Activities\n—–\nAwards / Distinctions / Rank / Other Achievements if any\nGot selected for Ph.D in Mathematics at Noorul Islam Centre for Higher Education, Kumaracoil, Tamil Nadu\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}