{
    "filename": "mbcet.ac.in_departments_civil-engineering_facilities_.html",
    "content": "Facilities – Mar Baselios College of Engineering And Technology\nSkip to content\nHome\n>\nDepartments\n>\nCivil Engineering\n>\nFacilities\nFacilities\nLaboratories\nResearch & Development  Lab\nThe primary testing facilities in the Research and Development Lab consist of a Systronics Water    Analyzer 371 which measures pH, Dissolved oxygen, Salinity\n, Conductivity, Colorimetric a\nnd Turbidity in water sample, an FTIR Spectroscopy to do chemical characterisation  of different materials such as bitumen, cement, oils, etc., a Brookfield viscometer for determination of viscosity of binders.\nPG Labs\nThe P.G. Lab includes the Dynamics Laboratory and the Experimental Stress Analysis and Computational Laboratory. The primary testing facility in the Dynamics Laboratory consists of the horizontal and vertical shake tables for dynamic testing of Structures. Modern instrumentation, including a multi-channel computer controlled data acquisition systems, is available for measurement and data collection. The laboratory is also equipped with accelerometers, and numerous experimental models. The Experimental Stress Analysis and Computational Lab consist of a 100T loading frame, 100T Universal Testing Machine and other related equipments.\nSurveying Laboratory\nThis laboratory helps the students to gain basic and advanced knowledge, and hands-on experience on the usage of various surveying and levelling instruments. The available instruments include Total Station, Transit Theodolite, Dumpy Level, Automatic Level, Plane Table, Prismatic Compass, Subtense Bar, and other accessories such as plane table accessories, levelling staff, cross staff, chains, measuring tapes, ranging rods, offset rods etc.\nStrength of Materials Lab\nThis lab deals with the testing of properties of various materials like brass, mild steel, torsteel, aluminum etc. The machineries include 400kN capacity Universal Testing Machine (UTM), Torsion Testing Machine, Izod and Charpy Impact Testing Machines, Brinell and Rockwell Hardness Testing Machines, Spring Testing Machine for both open and close coiled springs, Torsion Pendulum etc.\nConcrete Lab\nThis lab is of utmost importance for a Civil Engineering student as it deals with the testing of various construction materials such as cement, aggregates, concrete (both fresh and hardened), tiles and bricks. the various apparatus set up in the concrete lab are air permeability apparatus, Vicat apparatus, Le Chatelier’s apparatus, slump cone, compaction factor apparatus, Riffle sample divider, length gauge, thickness gauge, is sieves for sieve analysis of cement and aggregates etc. the machinery includes a 2000kN capacity compression testing machine, 100 kN flexure testing machine, tile testing machine, vibrating table for compacting specimen etc. Other accessories include compressometer, concrete penetrometer, moulds, cuboids, cylindrical & beam, weighing pans, platform type weigh balance, cylindrical measures, tamping rods etc.\nSoftware Lab\nThe Civil Engineering Department has an excellent air conditioned Software Laboratory with power back up. The lab is intended to provide state-of-the-art training for students in drafting, modeling and analysis packages. The lab is provided with licensed versions of AutoCAD 2008, Auto CAD inventor 2008, STAAD PRO and ANSYS 11.0. The lab gives training on programming languages like C and C++ also.\nGeotechnical Lab\nThe Geotechnical Lab of Civil Engineering Department is well equipped with the latest testing facilities for determination of strength and compressibility characteristics of service. The laboratory has the following testing facilities: Specific Gravity and Moisture Content Test, Field Density and Void Ratio Test, Sieve Analysis, Hydrometer Analysis, Atterberg Limits, Permeability Test, Compaction Test, Consolidation Test, Unconfined Compression Test, Direct Shear Test, Vane Shear Test, California Bearing Ratio (CBR) Test.\nTransportation Engineering Lab\nThe testing of highway materials viz bitumen and aggregates is essential for ascertaining its suitability in road construction. The Transportation Engineering Laboratory has facilities for testing the various properties of both aggregate and bitumen. The tests carried out for aggregates include Crushing Strength, Impact Test, Specific Gravity of Aggregate, Angularity Number etc. The tests on bitumen include Ductility Test, Softening Point Test, Penetration Test, Specific Gravity Test, etc. The Lab has facilities also for performing the California bearing ratio (CBR) test.\nEnvironmental Engineering Lab\nThe Laboratory has sophisticated equipments to analyze pollution parameters in water and waste water. The facilities include pH meter, Desiccators, Water bath, Hot Air Oven, Muffle Furnace, Spectrophotometer, BOD Incubator, COD Digestor, Conductivity Meter, Naphelometer, Analytical Balance, Electronic Balance, Jar Test Apparatus, Hot Plate, Muffle Furnace, Magnetic Stirrer, etc. It is being planned to have state-of-the-art instruments so as to cater to the needs of the Post Graduate Students and Faculty Members for carrying out Advanced Research and Consultancy Work in the area of Environmental Engineering.\nGeology Lab\nThe Civil Engineering Department is well equipped with a geology lab that showcases various types of rocks, geological maps and various still models. This laboratory helps the students to recognize various earth materials, features, and structures, identification of common rocks and also topographic features.\nDepartmental Library\nThe library of the Civil Engineering Department plays a key role in maintaining a vast collection of books related to various streams of Civil Engineering. The Department Library forms the backbone for the advancement of consultation and research work in the department. The library preserves a good collection of text books, reference books, project reports, IS codes, etc. The Department Library works hand in hand with the main library of the College. The facilities available in the Department Library are utilized effectively by the Faculty Members and students.\nSeminar Hall\nThe department has a seminar hall facilitated with the latest technology and well-equipped with multimedia projectors and audio-video amenities, named after the famous architect, Laurie Baker. With a seating capacity of 100, the seminar hall is regularly used for class interactions, meetings, national and international conferences and teacher-student training programs. The back-up facility in the seminar hall enables smooth functioning of seminars and conferences.\nCivil Engineering Workshop\nThe civil engineering workshop acts as the baby steps towards understanding the opportunities of civil engineering. Here the newly admitted students are introduced to the basic concepts of civil engineering by giving hands on experience in setting out of a building, computing the area and volume of various components of buildings, construction of walls, testing of building materials etc.\nPlumbing Lab\nThe Civil Engineering department has a Plumbing Lab set up in association with IPA (Indian Plumbing Association).  The Plumbing Lab aids in providing basic skill training on plumbing technologies and operations to students to enhance their practical knowledge.\nLABORATORY\nFACULTY IN-CHARGE\nTECHNICAL STAFF IN-CHARGE\nSURVEYING LAB\nMr. SIJO M. SAJI\nG314\nMs. RENCHUMOHAN.R\nG103B\nSTRENGTH OF MATERIALS LAB\nMs. JEAN MOLLY SIMON\nG201\nMs. VIDYAMOL S\nG104 A\nCONCRETE LAB\nDr. MINU ANN PETER\nG204B\nMs. REJI S\nG104 B\nSOFTWARE LAB\nDr  ARCHANA J. SATHEESH\nG204B\nMr. ARUN J\nG208\nGEOTECHNICAL LAB\nMs. DIANA ALICE SUGUNAN\nG204B\nMs. DHANALEKSHMI.MC\nG102\nTRANSPORTATION ENGINEERING LAB\nMr. AMAL RAJ\nG314\nMr. VIJIN V J\nG202\nTRANSPORTATION PLANNING & TRAFFIC  ENGINEERING LAB\nMs. ANUPAMA KRISHNAN\nG214\nMs ASWANI A J\nG101\nENVIRONMENTAL ENGINEERING LAB\nMs. SANGEETHA SAJEEV\nG214\nMr. EDWIN ROY E J\nG204\nMICRO BIOLOGY LAB\nMs JISA JOSE\nG214\nMs ANJITHA RAJAN\nG 102\nCIVIL ENGINEERING WORKSHOP (MANUFACTURING & CONSTRUCTION PRACTICES LAB)\nMs. RINTU JOHNSON\nG314\nMr. SARATH KUMAR S\nG107 A\nPLUMBING LAB\nMs.  RADHIKA  P\nG 204 B\nMr SARATH KUMAR S\nG107 A\nGEOLOGY LAB\nMs. INDHU LUKE\nG201\nMs. ASWANI A J\nG 101\nSTRUCTURAL ENGINEERING AND DYNAMICS LABORATORY\nDr. ANUPAMA KRISHNA D\nG314\nMr. JOHNSON GEORGE\nG106\nRESEARCH & DEVELOPMENT  LAB\nDr. NEETHU ROY\nG 310\nVision\nTo be a Centre of Excellence in Civil Engineering education with a global perspective, creating ethically strong engineers for the service of society.\nMission\nTo provide Engineering Education which can create exemplary professional Civil Engineers of high ethics with strong conceptual foundation coupled with practical insight, to serve the industry and community.\nBoS\nThe People\nDAB\nFacilities\nNews & Events\nAchievements\nActivities\nFaculty Activities\nConferences\nResearch & Consultancy\nB. Tech PEOs, POs & PSOs\nPlacement\nCurriculum & Syllabus\nTime Table\nFormer HoDs"
}