{
    "filename": "mbcet.ac.in_faculty_dr-s-ushakumari_.html",
    "content": "Dr. S Ushakumari – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nAbout Us\n>\nDr. S Ushakumari\nBiodata\n(As on 01 September 2022)\nGeneral details\nName\nDr. S. Ushakumari\nDesignation\nProfessor & Mentor\nDepartment of Electrical Engineering\nPost held\nProfessor & Head, Department of Electrical Engineering, College of Engineering Trivandrum\nDate of Birth\n15.05.1963\nNationality\nIndian\nPositions held after retirement\n1.     Professor & Mentor, Department of Electrical Engineering, Mar Baselios College of Engineering, Trivandrum (01.10.2021 to till date)\n2.    Technical Officer & Project Head, Centre of Excellence in Electric Vehicle, TrEST Research Park, Engineering College P O Thiruvananthapuram 695016 (01.06.2019 to 31.05.2021)\nPermanent address\nUshus, Near Asramam\nEngineering College Post\nThiruvananthapuram – 695 016\nKerala, India.\ne-mail id\n[email protected]\nPhone\nMobile\n94474 77655\nGoogle citations\nhttps://scholar.google.com/citations?user=ls_y_mkAAAAJ\nEducational Qualifications\nDegree\nSubject/\nSpecialization\nInstitution\nUniversity\nYear\nClass\nB. Tech.\nElectrical Engineering\nTKM College of Engg. Kollam\nKerala\nApr –  1985\n1\nst\nclass\nM. Tech.\nControl Systems\nCollege of Engineering Trivandrum\nKerala\nSept – 1995\nDistinct-ion\nPh. D.\nElectrical Engineering\nCollege of Engineering Trivandrum\nKerala\nDec – 2002\nExperience\nPost\nYear\nMonth\n1.         Professor & Mentor, Department of Electrical Engineering, Mar Baselios College of Engineering\n1\n0\n2.        Technical Officer & Project Head, Centre of Excellence in Electric Vehicle, TrEST Research Park, Engg. College P O Thiruvananthapuram\n2\n0\n3.       Professor\n13\n7\n4.       Associate Professor\n5\n2\n5.       Sr. Lecturer/Asst. Professor\n4\n5\n6.       Lecturer\n6\n0\ni.            Assistant Engineer (KSHB)\n0\n6\nTotal\n32\n08\nCurrent Positions held\nAdvisor to UPSC\nResource Person of AICTE on\nUniversal Human Values\n(part of National education policy)\nMargadarshak to AICTE\nTechnical Expert of The Agency for New and renewable Energy Research & Technology (ANERT) Kerala.\nTechnical Expert to Travancore Devaswom Board (Kerala)\nMembership\nin Professional bodies\nLife member ISTE\nLife member & Executive Committee Member of ISSE (Indian Society for Science and Engineering)\nAwards\nNational level: 2\nState level      : 3\nISTE – VKM John National Award for the\nbest Engineering College Teacher\nof Kerala for the year 2014.\nCET-ISTE Research award for\nBest Teacher\nfor the year 2008-2009 instituted by the CET-ISTE award committee\nCET-ISTE Research award for\nBest Teacher\nfor the year 2007-2008 instituted by the CET-ISTE award committee.\nThe paper viz. “Modeling, analysis and simulation of a three-phase permanent magnet brushless dc motor, considering the non-linearity in torque-balance equation” in the All India conference on Intelligent and Efficient Electrical Systems (NCIEES), at PSG College of Technology, Coimbatore, India, January 2001 was adjudged as the\nbest paper\n.\nReceived ISTE-L&T National award for the\nsecond-best M. Tech. Thesis\nin Electrical Engineering – 1995.\nStudents\nguided/being guided\nPh. D. Produced                    : 9\nPh. D. thesis submitted                   : 0\nPh.D.  Ongoing                                  : 3\nResearch Publications\nDetails of publications\nJournal\nConference\nTotal\nNational\n2\n42\n46\nInternational\n36\n53\n89\nTotal\n38\n95\n135\nPatent\nSl. no\nTitle\nStatus\n1\nHigh powered geared electric vehicle\nAwarded\n2\nSolenoid electric bike\nApplication filed\nProjects undertaken\nSl. No\nName of Project\nAmount in Lakh’s\n1.\nCoordinated the project “Design and development of a new test bed to predict the motion of debris near by the body of interest and evolve a solution to avoid collision” of M/s. THESPACELABS, Trivandrum. (Ongoing)\n1.50\n2.\nCoordinated the project on modeling and analysis of high speed Homopolar Inductor Alternator for GTRE (DRDO)\n10.60\n3.\nCoordinated the project on “Setting up of solar power plant in three phases with maximum capacity of 430 kW”, funded by KSEB Ltd. at College of Engineering Trivandrum (completed).\n100.70\n4.\nCoordinated the project RESPOND project for the “Development of position control of piezo-electric actuators and sensors” for VSSC (ISRO) (completed).\n19.60\n5.\nCoordinated the project on Real time expert system associated with thermal power plant for CDAC, Thiruvananthapuram (completed).\n2.00\n6.\nElectrical and Thermal Analysis of a Low Power Homopolar Alternator for Aerospace Applications (GTRE- DRDO)\n9.60\n7.\nMagnetic field Analysis in DC Magnetron Sputtering (ADA – Bangalore)\n10.00\nAdministrative positions held\nAdvisor to Union Public Service Commission (UPSC), New Delhi\nWorked as Professor and Head, Department of Electrical Engineering\nWorked as Member of the Board of Studies of the Faculty of Engineering and Technology of University of Kerala\nDomain Expert of Selection committee of departmental promotion committee of CDAC, Thiruvananthapuram\nMember of the Board of Governors of TKM College of Engineering, Kollam\nChairman of the Doctoral committee of TKM College of Engineering, Kollam\nSubject expert of Kerala PSC\nJournals being reviewed\nElsevier International Journal on Computers and Electrical Engineering (USA).\nAMSE International Journal & periodicals, France.\nInternational journal on Engineering (IJE), Iran.\nIEEE Transactions on Industrial Electronics\nIEEE Transactions on Mechatronics\nSpringer Journal on Pattern Analysis and Applications.\nElsevier International Journal of the Franklin Institute, Philadelphia.\nAsian Journal of Control, Wiley Publications\nPublications\nDetails of journal\nVijayasree, G., Mini, V.P. & UshaKumari, S. Investigation of Magnetic Effect in High-Speed Homopolar Inductor Alternator.\nElectr. Eng. Technol.\n19\n, 3111–3125 (2024).\nhttps://doi.org/10.1007/s42835-023-01774-8\n.\nVijayasree, G., Mini, V., Ushakumari, S., Electrical Analysis of High-Speed Homopolar Inductor Alternator Using FEM, (2024) International Review of Aerospace Engineering (IREASE), 17 (4), pp. 142-151.doi:https://doi.org/10.15866/irease.v17i4.25385\nNamitha Murali, Mini V.P., Ushakumari S. “Design and Implementation of Field Oriented Control Based Permanent Magnet Synchronous Motor Drive for Electric Three-Wheeler”. Journal of power electronics (JPE)-pp.637-648, Vol-23, No.4, April 2023.\nNamitha Murali, Mini V.P., Harikumar R., Mayadevi N., S. Ushakumari . “A Robust Drive Train Controller for an Electric Three-Wheeler” International Review of Automatic control (IREACO-Scopus)-Vol-16, No.1, January 2023.\nBindu S., S. Ushakumari, J. S. Savier “Robust Incrementalised Least-Squares Estimation Method in State Estimation with Phasor Measurement Unit Measurements”, Journal of The Institution of Engineers (India): Series BIEIB-D-20-00417, doi.org/10.1007/s40031-021-00707-1, January 2022\nNamitha Murali, V P Mini, S Ushakumari, “Modified V-Shaped Interior Permanent Magnet Synchronous Motor Drive for Electric Vehicle”, International review on Modelling and Simulation (IREMOS), pp. 439-450, vol. 14, No. 6, December 2021.\nSabna M, Mini V P, S Ushakumari, Mayadevi N, Harikumar R, Vijayasree G, “Inter Turn Short Circuit Fault Analysis of Five-Phase PMSM”, 2021 IEEE 4th International Conference on Computing, Power and Communication Technologies (GUCON), University of Malaya, Kuala Lumpur, Malaysia, Sep 24-26, 2021.\nBindu S., S. Ushakumari, J.S. Savier, “Linear Distribution System State Estimation with Integration of DG”, Technology and Economics of Smart Grid and Sustainable Energy (Springer), doi.org/10.1007/s40866-020-00101-8, January 2021\nVijayasree G, Mini V P, Mayadevi N, Harikumar R, S Ushakumari, “Design and Virtual Development and Performance Study of High-Speed Homo Polar Inductor Alternator”, Proceedings of the 3rd National Aerospace Propulsion Conference NAPC-2020, Dec 17-19, 2020.\nSherine Jesna V. A, Winston Netto, S. Ushakumari, “Nonlinear Adaptive Sliding Mode Control of a Rigid Rotor via Contactless Active Bearing”, International Journal of Mechanical Engineering and Robotics Research (IJMERR), Vol. 8, No. 1, January 2019, pp. 52- 58.\nArlene Davidson and Ushakumari S. “Structured H-Infinity controller for an uncertain deregulated power system”, IEEE Transactions on Industry Applications, DOI: 10.1109/TIA.2018.2866560, vol.55, no.1, pp. 892-906, Jan 2019.\nJino Joy, Ushakumari S., “Regenerative Braking Mode Operation of a Three-Phase H-Bridge Inverter fed PMBLDC Motor Generator Drive in an Electric Bike,” in Taylor and Francis Journal of Electric Power Components and Systems, ISSN: 1532-5008, vol.0, no.0, Dec 2018, pp 1-20.\nJino Joy, Ushakumari S., “Performance Comparison of a Bridge-less Canonical Switching Cell and H-Bridge Inverter with SVPWM fed PMBLDC Motor Drive under Fuzzy Logic Controller,” International journal on Association for Modeling and Simulation for Enterprises (AMSE) (Accepted for publication)\n8.          Jino Joy, S. Ushakumari, “Performance comparison of a Canonical Switching Cell with SPWM and SVPWM fed sensorless PMBLDC motor drive under conventional and fuzzy logic controllers,” in Elsevier International Journal of the Franklin Institute, vol. 354, Issue 14, pp. 5996-6032, August 2017\n9.          Arlene Davidson and Ushakumari S., “H-infinity PID cum RFB Controller for Load Frequency Control of a Deregulated Power System considering the effect of nonlinearities”, International journal of Control theory and applications, International Science Press, vol. 10, no. 6, April 2017, pp. 425-433.\n10.        Jino Joy, Ushakumari S., “Performance Comparison of a Space Vector Pulse Width Modulated Sensor less PMBLDC Motor Drive with Conventional and Fuzzy Logic Controllers,” International Journal of Power Electronics, vol, pp., February 2017.\n11.          Arlene Davidson and Ushakumari S., “Optimal Load Frequency Controller for a Deregulated Reheat Thermal Power System” in Communication and Power Engineering, De Gruyter, Germany, Book chapter published in February 2017 ISBN -978-3-11-046960-8)\n12.         Arlene Davidson and Ushakumari S, “Robust H-infinity loop shaping Controller for Load Frequency Control of an uncertain Deregulated Power System”, AMSE Journal – 2016 – series C: Automatic control (Theory an applications) – vol. 71, No.1, pp 39-51, 2016.\n13.        G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Torque Capability Improvement of Sensorless FOC Induction Machine in Field Weakening Region for Propulsion Purposes,” communicated for publication in Journal of Computers and Electrical Engineering: Elsevier (Accepted for publication)\n14.        G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Effect of Power factor on Torque Capability of FOC Induction Machine in Field Weakening Region for Propulsion Systems,” communicated for publication in Journal of Institution of Engineers (India) Series–B: Springer.  (Accepted for publication)\n15.        Hari Kumar R and S Ushakumari, “Comparison of binary optimisation techniques for real-time management of sustainable autonomous microgrid,” Springer lecture notes in computer Science, Nov – 2016 ISSN-0302-9743.\n16.        Arlene Davidson and Ushakumari S., “H-Infinity Loop Shaping Controller for Load Frequency Control of a Deregulated Power System”, Elsevier Procedia Technology, vol. 25, pp.  775-784 (ISSN 2212-0173), Oct – 2016.\n17.         Hari Kumar R and S Ushakumari, “A novel architecture for data management and control in autonomous intelligent microgrid,” International journal – Elsevier Procedia-Computer Science, vol. 89, pp. 412-421, Aug – 2016, ISSN:1877-0509.\n18.        Ashitha Joy, Jayakumar M. and Ushakumari S., “Modelling and Control of Proton Exchange Membrane Fuel Cell,” International Journal of Control Theory and Applications (IJCTA) no. 8(3), 2015, pp. 1105-1111.\n19.        Hari Kumar R. and S. Ushakumari, “Novel Algorithm for Load Shedding and Reconfiguration of Isolated Microgrid,” International Journal of Applied Engineering Research (IJAER), vol. 10, no. 1 (2015), pp.1242-1249\n20.       Mayadevi N., Vinod Chandra S. S., Ushakumari S, “SCADA Based Operator Support System for Power Plant Equipment Fault Forecasting, “Journal of the Institution of Engineers (India): Series B, Springer, vol.95, issue.3, July 2014, DOI: 10.1007/s40031-014-0117-9\n21.         G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Four Quadrant Operation of Field weakened FOC Induction motor Drive Using Sliding Mode Observer”, Transactions on Engineering Technologies, Springer publication, May 2014\n22.       Mayadevi N., Vinod Chandra S. S., Ushakumari S., “A Review on Expert System Applications in Power Plants,” International Journal on Electrical and Computer Engineering, vol. 4, issue 1, January 2014\n23.       V. P. Mini and S. Ushakumari, “Rotor fault Detection and Analysis of three phase Induction Motor using Fuzzy Logic,” AMSE International Journal on modelling, measurement and Simulation (Accepted for publication) 2013\n24.       G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Performance Study of Field Oriented Controlled Induction Machine in Field Weakening using SPWM and SVM fed Inverters”, International Review of Modelling and Simulations, vol. 6, no. 3, pp. 741-752, Jun 2013.\n25.       G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “FFT Analysis for Field Oriented Control of SPWM and SVPWM Inverter fed Induction Machine with and without Sensor”, International journal of Advanced Electrical Engineering, vol. 2, no. 4, pp. 151-160, June 2013.\n26.       Mini V. P. and S. Ushakumari, “Electrical fault detection and diagnosis of induction motor using fuzzy logic”, AMSE International journal on modelling, measurement and simulation, vol. 55, no.1, October 2012\n27.       A. Lekshmi, Dr. R. Sankaran and Dr. S. Ushakumari, “Simulation and DSP Based Real Time Implementation of Closed Loop Variable Speed Operation of a BLDC Motor Drive System”, International Review on Modelling and Simulations, vol.5, no.5, pp. 2026-2035, October 2012.\n28.       Madhusoothanan K. R. and S. Ushakumari, “Sliding mode control and fuzzy Logic control of Hydraulic Robot Manipulator”, AMSE journal on modelling, measurement and simulation, vol. 67, no.1, October 2012\n29.       G. K. Nisha, S. Ushakumari and Z. V. Lakaparampil, “Online Harmonic Elimination of SVPWM for Three Phase Inverter and a Systematic Method for Practical Implementation”, IAENG International Journal of Computer Science, (IJCS 39:2:10), vol. 39, no. 2, pp. 220-230, May 2012.\n30.       A. Lekshmi, Dr. R. Sankaran and Dr. S. Ushakumari, “Modelling and Simulation of PM Brushless DC Motor Based Spooler Drive System with Speed and Current Feedback”, International Review on Modelling and Simulations, vol.5, no.1, pp. 231-238, February 2012\n31.        A. Lekshmi, R. Sankaran, S. Ushakumari, “Performance Comparison of a Closed Loop PMBLDC Drive System with Hysteresis and Modified Predictive Current Controllers”, AMSE International journal on modelling, measurement and simulation, vol. 84, no. 1, 2011, pp. 73-88.\n32.       Juno N., Gopal Jee, Ushakumari S., “H-infinity Controller Design for the Descent Phase of Reusable Launch Vehicle”, AMSE journal on Advances in modelling, vol. 64, no.1-2, 2009.\n33.       Sharafunnisa K.H, M. Jayakumar and S. Ushakumari, “Fault detection and Isolation in a Speed Control System using parameter estimation and Fuzzy logic”, AMSE International journal on modelling, measurement and simulation, vol. 82, no 1 -2, 2009.\n34.       S. Ushakumari and R. Sankaran, “Development of an advanced controller for improved performance of a PMBLDC Motor”, AMSE Journal on Modelling Measurement and Simulation, France, vol.61, no.2, pp. 34-45, December 2006.\n35.       S. Ushakumari and R. Sankaran, “Modelling and Simulation of PMBLDC Motor Drive System covering Steady State Operation and Optimized Controller Design”, AMSE Journal on Modelling Measurement and Simulation, France, vol.40, no.7, pp. 1-22, December 2004.\n36.       S. Ushakumari, R. Sankaran and P. S. Chandramohanan Nair, “Closed Loop Performance of a Permanent Magnet Brushless DC Motor Incorporating the Non-Linearity in Torque-Balance Equation (Transient Operation),” International journal of Electric Power Components and Systems, Taylor and Francis, Kentucky, USA, vol. 30, no. 12, December 2002.\nDetails of Conference\nVijayasree, G., V. P. Mini, and S. Ushakumari. “Modeling and analysis of a six phase High Speed Homopolar Inductor Machine for aerospace applications.” 2024 International Conference on Communication, Control, and Intelligent Systems (CCIS). IEEE, 2024.\nVijayasree, G., V. P. Mini, and S. Ushakumari. “Loss Analysis of High Speed Homopolar Inductor Alternator.” 2023 International Conference on Circuit Power and Computing Technologies (ICCPCT). IEEE, 2023.\nNamitha Murali, Mini V.P, , S. Ushakumari, “Electric Vehicle Market Analysis and Trends”, IEEE 19th India Council International Conference(INDICON 2022)- pp. 1-6, 2022.\nVijayasree G, Mini V P, Mayadevi N, Harikumar R, Ushakumari S “Design and Virtual Development and Performance Study of High-Speed Homo Polar Inductor Alternator.”3rd National Aerospace Propulsion Conference in research, development and product realization during 17-19 December,2020,BMS College of Engineering Bangalore.\nNamitha Murali, V P Mini, S Ushakumari, Alen Toji Varghese, “Sizing and performance analysis of an electric motor in an e-rickshaw”, IEEE international conference on power system technology (POWERCON), pp 1-6, 2020.\n2.      Namitha Murali, V P Mini, S Ushakumari, “Performance comparison between different rotor configurations of PMSM for EV applications”, IEEE Region 10 conference (TENCON), pp. 1334-1339, 2020\n3.     Bindu S., Dr. S. Ushakumari, Dr. J. S. Savier, “PMU Based State Estimation Assisted Self-Healing of Power System”, IEEE International Conference on Recent Engineering and Technology (ICRET), Bangalore, June 2020\n4.     Bindu S., Dr. S. Ushakumari, “Power System State Estimation with PMU measurements using Trust Region Method”, International Conference on Computing, Communication and Energy Systems (ICCCES), Malappuram, February, 2020\n5.     Mayadevi N, Harikumar R, S Ushakumari, Mini V P, “A Novel Algorithm for Detection and Diagnosis of Switching Faults of Three Phase Induction Motor Drive System” International Conference on Power Electronics, Drives and Energy Systems Conference (PEDES) 2018, Chennai.\n6.     Harikumar R, Mayadevi N, S Ushakumari, Mini V P, “A Laboratory Scale Test-Bed for Demonstrating and Validating Smart Grid Concepts” International Conference on Power Electronics, Drives and Energy Systems Conference (PEDES) 2018, Chennai.\n7.      Mithila A K, S Ushakumari, “Design of Robust Sliding Mode and Fuzzy Logic Controllers for Boost and Buck-Boost Converters”, IEEE International Conference on Intelligent Computing, Instrumentation and Control Technologies (ICICICT), 2017, Vimal Jyothi Engineering College, Kannur ISBN: 978-1-5090-6106-8\n8.     Mithila A K, S Ushakumari, “Comparative Study of Performances of Boost and Buck-Boost Converters with PI and Fuzzy Logic Controllers”, 18th National Conference on Technological Trends (NCTT), 2017, College of Engineering Trivandrum.\n9.     Anupama V Kumar, Gopal Jee, S. Ushakumari, “Tracking Control Strategy for Air-Breathing Hypersonic Vehicles considering Actuator Dynamics”, 18th National Conference on Technological Trends (NCTT), 2017, College of Engineering Trivandrum.\n10.   Abhijith M, Shriram S, S Ushakumari, “Landing Algorithm for a Fixed-Wing Unmanned Aerial Vehicle”, 18th National Conference on Technological Trends (NCTT), 2017, College of Engineering Trivandrum.\n11.     Jino Joy, S. Ushakumari, “Energy Harvestation and Effective Utilization by Regenerative Braking and Motoring Modes of Operation in a PMBLDC Drive System using FLC,” in IEEE International Conference on TENSYMP, July 2017\n12.    Arlene Davidson and Ushakumari S., “Influence of energy storage system on load frequency control of a deregulated power system with consideration of physical constraints”, IEEE – 17th International Conference on Environment and Electrical Engineering 2017 (IEEE-EEEIC 2017), Milan, Italy, pp. 403-408, June 2017.\n13.   Jino Joy, S. Ushakumari, “Performance Comparison of a Space Vector Pulse Width Modulated Sensorless PMBLDC Motor Drive with Conventional and Fuzzy Logic Controllers,” in International Conference on Contemporary Topics in Power Engineering and Aiding Technologies (ICCPEAT), February 2017\n14.   Jino Joy, Ushakumari S., “Performance Comparison of a Canonical Switching Cell Converter fed Sensor less PMBLDC Motor Drive with Conventional and Fuzzy Logic Controllers,” IEEE international Conference on Electrical, Computer and Communication Technologies, vol. 2, pp. 782-790, February 2017.\n15.   Arlene Davidson and Ushakumari S, “H-infinity PID cum RFB Controller for Load Frequency Control of a Deregulated Power System considering the effect of nonlinearities”, Proceedings of the International conference on sustainable computing techniques in engineering science and management (SCESM-2017) Belgaum, January 2017\n16.   Rani Ashok and S. Ushakumari, “Impact Angle Constrained Missile Guidance Law Accounting Autopilot Lag against Targets with Unknown Acceleration”, 17th National Conference on Technological Trends (NCTT-2016), College of Engineering Trivandrum, pp. 937-941, 19-20 August 2016,\n17.    Anjana C. Xavier and S. Ushakumari, “Re-entry Guidance of Hypersonic Vehicles” 17th National Conference on Technological Trends (NCTT-2016), College of Engineering Trivandrum, pp. 942-947, 19-20 August 2016,\n18.   Jetendra kumar Borra, Soumya N and S. Ushakumari, “Modelling and Control of Attitude Coupled Spacecraft Terminal Phase Rendezvous Using On/Off Thrusters” 17th National Conference on Technological Trends (NCTT-2016), College of Engineering Trivandrum, pp. 1127-1132, 19-20 August 2016,\n19.   Arlene Davidson and Ushakumari S., “Structured H-Infinity Controller for an Uncertain Deregulated Power System,” IEEE International Conference on Power Electronics, Intelligent Control and Energy Systems, ICPEICES 2016, 4-6 July 2016, Delhi, pp. 1-5\n20.  Jino Joy and Ushakumari S., “Performance Comparison of a Canonical Switching Cell and SVPWM fed Sensorless PMBLDC Motor with Conventional and Fuzzy Logic Controllers” Proceedings of the national conference on Large Scale Multi-Disciplinary Systems of National Significance (LAMSYS-2016), pp. 112-118, June 2016, SDSC SHAR, Sriharikota, India.\n21.    Jino Joy, Ushakumari S., “Performance comparison of a sensorless PMBLDC motor drive system with conventional and fuzzy logic controllers”, in Proceedings of Elsevier Global Colloquium in Recent Advancement and Effectual Researches in Engineering, Science and Technology (RAEREST), vol. 25, pp. 643-651, April 2016.\n22.  Hari Kumar R and S Ushakumari, “Analysis of feed forward phase locked loop and its tuning using PSO,” Proceedings of the 8th IET international conference on Power Electronics, Machines and Drives (PEMD-2016), Glasgow, Scotland, UK, 19 – 21 April 2016.\n23.  Jino Joy and Ushakumari S., “Performance Comparison of a Sensorless PMBLDC Motor Drive System with Conventional and Fuzzy Logic Controllers”, Global Colloquium on Recent Advancements and Effectual Researches in Engineering, Science and Technology, RAEREST, 22-23 April 2016, Palai, Kottayam.\n24.  Arlene Davidson and Ushakumari S., “H-Infinity Loop-Shaping Controller for Load Frequency Control of a Deregulated Power System”, Global Colloquium on Recent Advancements and Effectual Researches in Engineering, Science and Technology, RAEREST, 22-23 April 2016, Palai, Kottayam.\n25.  Arlene Davidson and Ushakumari S., “Optimal Load Frequency Controller for a Deregulated Reheat Thermal Power System,” IDES International Conference on Advances in Communication, Network and Computing (CNC 2016), Bangalore, India, March 12 – 13, 2016\n26.  Arlene Davidson and Ushakumari S., “H-Infinity Loop-Shaping Controller for Load Frequency Control of an Uncertain Deregulated Power System,” Proceedings of the IEEE International Conference on Electrical, Electronics and Optimization Techniques (ICEEOT 2016), Chennai, March 3 – 5, 2016 (accepted for publication).\n27.  Ashitha Joy, Jayakumar M. and Ushakumari S., “Modelling and Control of Proton Exchange Membrane Fuel Cell,” Proceedings of the XII – Control Instrumentation System Conference, Manipal, Karnataka, India, pp. 286- 295, 2 – 4 November, 2015.\n28.  Arlene Davidson and S. Ushakumari, “Optimal Load Frequency Controller for a Deregulated Non-Reheat Thermal Power System”, Proceedings of the 3rd IEEE International Conference on Control, Communication and Computing, College of Engineering Trivandrum, Kerala, 19-21, November 2015.\n29.  Kesavan M R and S. Ushakumari, “Control of DC/DC Converter connected to MVDC Systems with Constant Power Loads”, Proceedings of 16th National Conference on Technological Trends (NCTT), Trivandrum, pp. 863-868, 09-10 September, 2015.\n30.  Kiran Prakash, S. Ushakumari and R. Lethakumari, “Development of Piezoelectric actuator for accurate positioning of cantilever beam”, Proceedings of 16th National Conference on Technological Trends (NCTT), Trivandrum, pp. 873-880, 09-10 September, 2015.\n31.   Ashitha Joy, Jayakumar M and S. Ushakumari, “Modelling and control of fuel cell systems”, Proceedings of 16th National Conference on Technological Trends (NCTT), Trivandrum, pp. 918-923, 09-10 September, 2015.\n32.  Nobin Paul and S. Ushakumari, “Genetic algorithm-based optimization of PWPF modulator parameters for spacecraft attitude control system employing thrusters”, Proceedings of 16th National Conference on Technological Trends (NCTT), Trivandrum, pp. 924-930, 09-10 September, 2015.\n33.  Hari Kumar R. and S. Ushakumari, “Analysis of feed forward phase locked loop and its tuning using PSO” (Accepted for presentation in the 8th IET international conference on Power Electronics, Machines and Drives, 19-21 April 2016, The Hilton Hotel, Glasgow, Scotland, UK)\n34.  R. Hari Kumar and S. Ushakumari, “A two stage algorithm for optimal management of isolated microgrid,” in Proceedings of IEEE International Conference on Signal Processing, Informatics, Communication and Energy Systems (SPICES), 2015, pp.1-5, 19-21 Feb. 2015.\n35.  Harikumar R. and S. Ushakumari, “Islanded Micro grid Management using Binary Gravitational Search Algorithm,” 9th International Conference on Intelligent Systems and Control (ISCO’15), Karpagam College of Engineering, Myleripalayam, Coimbatore-641032, Tamilnadu, India, 9-10 January 2015.\n36.  Harikumar R. and S. Ushakumari, “Optimal Management of Islanded Microgrid using Binary Particle Swarm Optimization” IEEE International Conference on Advances in Green Energy (ICAGE), Mar Baselios College of Engineering and Technology, Trivandrum, Kerala, 17-18 December 2014, pp. 251 – 257.\n37.  Koshy Thomas, Gopal Gee and S. Ushakumari, “Stability Assessment and Control-law Design of Crew-Capsule Module in Re-entry Phase”, Proceedings of the 15th National Conference on Technological Trends (NCTT 2014), College of Engineering Trivandrum, Kerala, vol.3, pp.680-687, 22-23 August 2014.\n38.  Vishnu N., Harikumar R. and S. Ushakumari, “Design and Control of Renewable Energy Interfaced Grid Connected System”, Proceedings of the 15th National Conference on Technological Trends (NCTT 2014), College of Engineering Trivandrum, Kerala, vol.3, pp.720-725, 22-23 August 2014.\n39.  Reshma U., Soumya N. and S. Ushakumari, “Comparison of Estimation Techniques for Entry, Descent, and Landing Reconstruction”, Proceedings of the 15th National Conference on Technological Trends (NCTT 2014), College of Engineering Trivandrum, Kerala, vol.3, pp.970-976, 22-23 August 2014.\n40. Rajeesh S. K., Lethakumari R. and S. Ushakumari, “Vibration Suppression of Structures using Self Sensing Actuator”, Proceedings of the 15th National Conference on Technological Trends (NCTT 2014), College of Engineering Trivandrum, Kerala, vol.3, pp.1001-1007, 22-23 August 2014.\n41.   Reema N., Mini V. P. and S. Ushakumari, “Switching Fault Analysis of a Three Phase Induction Motor Drive System”, Proceedings of the 15th National Conference on Technological Trends (NCTT 2014), College of Engineering Trivandrum, Kerala, vol.3, pp.1015-1020, 22-23 August 2014.\n42.  Ashima C. R., S. Ushakumari and S. Geetha, “Application of Adaptive Back stepping for the Control of a Reusable Launch Vehicle”, Proceedings of the 15th National Conference on Technological Trends (NCTT 2014), College of Engineering Trivandrum, Kerala, vol.3, pp.758-764, 22-23 August 2014.\n43.  Mayadevi N, Vinod Chandra S. S., Ushakumari S., “Expert System for Power Plant Operator Evaluation, “Proceedings of 4th International Conference on Advances in Computing and Communications – IEEE IACT” pp. 266-269, 26-28 August 2014, Kochi, India.\n44. G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Effect of Leakage inductance on Torque Capability of Field Oriented Controlled Induction Machine in Field Weakening Region”, International Conference on Advances in Engineering and Technology (ICAET’2014), Singapore, 29-30 March 2014.\n45. Hari Kumar R. and S. Ushakumari, “Biogeography Based Tuning of PID Controllers for Load Frequency Control in Microgrid,” in Proceedings of the IEEE International Conference on Circuits, Power and Computing Technologies- ICCPCT-2014, vol. 1, 20-21 March 2014, pp. 797-802\n46. G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Four quadrant operation of sensorless FOC induction machine in field weakening region using MRAS Sliding mode observer”, IEEE International conference on Control Communication and Computing, College of Engineering, Trivandrum, India, vol. 1, pp. 33-38, 13-15 December 2013.\n47.  Mayadevi N., Vinod Chandra S. S. and S. Ushakumari, SCADA Based Expert System for Power Plant Operator Training, CCIIS-2013 – International Conference on Computing Cybernetics and Intelligent Information Systems, Nov 2013, Vellur, Tamilnadu, India\n48. Deepak V. Dev, Rani Radhakrishnan and S. Ushakumari, “Fractional Order PID Controller for Attitude Control of Ascent Phase of Reusable Launch Vehicle,” Proceedings of the 14th National Conference on Technological Trends (NCTT -2013), College of Engineering Trivandrum, Kerala, pp. 102-108, August 2013\n49. Deepak V. Dev, S. Ushakumari, “Modified method of tuning for fractional PID controllers,” Third International conference on Power, Control, Signals and Computation (EPSCICON 2014), Vidya Academy, Thrissur, Kerala, January 2014\n50. Santhi E. Skariya, Baby Sebastian and S. Ushakumari, “Integrated Optimal Control of Reusable Launch Vehicle and Actuation System Using Linear Quadratic Regulator Technique,” Proceedings of the 14th National Conference on Technological Trends (NCTT -2013), College of Engineering Trivandrum, Kerala, pp. 66-73, August 2013\n51.   T. V. Shyama, S. Ushakumari, “Sensorless Vector Control of Induction Motor based on Model Reference Adaptive System,” Proceedings of the 14th National Conference on Technological Trends (NCTT -2013), College of Engineering Trivandrum, Kerala, pp. 132-137, August 2013\n52.  T. V. Shyama and S. Ushakumari, “Vector control of induction motor based on space vector modulation,” Proceedings of the first National Conference on System, Energy and Environment (NCSEE), Govt. College of Engineering, Kannur, pp. 230-235, Aug 2013\n53.  Naveen N., Geetha S. and S. Ushakumari, “Back stepping Control Technique Applied to Discrete Time Systems in Reusable Launch Vehicle,” Proceedings of the 14th National Conference on Technological Trends (NCTT -2013), College of Engineering Trivandrum, Kerala, pp. 233-237, August 2013\n54. G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Sensorless Field Oriented control of SVM inverter fed Induction Machine in Field Weakening Region using Sliding Mode Observer”. World Congress on Engineering, Imperial College, London, pp. 1174-1181, July 2013.\n55. G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “FFT Analysis for Field Oriented Control of SPWM and SVPWM Inverter fed Induction Machine with and without Sensor”, International conference on Advance Engineering Technology (ICAET’13), Mysore, pp. 34-43, January 2013.\n56. G. K. Nisha, Z. V. Lakaparampil and S. Ushakumari, “Sensorless Vector Control of SVPWM Inverter fed Induction Machine using Sliding Mode”, IEEE International conference on Green Technology (ICGT’12), Thiruvananthapuram, pp. 29-36, December 2012.\n57.  G. K. Nisha, S. Ushakumari and Z. V. Lakaparampil, “CFT Based Optimal PWM Strategy for Three Phase Inverter”, IEEE International conference on Power, Control and Embedded Systems, Allahabad, December 2012, pp. 206-211.\n58. V. P Mini and S. Ushakumari “Rotor Fault Analysis of an Induction Motor Using FEM” IEEE International conference on Power, Control and Embedded Systems ICPCES-2012, Allahabad, India, December 2012, pp. 149-155.\n59. Parvathy P., Asha P. Nair and S. Ushakumari, “Nonlinear Inversion via θ-D Control Application to Reusable Launch Vehicle” Proceedings of the 13th National Conference on Technological Trends (NCTT -2012), College of Engineering, Trivandrum, Aug 10-11, 2012, pp. 112-119\n60. Vivek A., Sheelu Jose and S. Ushakumari, “Chattering Free Sliding Mode Control for Re-Usable Launch Vehicle”, Proceedings of the 13th National Conference on Technological trends (NCTT -2012), College of Engineering, Trivandrum, Aug 10-11, 2012, pp. 120-125.\n61.   Hema Prathap, V. Brinda and S. Ushakumari, “Robust Flight Control of a Typical RLV during Re-entry Phase”, Proceedings of the 13th National Conference on Technological Trends (NCTT -2012), College of Engineering Trivandrum, Kerala, Aug 10-11, 2012, pp. 155-162.\n62.  Sherine Jesna V. A. and S. Ushakumari, “Auto-centering control of three pole Active Magnetic Bearing by Sliding Mode Control” Proceedings of the 13th National Conference on Technological Trends (NCTT -2012), College of Engineering Trivandrum, Kerala, Aug 10-11, 2012, pp. 163-169.\n63.  Mayadevi N., S. S. Vinod Chandra and S. Ushakumari, “Failure Forecast Engine for Power Plant Power Plant Expert System Shell”, Proceedings of the IEEE International Conference on ICACCCT, Tamilnadu, India, 23-25, August 2012, pp. 380-384.\n64. Mayadevi N., S. S. Vinod Chandra and S. Ushakumari, “Learning Engine for Power Plant Expert System Shell”, Proceedings of the IEEE International Conference on Electronics Computer technology (ICECT 2012), Kanyakumari, India, 6-8 April 2012, pp. 284-287.\n65. Nisha G. K., S. Ushakumari, Z. V. Lakaparampil, “Harmonics elimination of space vector modulated three phase inverter”, Proceedings of the international Multi conference of Engineers and computer scientists 2012 (IMECS 2012), Hong Kong, 14-16 March 2012, vol. 2, pp. 1109-1115.\n66. Nisha G. K., S. Ushakumari, Z. V. Lakaparampil, “Method to Eliminate Harmonics in PWM: A Study for Single Phase and Three Phase”, Proceedings of the international emerging technological trends in advanced engineering research (ICETT-2012), Mar Baseleos College of Engineering, Kollam, 21-22 February 2012,\n67.  Meera Sivadas, V. R. Lalithambika and S. Ushakumari, “A Novel Approach to Design of QFT based PID Controller for Launch Vehicle Autopilot”, Proceedings of the 12th National Conference on Technological Trends (NCTT 2011), College of Engineering Trivandrum, Kerala, vol.2, pp. 709-715, 19-20 August 2011.\n68. Praveen S. Babu and S. Ushakumari, “Sliding Mode Based Direct Torque Control of Induction Motor Drives”, Proceedings of the 12th National Conference on Technological Trends (NCTT 2011), College of Engineering Trivandrum, Kerala, vol.2, pp. 760-767, 19-20 August 2011.\n69. Mini V. P and S. Ushakumari, “Incipient Fault detection and diagnosis of an induction motor using fuzzy logic”, Proceedings of the IEEE International Conference on RAICS, Trivandrum, Kerala, pp. 459-464, Jul 2011\n70.  Praveen S. Babu and S. Ushakumari, “Direct Torque Control of Induction Motor” Proceedings of the IEEE International Conference on RAICS, Trivandrum, Kerala, pp. 675-681, Jul 2011.\n71.    A. Lekshmi, R. Sankaran and S. Ushakumari, “Performance of a closed loop PMBLDC drive system with modified predictive current controller”, Proceedings of the International Conference on Power, Control and Embedded Systems (ICPCES2010), Allahabad, pp. 1-6, December 1-3, 2010.\n72.  Aswathy Raj, Tessy Elizabeth John and S. Ushakumari, “Adaptive flight control design for aerodynamically controlled launch vehicles” Proceedings of the 11th National and 1st International conference on Technological Trends, vol.3, pp. 877-884, Nov. 2010.\n73.  Pradeep Kennedy K., M. Jayakumar and S. Ushakumari, “Detection of sensor faults in an electro hydraulic actuator”, Proceedings of the 11th National and 1st International conference on Technological Trends, vol.3, pp. 916-922, Nov. 2010.\n74.  Lekshmisree V., D. Karthikeyan and S. Ushakumari, “Longitudinal aerodynamic parameter estimation of reusable launch vehicle using neural network-based algorithm”, Proceedings of the 11th National and 1st International conference on Technological Trends, vol. 3, pp. 901-907, Nov. 2010.\n75.  Praveen S. Babu and Dr. S. Ushakumari, “Hybrid Posicast Based Control of Buck Converter” Proceedings of the 11th National and 1st International conference on Technological Trends, vol. 3, pp. 923-927, Nov. 2010.\n76.  Mini V.P., Setty Sivakotaiah and S. Ushakumari, “Fault detection and diagnosis of an induction motor using fuzzy logic”, Proceedings of the IEEE Region 8 SIBIRCON 2010, Irkutsk, Russia, pp. 459-464, Jul 2010.\n77.  Madhusoothanan K. R. and S. Ushakumari, “Position control of Hydraulic Robot Manipulator with sliding mode control and fuzzy Logic control”, Proceedings of the International Conference on Control, Communication and computing (ICCC 2010), pp. 36 -39, Feb 2010, Kerala, India.\n78.  Madhusoothanan K. R. and S. Ushakumari, “Position control of Hydraulic Robot Manipulator using sliding mode control”, Proceedings of the 10th National Conference on Technological Trends (NCTT 2009), College of Engineering Trivandrum, Kerala, vol.3, pp. 18-23 November 2009.\n79.  Remya Sukumaran and Dr. S. Ushakumari, “fuzzy Logic and Back stepping Control for an Autonomous Robot, Proceedings of the 9th National Conference on Technological Trends (NCTT 2008), College of Engineering Trivandrum, Kerala, vol.3, pp. 18-23 November 2008.\n80. A. Lekshmi, Dr. R. Sankaran, Dr. S. Ushakumari, “Comparison of Performance of a Closed Loop PMSM Drive System with Modified Predictive Current and Hysteresis Controllers”, Proceedings of the 11th International Conference on Electrical Machines and Systems (ICEMS 2008), Oct.17-20, 2008, Wuhan, China, pp. 2876-2881.\n81.   A. Lekshmi, R. Sankaran, S. Ushakumari, “Simulation of Space Vector Theory Based Variable Speed Operation of a PMSM Drive System Using Predictive Current Control”, Proceedings of the International conference on Modelling and simulation MS’07, University of Calcutta, India, vol.2, pp. 528 – 532, December 3-5, 2007.\n82.  Juno N., Gopal Jee and Dr. S. Ushakumari, “H-infinity control design for descent phase of Reusable Launch Vehicle”, Proceedings of the 8th National Conference on Technological Trends (NCTT 2007), College of Engineering Trivandrum, Kerala, vol.2, pp. 1-6 November – December 2007.\n83.  Subha T.G., Vijayamohankumar and Dr. S. Ushakumari, “Design of feedback linearization controller for a re-entry flight control problem”, Proceedings of the 8th National Conference on Technological Trends (NCTT 2007), College of Engineering Trivandrum, Kerala, vol.3, pp. 13-18, November – December 2007.\n84. Sharafunnisa K.H, M. Jayakumar and S. Ushakumari, “Fault detection and Isolation in a Speed Control System using parameter estimation”, Proceedings of the 7th National Conference on Technological Trends (NCTT 2006), College of Engineering Trivandrum, Kerala, vol.3, pp. 7-12, November 2006\n85. Shyju Susan Mathew, Neha Mishra and S. Ushakumari, “System Identification of Servo and Estimation of Slosh States in Launch Vehicle”, Proceedings of the 7th National Conference on Technological Trends (NCTT 2006), College of Engineering Trivandrum, Kerala, vol.3, pp. 1-6, November 2006.\n86. Sheethal Reghunath, S. Ushakumari and A. Lekshmi, “Development of Fuzzy Logic and Neural Network Controllers for a PMBLDC motor”, Proceedings of the 6th National Conference on Technological Trends (NCTT 2005), College of Engineering Trivandrum, Kerala, vol.2, pp. 127-131, November 2005.\n87.  V. S. Sreelatha, M. V. Dekhne and S. Ushakumari, “Control of Rotary Pendulum using Linear Quadratic Gaussian Technique”, Proceedings of the 6th National Conference on Technological Trends (NCTT 2005), College of Engineering Trivandrum, Kerala, vol.2, pp. 23-28, November 2005.\n88. S. Ushakumari and R. Sankaran, “Development of an intelligent controller for improved performance of an AVS drive system”, Proceedings of the International Conference on Intelligent Systems and Control (ISC 2005), Massachusetts, USA, pp. 241-246, November. 2005.\n89. K. Jamuna, P.S. Chandramohanan Nair and Dr. S. Ushakumari, “Dynamic performance improvement AGC with advanced controllers and SMES unit”, Proceedings of the National Conference on Recent Trends in Technological Advancement, College of Engineering Trivandrum, Kerala, vol.3, pp. 53-59, November 2004.\n90. M.P. Rijesh and Dr. S. Ushakumari, “Trajectory optimization for re-entry of a reusable launch vehicle”, Proceedings of the National Conference on Recent Trends in Technological Advancement, College of Engineering Trivandrum, Kerala, Kerala, vol.3, pp. 19-25, November 2004.\n91.   S. Ushakumari, R. Sankaran and P. S. Chandramohanan Nair, “Steady-state performance of a permanent magnet brushless dc motor incorporating non-linearities,” Proceedings of the 14th Kerala Science Congress – 2002), Cochin University of Science and Technology, Cochin, Kerala, February 2002. pp. 487-491.\n92.  S. Ushakumari, R. Sankaran and P. S. Chandramohanan Nair, “Analysis and simulation of open loop and closed loop performance of three phase permanent magnet brushless dc motor drive system,” Proceedings of the International Conference on Energy, Automation and Information Technology (EAIT-2001), IIT Kharagpur, India, December 2001, pp. 263-267.\n93.  S. Ushakumari, R. Sankaran and P. S. Chandramohanan Nair, “Adaptive Neuro-fuzzy controller for improved performance of a permanent magnet brushless dc motor,” Proceedings of the 10th IEEE International Conference on Fuzzy systems (FUZZ-IEEE 2001), University of Melbourne, Australia, December 2001, pp. 493-496.\n94. S. Ushakumari, R. Sankaran and P. S. Chandramohanan Nair, “Modelling and simulation of the transient performance of a permanent magnet brushless dc motor drive system,” Proceedings of the 27th annual Convention and Exhibition of IEEE India Council (IEEE-ACE 2001), New Delhi, India, November 2001, pp. 71-75.\n95. S. Ushakumari, R. Sankaran and P. S. Chandramohanan Nair, “Modelling, analysis and simulation of a three-phase permanent magnet brushless dc motor, considering the non-linearity in torque-balance equation,” Proceedings of the National Conference on Intelligent and Efficient Electrical Systems (NCIEES), PSG College of Technology, Coimbatore, India, January 2001, pp. 211-217.\nResearch, Consultancy, Publication\nM. Sabna, V P. Mini, S. Ushakumari, N. Mayadevi, & R. Harikumar, “A Hybrid Fault Detection and Diagnosis Algorithm for Five-Phase PMSM Drive”, Arabian Journal for Science and Engineering (Springer), 2022 (SCIE).\nM. Sabna, V P. Mini, S. Ushakumari, N. Mayadevi, & R. Harikumar, “A Single Detection and Diagnosis Algorithm for Electrical Faults in a Five-Phase Permanent Magnet Synchronous Motor Drive”, Journal of Electrical Systems, 2024 (SCOPUS).\nM. Sabna, V P. Mini, S. Ushakumari, N. Mayadevi, & R. Harikumar, “A combined fault detection and diagnoses algorithm for open circuit faults and magnetic faults in a five-phase PMSM drive”, e-Prime – Advances in Electrical Engineering, Electronics and Energy (Elsevier), 2024 (SCOPUS).\nM. Sabna, V P. Mini, S. Ushakumari, N. Mayadevi, R. Harikumar & G.Vijayasre “Inter Turn Short Circuit Fault Analysis of Five-Phase PMSM”, IEEE 4th International Conference on Computing, Power and Communication Technologies, Malaysia, 2021.\nM. Sabna, V P. Mini, S. Ushakumari, N. Mayadevi, & R. Harikumar, “An Algorithm for Detecting Short Circuit Faults in Five-Phase PMSM Drives”, IEEE International Conference on Smart Power Control and Renewable Energy, NIT Rourkela, 2024.\nCommunity Outreach Activities\nHas taken UHV courses at different level for various category of participants across the state. The courses were of different duration. A total of 36  courses were given. Total No. of participants is 2874. The courses were provided during the duration Dec 2021 to May2025.\nIntroductory UHV\nFamily members, Classmates, Retd. Professors, Doctors and Bank Officers\nAcross the state\nStackmode\nA multi national company, Technopark, Trivandrum\nMembers of the MG University of third age\nAcross the state\nFaculty members, Office Staff, Cleaning and Security staff, Faculty of Architecture Department and retired professors of CET\nCollege of Engg., Trivandrum\nOfficers of the Regional Passport office\nPassport office\nFaculty members\nKGISL Institute of Technology, Coimbatore\nFaculty members\nBishop Jerome Institute of Engineering & Technology\nUniversity of the Third Age (MGU3A)\nAgricultural Cooperative Staff Training Institute\nFaculty members\nGovt. Engineering College, Trissur\nSenior citizens\nHappy Village, Koorkkanchery\nFamily\nFamily members of District Educational Officer\nSchool teachers\nHigh school, Manjeri\nSenior citizens\nMambad Mosque\nFaculty members\nGovt. Engineering College, Trissur\nSecond year Students\nGovt. Commercial Institute, Thiruvananthapuram\nSenior citizens\nSynergy group\nFaculty members\nGovt. Engineering College, Trissur\nPG Students\nLoyola College\nPG Students, UG students\nMar Baselios College of Engineering\nFaculty members\nCollege of Engineering Trivandrum\nStaff and officers of COIR board\nCOIR BOARD\nFirst year Students\nGovt. Commercial Institute, Thiruvananthapuram\nFaculty of Mohandas College of Engineering\nFaculty of Mohandas College of Engineering\nNational Conference of UHV Volunteers\nSelf\nSRM NCR Campus, Ghaziabad\nOrientation Programme on UHV\nHouse Keeping and Security Staff\nMar Baselios College of Engineering\nStudent Induction Programme\nfirst year students of all 11 batches separately\nMar Baselios College of Engineering\nUHV 1\nFaculty members\nMar Baselios College of Engineering\nUHV 1 &2\nFaculty, UG, PG students and PhD scholars\nMar Baselios College of Engineering\nUHV 2\nFaculty members\nTKMCE\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}