{
    "filename": "mbcet.ac.in_arts-culture_crossroads-2_.html",
    "content": "Crossroads – Mar Baselios College of Engineering And Technology\nSkip to content\nThe UGC has conferred Autonomous status in July 2020,Affiliated to APJ Abdul Kalam Technological University. Degree awarded by KTU.\n||\"Ph. D Admissions Open\"||\n||\"B.Tech admissions 2025 Rank List published\"||\nHome\n>\nArts & Sports\n>\nCrossroads\nCrossroads\nCrossroads 2022:\nThe Logo launch for the techno-cultural fest Crossroads, was conducted on 19th March,2022 from 9 am to 2:30 pm. Gowri Lekshmi was the chief guest for that day. The music performance for the day was performed by the band, Moksha United.\nCrossroads 2022, was conducted on 26,27 and 28 June, 2022 at Girideepam Convention Centre. Crossroads 2022 was inaugurated by Rev. Fr. John Varghese, Bursar and Dr. Abraham T Mathew, Principal by lightning the lamp on 26\nth\nJune. On 27\nth\n, a talk show was conducted with renowned Malayalam film actor and director Mr. Basil Joseph. There were 17 competition events with 438 participants from various colleges and two non-competitions. All events were evaluated by eminent personalities from respective fields. On 28\nth\n, College Day was celebrated. The inaugural ceremony on 28\nth\nJune, was presided by Bishop Most Rev. Dr. Thomas Mar Eusebius, Diocese of Parassala. The Chief guest was Mr. Unni Menon, playback singer. The college day included a proshow which was an interactive music performance by the very popular band Masala Coffee.\nAkhil C – Event Head\nSidharth S Ashok – Finance Head\nRupesh R – Cultural Head\nLitto K Lal – Program convenor\nShahin Sadath , Rhea Merin – Creative Heads\nAshwin SS – Marketing Head\nHritika  – Technical Head\nArjun sajeev – logistics Head\nSalman Faariz – Publicity Head\nHrithik R -Discipline Head\nGautham Krishna, Rohit p kurup – Invitation Heads\nVasundhara G – control room , P.R.O\nparvathy – Registration Head\nAnupam shaji – Food and Refreshment\nCrossroads 2020 – Logo Release\nCrossroads 2019\nmore info crossroads 2019\nCrossroads 2018\nCrossroads 2018, the annual techno-cultural fest was held on March 3\nrd\n, 4\nth\nand 5\nth\n2018. Every edition of crossroads has a theme and we attempt to assimilate this into the very fabric of the fest. This time, the tagline is:\nMANIFEST THE INFINITE\n. It provides a platform for all college students to showcase their talents and also provides an arena to compete against the best in the country.\nThe various prizes and awards were distributed to the students during the prize giving ceremony after which the audience was treated to a vibrant and rich display of cultural programs performed by the students. The following two days were exciting and fun-filled, with over 17 Technical and 31 Cultural events. The event was organized and executed by the Crossroads Core Committee:\nAjesh – Events Head\nPaul Mathew – Program Convenor\nAkhil P. Nair –  Cultural Head\nJithin Jose – Technical Head\nRahul Mathew Jacob – Creative Head\nVyshnav Sunil – Marketing Head\nAaron George – Finance Head\nJithin Babu – Publicity Head\nJacob A. John – Logistics Head\nAnand Joseph – Food and Refreshments Head\nSuhail Nizam – Discipline Head\nAditya Raj – Invitation Head\nSree Saranyan – Control Room Head\nMerlin M. Abraham – P. R. O.\nVidhya Sajeev – Registration Head\nCrossroads 2017\nCrossroads 2017, the annual techno-cultural fest was held from 31st March, 2017 to 2nd April, 2017 with the tagline:\nDream. Impel. Explore\n. The event was inaugurated by Shri. Kunchako Boban, a well known cine artist, following which we had the College Day Celebrations. The various prizes and awards were distributed to the students during the prize giving ceremony after which the audience was treated to a vibrant and rich display of cultural programs performed by the students. The following two days were exciting and fun-filled, with over 15 technical and 30 cultural events. Around 25 colleges from different parts of the country participated for the same. The event was organized and executed by the Crossroads Core Committee:\nRahul Raj – Event Co-ordinator\nKannan Mahesh – Program Convenor\nVivek M. Jude –  Cultural Head\nHarikrishnan Menon – Technical Head\nGokul Santhosh – Creative Head\nAnanthakrishnan P – Marketing Head\nAugustine B S – Finance Head\nAbhishek Krishnan – Publicity Head\nAnand Dhas – Logistics Head\nKaran Kishor – Refreshment and Stalls Head\nSwaroop Thomas – Discipline Head\nRejin Balachandran – Invitation Head\nVinay R Chandran – Control Room Head\nDevika Ashok – P. R. O.\nPooja G S – Registration Head\nThe second and first year students stood with the third year students and together the various events were wonderfully conducted. It would not have been possible without the guidance and advice given by the senior students. Overall, Crossroads 2017 helped all the students work together and understand the importance of teamwork and mutual respect leading to the grand success of the fest.\nArts\nSports\nCrossroads\nANNOUNCEMENTS\nExam Notifications\nNew\nM.Tech Admissions 2025\nNew\nB. Tech Admissions 2025\nNew\nMBCET e-bulletin\nNew"
}